{
  "expression_380": {
    "id": 380,
    "primary": "I put my family first.",
    "meaning": "나는 가족을 최우선으로 생각해요.",
    "similar": [
      "Family is my top priority.",
      "I'm all about my fam.",
      "My family comes before everything.",
      "Day one is always family.",
      "I prioritize my kin."
    ],
    "example": "A: Yo, you still coming through to the party tonight?\nB: Nah, I gotta stay in. My sister's visiting and I put my family first.\nA: Respect. I didn't know the fam was in town.\nB: Yeah, we don't get to see each other much, so it's a must.\nA: For sure. Family always comes first no matter what.\nB: Facts. Catch you later this week though?"
  },
  "expression_381": {
    "id": 381,
    "primary": "I could get the most out of it.",
    "meaning": "그것을 최대한 활용할 수 있었어요.",
    "similar": [
      "I maximized the benefits.",
      "I squeezed every drop out of it.",
      "I made the most of the situation.",
      "I really capitalized on it.",
      "I utilized it to the fullest."
    ],
    "example": "A: How was that internship you did over the summer?\nB: It was solid. I really felt like I could get the most out of it.\nA: That's dope. Did you get to work on any big projects?\nB: Yeah, they let me lead a small team. It was a huge learning curve.\nA: I'm glad you didn't let that opportunity go to waste.\nB: No way. I was definitely trying to level up."
  },
  "expression_382": {
    "id": 382,
    "primary": "Sometimes we don't see eye to eye.",
    "meaning": "가끔 우리는 의견이 맞지 않아요.",
    "similar": [
      "We have our differences.",
      "We don't always agree.",
      "We're not on the same page sometimes.",
      "Our views clash occasionally.",
      "We bump heads every now and then."
    ],
    "example": "A: You and your roommate still good?\nB: Yeah, we're fine, but sometimes we don't see eye to eye on the chores.\nA: I feel you. Living with people is a constant adjustment.\nB: For real. He thinks the dishes can wait, and I'm like 'nope'.\nA: As long as you guys can talk it out, it's whatever.\nB: Facts. We just gotta find that middle ground."
  },
  "expression_383": {
    "id": 383,
    "primary": "If everything goes according to plan.",
    "meaning": "모든 게 계획대로 된다면요.",
    "similar": [
      "If all goes well.",
      "With any luck.",
      "If things pan out as expected.",
      "Assuming the plan sticks.",
      "If we stay on track."
    ],
    "example": "A: When are you officially moving into the new spot?\nB: If everything goes according to plan, I'll be there by Friday.\nA: That's a quick turnaround. You all packed yet?\nB: Almost. Just a few more boxes and I'm good to go.\nA: Dope. Let me know if you need a hand with the heavy lifting.\nB: Shot. I'll definitely hit you up."
  },
  "expression_384": {
    "id": 384,
    "primary": "You're more than welcome to stay.",
    "meaning": "얼마든지 더 머물다 가셔도 돼요.",
    "similar": [
      "Feel free to hang back.",
      "We'd love to have you stay.",
      "Don't feel rushed to leave.",
      "The door's always open for you.",
      "Mi casa es su casa."
    ],
    "example": "A: It's getting late. I should probably head out.\nB: Honestly, you're more than welcome to stay if you don't wanna drive.\nA: You sure? I don't wanna overstay my welcome.\nB: Not at all. We've got extra space, so it's chill.\nA: I really appreciate that. I am pretty beat.\nB: Say less. I'll grab some extra blankets for you."
  },
  "expression_385": {
    "id": 385,
    "primary": "It will do the trick.",
    "meaning": "그거면 충분할 거예요.",
    "similar": [
      "That'll work.",
      "That'll get the job done.",
      "It's good enough.",
      "That should solve it.",
      "That'll suffice."
    ],
    "example": "A: Do you think this duct tape is enough for the leak?\nB: Yeah, it will do the trick until the plumber gets here.\nA: Hope so. I don't want the kitchen floor to turn into a pool.\nB: It's just a temporary fix, so don't stress too much.\nA: True. I'll keep an eye on it just in case.\nB: Smart move. Let's just pray it holds."
  },
  "expression_386": {
    "id": 386,
    "primary": "Once you get the hang of it, it's pretty easy.",
    "meaning": "일단 요령을 터득하면 꽤 쉬워요.",
    "similar": [
      "Once you catch on, it's a breeze.",
      "It's simple once you find your rhythm.",
      "You'll get it down in no time.",
      "It's all about that learning curve.",
      "After some practice, it's effortless."
    ],
    "example": "A: This editing software is so confusing, I'm about to quit.\nB: Chill. Once you get the hang of it, it's pretty easy.\nA: Easy for you to say. You've been doing this for years.\nB: Trust me, it was a struggle for me at first too.\nA: Alright, show me that shortcut again.\nB: See? Once it clicks, you'll be flying through these edits."
  },
  "expression_387": {
    "id": 387,
    "primary": "As far as that is concerned.",
    "meaning": "그 점에 관해서라면요.",
    "similar": [
      "In regards to that.",
      "Regarding that matter.",
      "When it comes to that.",
      "Speaking of which.",
      "As for that part."
    ],
    "example": "A: Are we still worried about the budget for the event?\nB: As far as that is concerned, we're actually in the clear.\nA: Oh word? Did we get that extra sponsorship?\nB: Yeah, they confirmed this morning. We've got more than enough.\nA: That's a huge weight off my shoulders.\nB: Definitely. Now we can finally focus on the actual content."
  },
  "expression_388": {
    "id": 388,
    "primary": "I leaned on him.",
    "meaning": "나는 그에게 의지했어요.",
    "similar": [
      "I relied on him.",
      "He was my support system.",
      "I counted on him.",
      "He was my rock.",
      "I turned to him for help."
    ],
    "example": "A: How did you get through that rough patch last year?\nB: Honestly, I leaned on him a lot. He was always there.\nA: It's good to have someone like that in your corner.\nB: Facts. I don't think I could've handled it alone.\nA: He's a real one for sure.\nB: 100%. I'm forever grateful for his support."
  },
  "expression_389": {
    "id": 389,
    "primary": "I'll take a rain check.",
    "meaning": "다음 기회에 할게요.",
    "similar": [
      "Maybe next time.",
      "Let's postpone.",
      "Can we do it later?",
      "I'll pass for now.",
      "Let's reschedule."
    ],
    "example": "A: Hey, we're all grabbing drinks after work. You in?\nB: I'd love to, but I'm swamped. I'll take a rain check.\nA: No worries. We'll definitely do it again soon.\nB: For sure. Have a round for me though.\nA: You got it. Don't work too hard!\nB: I'll try not to. Catch you tomorrow."
  },
  "expression_390": {
    "id": 390,
    "primary": "How did your summer project go?",
    "meaning": "여름 프로젝트는 어떻게 됐나요?",
    "similar": [
      "How was the summer project?",
      "Did the summer project turn out well?",
      "How'd the project go over the summer?",
      "What's the status of your summer project?",
      "How did that summer thing end up?"
    ],
    "example": "A: Long time no see! How did your summer project go?\nB: It went surprisingly well. We actually finished ahead of schedule.\nA: That's impressive. What was the main focus again?\nB: We were building a community garden in Brooklyn.\nA: Dope. I'd love to come check it out sometime.\nB: Definitely. It's looking really good now."
  },
  "expression_391": {
    "id": 391,
    "primary": "I ended up becoming an English teacher.",
    "meaning": "결국 영어 선생님이 되었어요.",
    "similar": [
      "I turned out to be an English teacher.",
      "I eventually became an English teacher.",
      "Fate led me to teaching English.",
      "I landed a job as an English teacher.",
      "I found my path as an English teacher."
    ],
    "example": "A: I didn't know you studied literature in college!\nB: Yeah, and after a few odd jobs, I ended up becoming an English teacher.\nA: That's awesome. Do you enjoy working with the kids?\nB: Most of the time, yeah. It's definitely rewarding.\nA: I bet. You always were good at explaining things.\nB: Thanks. It feels like where I'm supposed to be."
  },
  "expression_392": {
    "id": 392,
    "primary": "I'll take over.",
    "meaning": "내가 인계받을게요.",
    "similar": [
      "I'll handle it from here.",
      "I'll take the lead now.",
      "I'll assume responsibility.",
      "I'll step in.",
      "I'll take the reins."
    ],
    "example": "A: I'm really struggling to keep up with these emails.\nB: Don't worry about it. I'll take over for the rest of the day.\nA: Are you sure? You've got your own stuff to do.\nB: I'm caught up on my work, so it's no biggie.\nA: You're a lifesaver. I really need a break.\nB: Take fifteen. I've got this under control."
  },
  "expression_393": {
    "id": 393,
    "primary": "It works for me.",
    "meaning": "저한테는 괜찮아요 (시간/방법 등).",
    "similar": [
      "That works for me.",
      "I'm cool with that.",
      "That fits my schedule.",
      "That's fine by me.",
      "Sounds good to me."
    ],
    "example": "A: Can we move our meeting to 3 PM instead of 1?\nB: Yeah, it works for me. I've got a gap then.\nA: Great. I'll update the calendar invite right now.\nB: Perfect. Should we meet in the usual conference room?\nA: Yeah, let's do that. See you then!\nB: Sounds like a plan. Catch you later."
  },
  "expression_394": {
    "id": 394,
    "primary": "I'll take one for the team.",
    "meaning": "팀을 위해 내가 희생할게요.",
    "similar": [
      "I'll make the sacrifice.",
      "I'll step up for the group.",
      "I'll do it for the squad.",
      "I'll bear the brunt for us.",
      "I'll take the hit."
    ],
    "example": "A: Someone needs to stay late and finish this report.\nB: Honestly, I'll take one for the team and do it. Everyone else has plans.\nA: You're a legend. We'll definitely make it up to you.\nB: It's whatever. I didn't have much going on tonight anyway.\nA: We'll buy you lunch tomorrow for sure.\nB: Say less. I'm holding you to that!"
  },
  "expression_395": {
    "id": 395,
    "primary": "I'll keep you posted on that.",
    "meaning": "계속 상황을 알려줄게요.",
    "similar": [
      "I'll keep you updated.",
      "I'll let you know what happens.",
      "I'll stay in touch about it.",
      "I'll give you the lowdown later.",
      "I'll keep you in the loop."
    ],
    "example": "A: Any news on the job interview yet?\nB: Not yet, but I'll keep you posted on that as soon as I hear back.\nA: Fingers crossed for you! You definitely deserve it.\nB: Thanks, fam. I'm trying not to overthink it.\nA: Just keep doing your thing. The right offer will come.\nB: Facts. I'll hit you up as soon as the phone rings."
  },
  "expression_396": {
    "id": 396,
    "primary": "That's close enough.",
    "meaning": "그 정도면 충분해요 (거의 비슷해요).",
    "similar": [
      "That'll do.",
      "It's near enough.",
      "Good enough.",
      "Close enough for me.",
      "It's within the ballpark."
    ],
    "example": "A: I tried to match the paint, but it's a tiny bit darker.\nB: Honestly? That's close enough. No one's gonna notice.\nA: You sure? It's bothering me a little bit.\nB: Trust me, once the furniture is back, it'll blend right in.\nA: Alright, if you say so. I'm done for today then.\nB: Facts. Let's just grab some pizza and call it a win."
  },
  "expression_397": {
    "id": 397,
    "primary": "It's worth doing the right thing.",
    "meaning": "옳은 일을 할 가치가 있어요.",
    "similar": [
      "Doing the right thing matters.",
      "Integrity is worth it.",
      "It's important to be ethical.",
      "The right path is always the best path.",
      "Character is everything."
    ],
    "example": "A: I could've just kept the extra change the cashier gave me.\nB: But you gave it back. It's worth doing the right thing, you know?\nA: Yeah, I would've felt guilty if I didn't.\nB: Exactly. Good karma always comes back around.\nA: For sure. I feel much better now.\nB: That's the spirit. Integrity is key."
  },
  "expression_398": {
    "id": 398,
    "primary": "I'll take that as a compliment.",
    "meaning": "칭찬으로 받아들일게요.",
    "similar": [
      "I'll take that as a win.",
      "I'll assume you meant that nicely.",
      "Thanks, I'll take it.",
      "I appreciate the kind words.",
      "I'll take that to heart."
    ],
    "example": "A: You're so stubborn when it comes to your art.\nB: Haha, I'll take that as a compliment. I'm just passionate.\nA: I meant it in a good way, actually. Your focus is crazy.\nB: Thanks. I really try to be intentional with everything I create.\nA: It definitely shows in the final product.\nB: I appreciate that. Means a lot coming from you."
  },
  "expression_399": {
    "id": 399,
    "primary": "I'll get right on it.",
    "meaning": "당장 시작할게요.",
    "similar": [
      "I'll start immediately.",
      "I'm on it.",
      "I'll jump on it right now.",
      "I'll tackle it ASAP.",
      "I'll handle it straight away."
    ],
    "example": "A: Can you fix that typo on the website before the client sees it?\nB: Oh snap, I'll get right on it. Good catch!\nA: No sweat. I just happened to notice it while browsing.\nB: It should be fixed in like two minutes.\nA: Perfect. Let me know when it's live.\nB: Done. Check it out now."
  },
  "expression_400": {
    "id": 400,
    "primary": "It's as good as new.",
    "meaning": "새것이나 다름없어요.",
    "similar": [
      "It's in mint condition.",
      "It's like it never happened.",
      "It's perfectly restored.",
      "It's back to its original state.",
      "It's flawless now."
    ],
    "example": "A: Did you manage to fix that cracked screen?\nB: Yeah, look at it. It's as good as new.\nA: Wow, I can't even see where the crack was.\nB: The repair shop did a solid job. Worth every penny.\nA: No cap. It looks like you just bought it.\nB: For real. I'm definitely going back there if I break it again."
  },
  "expression_401": {
    "id": 401,
    "primary": "They have a lot in common.",
    "meaning": "그들은 공통점이 많아요.",
    "similar": [
      "They're very similar.",
      "They share many interests.",
      "They have a lot of similarities.",
      "They're on the same wavelength.",
      "They're two peas in a pod."
    ],
    "example": "A: Have you met my new coworkers? They're hilarious.\nB: Yeah, I noticed they have a lot in common. Both are into retro games.\nA: Facts. They've been talking about old-school Nintendo all day.\nB: It's good they hit it off so quickly.\nA: For sure. Makes the office vibe a lot more chill.\nB: Definitely. Team chemistry is everything."
  },
  "expression_402": {
    "id": 402,
    "primary": "That's typical of you.",
    "meaning": "딱 너답네.",
    "similar": [
      "That's so you.",
      "Classic you.",
      "Spoken like a true [your name].",
      "No surprise there.",
      "That's just your style."
    ],
    "example": "A: I decided to volunteer at the animal shelter again this weekend.\nB: Haha, that's typical of you. Always trying to help out.\nA: I just can't say no to those cute faces, you know?\nB: I know. You've always had a big heart.\nA: I guess it's just my thing.\nB: It's a good thing. Don't ever change."
  },
  "expression_403": {
    "id": 403,
    "primary": "You look after yourself.",
    "meaning": "몸조리 잘 하세요.",
    "similar": [
      "Take care of yourself.",
      "Don't overwork.",
      "Prioritize your health.",
      "Be kind to yourself.",
      "Stay healthy."
    ],
    "example": "A: I'm heading out for my trip tomorrow morning.\nB: Safe travels! Make sure you look after yourself while you're away.\nA: I will. I've got my vitamins and my itinerary all set.\nB: Good. Don't push yourself too hard, just enjoy the vibe.\nA: Thanks, fam. I'll hit you up when I land.\nB: Sounds good. Peace out!"
  },
  "expression_404": {
    "id": 404,
    "primary": "Go for it!",
    "meaning": "한번 해봐!",
    "similar": [
      "Just do it!",
      "Give it a shot!",
      "Don't hold back!",
      "Take the leap!",
      "Shoot your shot!"
    ],
    "example": "A: I'm thinking about starting my own podcast, but I'm nervous.\nB: Honestly? Go for it! You've got so many interesting stories to tell.\nA: You really think people would listen?\nB: 100%. Your perspective is unique, and that's what matters.\nA: Alright, I'm gonna start recording this weekend.\nB: That's what I'm talking about! I'll be your first listener."
  },
  "expression_405": {
    "id": 405,
    "primary": "He's a piece of work.",
    "meaning": "그는 정말 골칫덩이예요.",
    "similar": [
      "He's a character.",
      "He's a handful.",
      "He's quite a personality.",
      "He's something else.",
      "He's difficult to deal with."
    ],
    "example": "A: Did you hear what the new manager did this morning?\nB: Ugh, yeah. Honestly, he's a piece of work. Always micromanaging.\nA: It's getting really old, really fast.\nB: Facts. I don't know how much longer I can deal with it.\nA: Hopefully he chills out once he's settled in.\nB: I wouldn't hold my breath. He seems set in his ways."
  },
  "expression_406": {
    "id": 406,
    "primary": "I won't let you down.",
    "meaning": "실망시켜 드리지 않을게요.",
    "similar": [
      "I won't disappoint you.",
      "I'll come through for you.",
      "You can count on me.",
      "I'll make you proud.",
      "I'll deliver."
    ],
    "example": "A: I'm trusting you with this big account. Don't mess it up.\nB: I won't let you down, I promise. I've been preparing for this.\nA: I know you have. I believe in your skills.\nB: Thanks for the opportunity. I'm gonna give it 110%.\nA: That's the energy I like to see.\nB: I'll have the first draft ready by tomorrow morning."
  },
  "expression_407": {
    "id": 407,
    "primary": "I've been trying to reach you.",
    "meaning": "계속 연락하려고 했어요.",
    "similar": [
      "I've been trying to get ahold of you.",
      "I've been blowing up your phone.",
      "I was looking for you.",
      "I've been trying to connect with you.",
      "I was trying to find you."
    ],
    "example": "A: Yo, I missed like five calls from you! What's up?\nB: Man, I've been trying to reach you all day! Where were you?\nA: My phone was on silent during the movie. My bad.\nB: All good. Anyway, we're all meeting at the pizza spot in ten.\nA: Say less. I'm leaving right now.\nB: Bet. See you there."
  },
  "expression_408": {
    "id": 408,
    "primary": "It was a stroke of luck.",
    "meaning": "뜻밖의 행운이었어요.",
    "similar": [
      "It was a fluke.",
      "It was pure luck.",
      "I got lucky.",
      "It was a happy accident.",
      "A fortunate coincidence."
    ],
    "example": "A: How did you find such a great apartment in this market?\nB: Honestly, it was a stroke of luck. I saw the listing five minutes after it went up.\nA: That's insane. Most spots are gone in an hour.\nB: For real. I signed the lease before anyone else even toured it.\nA: You definitely used up all your luck for the year on that one.\nB: Facts. But honestly? Totally worth it."
  },
  "expression_409": {
    "id": 409,
    "primary": "Don't bottle up your feelings.",
    "meaning": "감정을 억누르지 마세요.",
    "similar": [
      "Don't suppress your emotions.",
      "Speak your mind.",
      "Don't hold it all in.",
      "Let it out.",
      "Share how you're feeling."
    ],
    "example": "A: You've been really quiet lately. Is everything alright?\nB: I'm just stressed, I guess. It's no big deal.\nA: Look, don't bottle up your feelings. It's better to talk about it.\nB: I just don't wanna bother anyone with my problems.\nA: You're not bothering me. That's what friends are for.\nB: Thanks. Maybe I do need to vent a little."
  },
  "expression_410": {
    "id": 410,
    "primary": "It is hard to come by.",
    "meaning": "구하기 힘든 거예요.",
    "similar": [
      "It's rare.",
      "It's difficult to find.",
      "It's a scarce item.",
      "It's not easy to find.",
      "It's one of a kind."
    ],
    "example": "A: Where did you find that vintage leather jacket?\nB: At a small thrift shop upstate. Pieces like this are hard to come by.\nA: The quality is incredible. They really don't make them like this anymore.\nB: For real. I was shocked it was even in my size.\nA: You definitely scored big time.\nB: Facts. I'm never letting this one go."
  },
  "expression_411": {
    "id": 411,
    "primary": "You're growing on me.",
    "meaning": "네가 점점 좋아지네.",
    "similar": [
      "I'm starting to like you.",
      "You're becoming a favorite.",
      "I'm warming up to you.",
      "You're winning me over.",
      "I'm starting to appreciate you more."
    ],
    "example": "A: I know I'm a bit much sometimes, but I mean well.\nB: Don't worry about it. Honestly? You're growing on me.\nA: Oh, really? I thought I was annoying you.\nB: You were at first, but now I think you're just hilarious.\nA: I'll take that as a win.\nB: As you should. Let's get some coffee."
  },
  "expression_412": {
    "id": 412,
    "primary": "I burnt the midnight oil.",
    "meaning": "밤늦게까지 열심히 일했어요.",
    "similar": [
      "I worked late into the night.",
      "I pulled an all-nighter.",
      "I stayed up working.",
      "I put in extra hours at night.",
      "I was grinding late."
    ],
    "example": "A: You look exhausted. Did you actually get any sleep?\nB: Barely. I burnt the midnight oil to finish that presentation.\nA: Was it worth it? Hope the client liked it.\nB: They loved it. All that effort really paid off.\nA: Good to hear, but you should definitely crash early tonight.\nB: 100%. My brain is officially fried."
  },
  "expression_413": {
    "id": 413,
    "primary": "Cut me some slack.",
    "meaning": "좀 봐주세요.",
    "similar": [
      "Give me a break.",
      "Take it easy on me.",
      "Don't be so hard on me.",
      "Show me some mercy.",
      "Lighten up on me."
    ],
    "example": "A: You're ten minutes late again. This is becoming a habit.\nB: Look, cut me some slack. The subway was a complete mess today.\nA: I know, but you gotta plan for that.\nB: I did! There was an unexpected delay. I'm doing my best.\nA: Alright, just try to be more punctual from now on.\nB: I got you. I'll leave even earlier tomorrow."
  },
  "expression_414": {
    "id": 414,
    "primary": "That would be the best case scenario.",
    "meaning": "그게 최상의 시나리오일 거예요.",
    "similar": [
      "That's the ideal situation.",
      "That would be perfect.",
      "If everything goes right, that's what happens.",
      "That's the ultimate goal.",
      "That would be the dream."
    ],
    "example": "A: If we launch by Monday, we'll beat all our competitors.\nB: That would be the best case scenario. Everyone's working overtime.\nA: Do you think we can actually make it happen?\nB: It's a tight squeeze, but it's definitely possible.\nA: Fingers crossed. This would be huge for the team.\nB: For real. Let's just keep this momentum going."
  },
  "expression_415": {
    "id": 415,
    "primary": "I couldn't agree more.",
    "meaning": "전적으로 동감이에요.",
    "similar": [
      "I'm totally with you.",
      "I 100% agree.",
      "You can say that again.",
      "Facts.",
      "My thoughts exactly."
    ],
    "example": "A: New York is honestly the best city for inspiration.\nB: I couldn't agree more. The energy here is just different.\nA: For real. Everywhere you look, there's someone doing something creative.\nB: It's like you can't help but feel motivated.\nA: Facts. I never want to live anywhere else.\nB: Same. This city is just in my blood."
  },
  "expression_416": {
    "id": 416,
    "primary": "I've got a memory like a sieve.",
    "meaning": "제 기억력이 형편없어요.",
    "similar": [
      "I'm very forgetful.",
      "I have a terrible memory.",
      "Things just slip my mind.",
      "I can't remember anything.",
      "My brain is like a blank slate sometimes."
    ],
    "example": "A: Did you remember to pick up the milk on your way home?\nB: Oh snap! I completely forgot. I've got a memory like a sieve.\nA: I literally texted you ten minutes ago!\nB: I know, I know. I saw it and then immediately got distracted.\nA: It's all good, I'll just go grab it now.\nB: My bad, fam. I'll make it up to you."
  },
  "expression_417": {
    "id": 417,
    "primary": "It's on the house.",
    "meaning": "서비스입니다.",
    "similar": [
      "It's free.",
      "It's a gift from us.",
      "No charge for this one.",
      "We're not charging you.",
      "This one's included."
    ],
    "example": "A: Wait, I didn't see this appetizer on the bill.\nB: Don't worry about it, it's on the house. Thanks for coming in tonight!\nA: Oh, that's so sweet! Thank you so much.\nB: Of course. You guys are regulars, we gotta show some love.\nA: We really appreciate that. The food was incredible as always.\nB: Glad you enjoyed it! See you next time."
  },
  "expression_418": {
    "id": 418,
    "primary": "I think you should get a second opinion.",
    "meaning": "다른 의견도 들어보는 게 좋겠어요.",
    "similar": [
      "Consult someone else.",
      "Get another perspective.",
      "See what others think.",
      "Ask for another viewpoint.",
      "Double check with another expert."
    ],
    "example": "A: The mechanic says my car needs a whole new engine.\nB: That sounds extreme. I think you should get a second opinion.\nA: You're right. I don't really trust that guy anyway.\nB: Take it to my guy in Queens. He's honest and won't overcharge you.\nA: Good looks. I'll give him a call tomorrow.\nB: Definitely. Better safe than sorry."
  },
  "expression_419": {
    "id": 419,
    "primary": "You are second to none.",
    "meaning": "당신은 최고예요.",
    "similar": [
      "You're the best.",
      "You're unbeatable.",
      "You're unmatched.",
      "You're elite.",
      "You're at the top of your game."
    ],
    "example": "A: I really appreciate all the help you've given me with this project.\nB: Any time! Honestly, your work ethic is second to none.\nA: Wow, thanks. I really try to put in the effort.\nB: It shows. You're easily the most dedicated person on the team.\nA: That means a lot coming from you.\nB: Facts. Just keep doing what you're doing."
  },
  "expression_420": {
    "id": 420,
    "primary": "Don't pull my leg.",
    "meaning": "농담 마세요 (놀리지 마세요).",
    "similar": [
      "Don't mess with me.",
      "Are you kidding?",
      "Quit playing around.",
      "Don't joke with me.",
      "Are you for real?"
    ],
    "example": "A: Guess what? I just won a thousand dollars on a scratch-off!\nB: No way! Don't pull my leg, show me the ticket.\nA: I'm dead serious! Look right here.\nB: Oh my god, you actually did it! That's insane!\nA: I know! I'm still in shock.\nB: Drinks are definitely on you tonight then!"
  },
  "expression_421": {
    "id": 421,
    "primary": "Cat got your tongue?",
    "meaning": "왜 꿀 먹은 벙어리가 됐어?",
    "similar": [
      "Why are you so quiet?",
      "Lost for words?",
      "Nothing to say?",
      "Why the silence?",
      "Speak up!"
    ],
    "example": "A: You said you were gonna confront him, so what happened?\nB: I... I don't know. I just couldn't say it.\nA: What, cat got your tongue? You were so brave yesterday.\nB: It's different when you're actually looking at them, okay?\nA: I get it, but you gotta stand up for yourself eventually.\nB: I will. I just need a different approach."
  },
  "expression_422": {
    "id": 422,
    "primary": "You have lost the plot.",
    "meaning": "상황 파악을 못 하네요.",
    "similar": [
      "You've lost touch with reality.",
      "You're out of the loop.",
      "You don't understand the situation.",
      "You're confusing things.",
      "You've lost focus."
    ],
    "example": "A: I think we should skip the launch and just start a new project from scratch.\nB: Honestly? You have lost the plot. We're 90% done!\nA: I just feel like the market has changed, you know?\nB: In three months? No way. We need to finish what we started.\nA: Maybe you're right. I'm just feeling a bit overwhelmed.\nB: Take a breather. We're almost at the finish line."
  },
  "expression_423": {
    "id": 423,
    "primary": "Let's just keep it between us.",
    "meaning": "우리끼리만 알고 있자.",
    "similar": [
      "Keep it a secret.",
      "Don't tell anyone else.",
      "Just between the two of us.",
      "Keep it under wraps.",
      "Let's keep this private."
    ],
    "example": "A: I'm planning on quitting my job next month.\nB: Oh wow! Have you told anyone else yet?\nA: No, so let's just keep it between us for now.\nB: Of course. Your secret is safe with me.\nA: I appreciate that. I just want everything to be in place first.\nB: Smart move. Let me know if I can help with anything."
  },
  "expression_424": {
    "id": 424,
    "primary": "You know the drill.",
    "meaning": "어떻게 하는지 알지?",
    "similar": [
      "You know how it goes.",
      "You know what to do.",
      "You're familiar with the process.",
      "Standard procedure.",
      "You've done this before."
    ],
    "example": "A: Alright, we've got another big shipment coming in tomorrow.\nB: Got it. You know the drill, I'll be here early to organize everything.\nA: Good looks. I'll handle the documentation then.\nB: Sounds like a plan. We'll be done by lunch if we move fast.\nA: For sure. Let's get it.\nB: Catch you in the morning."
  },
  "expression_425": {
    "id": 425,
    "primary": "It's been a roller coaster ride.",
    "meaning": "우여곡절이 많았어요.",
    "similar": [
      "It's been a wild ride.",
      "There have been many ups and downs.",
      "It's been a journey.",
      "It's been full of surprises.",
      "It's been quite an experience."
    ],
    "example": "A: How has the first year of your startup been?\nB: Honestly, it's been a roller coaster ride. Some days are great, some are stressful.\nA: I can imagine. Entrepreneurship is no joke.\nB: For real. But I'm learning a lot through all the chaos.\nA: That's the best way to grow though.\nB: Facts. I wouldn't trade it for anything."
  },
  "expression_426": {
    "id": 426,
    "primary": "I look up to you.",
    "meaning": "당신을 존경해요.",
    "similar": [
      "I admire you.",
      "You're an inspiration to me.",
      "I respect you a lot.",
      "I follow your lead.",
      "You're my role model."
    ],
    "example": "A: I really look up to you, especially how you handle difficult clients.\nB: Wow, thank you! I appreciate that a lot.\nA: No, seriously. You're always so calm and professional.\nB: It took years of practice, trust me. I used to be so stressed.\nA: Well, you're killing it now.\nB: Thanks, fam. That means more than you know."
  },
  "expression_427": {
    "id": 427,
    "primary": "It's overrated.",
    "meaning": "과대평가됐어요.",
    "similar": [
      "It's not that great.",
      "It's hyped up too much.",
      "It's disappointing.",
      "It doesn't live up to the hype.",
      "It's not worth the fuss."
    ],
    "example": "A: Everyone's talking about that new brunch spot in SoHo. Have you been?\nB: Yeah, and honestly? It's overrated. Food was mid at best.\nA: Oh really? The pictures look so good though.\nB: It's all for the aesthetic. The actual taste just isn't there.\nA: Good to know. I'll save my money for somewhere else.\nB: Definitely. There are way better spots for half the price."
  },
  "expression_428": {
    "id": 428,
    "primary": "It was a blessing in disguise.",
    "meaning": "전화위복이었어요.",
    "similar": [
      "It was a fortunate turn of events.",
      "It turned out for the better.",
      "Everything happens for a reason.",
      "A hidden benefit.",
      "It was for the best."
    ],
    "example": "A: I was so devastated when I didn't get that first job offer.\nB: But you ended up with a way better one! It was a blessing in disguise.\nA: Accurate. This company has a much better culture and pay.\nB: See? Life has a funny way of working itself out.\nA: For sure. I'm much happier here.\nB: I'm glad to hear it. Onwards and upwards!"
  },
  "expression_429": {
    "id": 429,
    "primary": "I don't hold a grudge.",
    "meaning": "뒤끝 없어요.",
    "similar": [
      "I don't stay angry.",
      "I forgive and forget.",
      "I'm not one to hold onto things.",
      "I move on quickly.",
      "No hard feelings."
    ],
    "example": "A: I'm really sorry about what I said during the argument yesterday.\nB: Don't worry about it. I don't hold a grudge. We're good.\nA: Thanks, I was really worried you'd be mad for a while.\nB: Life is too short for all that negativity. Let's just move forward.\nA: I appreciate that. You're a real one.\nB: Facts. Let's grab some lunch and put it behind us."
  },
  "expression_430": {
    "id": 430,
    "primary": "I don't know off the top of my head.",
    "meaning": "지금 당장은 기억이 안 나네요.",
    "similar": [
      "I can't remember right now.",
      "I'd have to check my notes.",
      "Nothing's coming to me currently.",
      "I'm drawing a blank.",
      "I don't have that info on hand."
    ],
    "example": "A: Do you remember the address of that new spot in Queens?\nB: Honestly? I don't know off the top of my head. Let me check my phone.\nA: No rush. I just wanted to see if it was close to the train.\nB: Found it! It's right on 31st Ave.\nA: Perfect. That's super easy to get to.\nB: Facts. We should definitely go this weekend."
  },
  "expression_431": {
    "id": 431,
    "primary": "I'm fed up with it.",
    "meaning": "그거 정말 질렸어요.",
    "similar": [
      "I'm annoyed by it.",
      "I've had enough.",
      "I'm over it.",
      "I can't stand it anymore.",
      "It's getting on my nerves."
    ],
    "example": "A: Why are you looking so stressed out today?\nB: It's these constant train delays. I'm honestly fed up with it.\nA: I feel you. The MTA has been a nightmare lately.\nB: For real. I've been late to work three times this week.\nA: Maybe it's time to start biking or something.\nB: Facts. At least then I'm in control of the timing."
  },
  "expression_432": {
    "id": 432,
    "primary": "I've got a lot on my plate.",
    "meaning": "할 일이 너무 많아요.",
    "similar": [
      "I'm very busy.",
      "I have a heavy workload.",
      "I'm swamped.",
      "My schedule is packed.",
      "I'm juggling many things."
    ],
    "example": "A: You coming through to the basketball game tonight?\nB: I wish! But I've got a lot on my plate with these finals coming up.\nA: Damn, I forgot you were in grad school too.\nB: Yeah, it's a lot to handle all at once.\nA: Respect. I'll catch you after you pass all those tests.\nB: Bet. I'll definitely need a drink then."
  },
  "expression_433": {
    "id": 433,
    "primary": "I'm bad with directions.",
    "meaning": "저는 길치예요.",
    "similar": [
      "I have no sense of direction.",
      "I always get lost.",
      "I'm navigationally challenged.",
      "I can't find my way anywhere.",
      "Maps confuse me."
    ],
    "example": "A: Just meet me at the corner of 5th and 14th.\nB: You know I'm bad with directions, right? Can you just send me your location?\nA: Haha, my bad. I forgot you're basically helpless without GPS.\nB: It's not funny! I'll end up in the wrong borough by accident.\nA: Sent. Just follow the blue dot, okay?\nB: On my way. Don't leave without me!"
  },
  "expression_434": {
    "id": 434,
    "primary": "How are you holding up?",
    "meaning": "어떻게 견디고 있어요?",
    "similar": [
      "How are you doing?",
      "How's everything going?",
      "Are you okay?",
      "How's the situation for you?",
      "How are you managing?"
    ],
    "example": "A: I heard about the breakup. How are you holding up?\nB: It's been tough, but I'm trying to stay busy.\nA: That's probably for the best. Let me know if you wanna vent.\nB: Thanks, I really appreciate it. Friends like you are a lifesaver.\nA: Any time. Let's grab some food tomorrow, my treat.\nB: Sounds like a plan. I could definitely use a distraction."
  },
  "expression_435": {
    "id": 435,
    "primary": "All you have to do is do it.",
    "meaning": "그냥 하기만 하면 돼요.",
    "similar": [
      "Just do it.",
      "It's as simple as that.",
      "Don't overthink it.",
      "Make it happen.",
      "Execution is key."
    ],
    "example": "A: I really want to start my own YouTube channel but I'm scared.\nB: Honestly? All you have to do is do it. Stop planning and just record something.\nA: But what if it's not perfect right away?\nB: No one's first video is perfect. You learn as you go.\nA: You're right. I'm just gonna pick up the camera today.\nB: That's the spirit. Start small and grow from there."
  },
  "expression_436": {
    "id": 436,
    "primary": "What do you have in mind?",
    "meaning": "무슨 생각을 하고 있나요?",
    "similar": [
      "What are you thinking?",
      "What's your plan?",
      "What's on your mind?",
      "What are you suggesting?",
      "What's your idea?"
    ],
    "example": "A: We should definitely do something fun for your birthday.\nB: I'm down. What do you have in mind? I'm open to anything.\nA: I was thinking we could do a rooftop dinner or something.\nB: Ooh, that sounds classy. Which spot were you thinking?\nA: There's this new place in Williamsburg with a crazy view.\nB: Say less. I'm already there in my head."
  },
  "expression_437": {
    "id": 437,
    "primary": "Don't be that way.",
    "meaning": "그러지 마세요.",
    "similar": [
      "Don't act like that.",
      "Chill out.",
      "Don't be like that.",
      "Stop being so difficult.",
      "Be nice."
    ],
    "example": "A: I'm not going to the party if she's gonna be there.\nB: Come on, don't be that way! It's my birthday, just ignore her.\nA: You know she always tries to start drama with me.\nB: I'll make sure she stays on the other side of the room.\nA: Fine, I'll go, but if she says one thing to me, I'm out.\nB: Deal. I'm just glad you're coming."
  },
  "expression_438": {
    "id": 438,
    "primary": "Let's get the ball rolling.",
    "meaning": "일을 시작해 봅시다.",
    "similar": [
      "Let's get started.",
      "Let's kick things off.",
      "Let's begin.",
      "Time to get to work.",
      "Let's start the process."
    ],
    "example": "A: We've been planning this launch for months.\nB: For real. It's finally time to get the ball rolling.\nA: Everyone knows their roles, right?\nB: Yeah, we're all set. Let's just execute.\nA: Perfect. I'll send out the first batch of emails now.\nB: Let's do it. Onwards and upwards!"
  },
  "expression_439": {
    "id": 439,
    "primary": "It costs an arm and a leg.",
    "meaning": "엄청 비싸요.",
    "similar": [
      "It's very expensive.",
      "It's overpriced.",
      "It's a major expense.",
      "That's not cheap at all.",
      "It's pricey."
    ],
    "example": "A: Did you see those new designer shoes at the mall?\nB: Yeah, but honestly? It costs an arm and a leg just to look at them.\nA: No cap. I love the style, but I have bills to pay.\nB: Exactly. I could buy like ten pairs of regular sneakers for that price.\nA: Facts. Some things just aren't worth the hype.\nB: Definitely. I'll stick to my thrift store finds."
  },
  "expression_440": {
    "id": 440,
    "primary": "Don't go through the motions.",
    "meaning": "건성으로 하지 마세요.",
    "similar": [
      "Give it your all.",
      "Don't just halfway do it.",
      "Be intentional.",
      "Put in the actual effort.",
      "Don't be lazy."
    ],
    "example": "A: I'm just trying to finish this task as fast as possible.\nB: Look, don't just go through the motions. Quality actually matters here.\nA: I know, I'm just feeling a bit burnt out today.\nB: Take a break then. It's better to do it right than to do it twice.\nA: You're right. I'll step away for a bit and come back refocus.\nB: Smart move. Do it right, and you won't have to worry about it later."
  },
  "expression_441": {
    "id": 441,
    "primary": "You took the words right out of my mouth.",
    "meaning": "내 말이 그 말이에요.",
    "similar": [
      "That's exactly what I was thinking.",
      "I was about to say that.",
      "Great minds think alike.",
      "You stole my line.",
      "We're on the same page."
    ],
    "example": "A: This coffee shop is way too loud to get any work done.\nB: Seriously! You took the words right out of my mouth.\nA: Let's just head over to the library instead.\nB: I'm down. It's much quieter over there anyway.\nA: Facts. Let's pack up our stuff and go.\nB: Say less. I'm already out the door."
  },
  "expression_442": {
    "id": 442,
    "primary": "You crossed the line.",
    "meaning": "선을 넘으셨네요.",
    "similar": [
      "That was inappropriate.",
      "You went too far.",
      "That's unacceptable.",
      "You're out of bounds.",
      "That was out of order."
    ],
    "example": "A: I was just joking about your new haircut, chill out.\nB: Honestly? You crossed the line when you brought up my insecurities.\nA: My bad, I didn't realize it would bother you that much.\nB: Some things just aren't funny, man. You gotta know the limit.\nA: You're right. I'm really sorry. I didn't mean any harm.\nB: I appreciate the apology. Let's just not go there again."
  },
  "expression_443": {
    "id": 443,
    "primary": "He knows his stuff.",
    "meaning": "그는 자기 분야를 잘 알아요.",
    "similar": [
      "He's an expert.",
      "He's very knowledgeable.",
      "He's well-versed in his field.",
      "He really knows what he's talking about.",
      "He's a pro."
    ],
    "example": "A: Should I ask the new guy for help with the coding issue?\nB: Definitely. He really knows his stuff when it comes to React.\nA: That's good to hear. I was struggling with this component for hours.\nB: He'll probably fix it in like five minutes. He's a wizard.\nA: Alright, I'll go hit him up now.\nB: Good luck. Let me know what he says."
  },
  "expression_444": {
    "id": 444,
    "primary": "Hang in there!",
    "meaning": "조금만 더 버텨봐!",
    "similar": [
      "Don't give up!",
      "Keep going!",
      "Stay strong!",
      "You can do it!",
      "Don't lose hope!"
    ],
    "example": "A: This week has been such a struggle at work.\nB: I know it's tough, but hang in there! Only two more days till the weekend.\nA: I'm honestly just counting down the hours at this point.\nB: You've got this. Keep your head up and push through.\nA: Thanks for the encouragement. It really helps during these long shifts.\nB: Any time. You're almost there!"
  },
  "expression_445": {
    "id": 445,
    "primary": "You need to break the habit.",
    "meaning": "그 습관을 고쳐야 해요.",
    "similar": [
      "Stop doing that regularly.",
      "Change your behavior.",
      "Kick the habit.",
      "End that routine.",
      "Develop a better habit."
    ],
    "example": "A: I keep checking my phone every five minutes without even thinking.\nB: You really need to break that habit. It's killing your focus.\nA: I know, but it feels like an addiction at this point.\nB: Try leaving it in another room while you're working.\nA: That's a good idea. I'll give it a shot today.\nB: Trust me, you'll feel way more productive."
  },
  "expression_446": {
    "id": 446,
    "primary": "You hit the nail on the head.",
    "meaning": "정곡을 찔렀네요.",
    "similar": [
      "You're exactly right.",
      "Spot on.",
      "You nailed it.",
      "You pinpointed the problem perfectly.",
      "Precisely."
    ],
    "example": "A: I think the real reason we're losing customers is the checkout process.\nB: Wow, you really hit the nail on the head. That's exactly where the drop-off happens.\nA: It's just too complicated and takes too many steps.\nB: Facts. We need to streamline it as much as possible.\nA: Let's start working on a simpler design today.\nB: I'm all for it. That should definitely boost our numbers."
  },
  "expression_447": {
    "id": 447,
    "primary": "My brain is not as good as it used to be.",
    "meaning": "예전만큼 머리가 안 돌아가요.",
    "similar": [
      "I'm getting forgetful.",
      "I'm not as sharp as before.",
      "I'm slowing down mentally.",
      "My cognitive skills are declining.",
      "I feel a bit rusty lately."
    ],
    "example": "A: Do you remember the name of that movie we watched last night?\nB: Honestly? My brain is not as good as it used to be. I already forgot.\nA: Haha, it was 'Inception'! How could you forget that?\nB: I don't know, man. Lately I just can't keep names straight.\nA: It's all good. Maybe you just need some more sleep.\nB: Facts. I'm definitely feeling a bit sluggish."
  },
  "expression_448": {
    "id": 448,
    "primary": "I was ripped off.",
    "meaning": "바가지 썼어요.",
    "similar": [
      "I was overcharged.",
      "I got scammed.",
      "I paid too much.",
      "I was tricked.",
      "It was a total ripoff."
    ],
    "example": "A: How much did you pay for that bottle of water at the concert?\nB: Ten bucks. I honestly felt like I was being ripped off.\nA: That's highway robbery! They really know people are desperate.\nB: For real. I should've just brought my own reusable bottle.\nA: Live and learn, I guess. At least you're hydrated now.\nB: Facts, but my wallet is definitely feeling lighter."
  },
  "expression_449": {
    "id": 449,
    "primary": "You've got to bite the bullet.",
    "meaning": "어려움을 참고 견뎌야 해요.",
    "similar": [
      "Face the difficulty.",
      "Accept the challenge.",
      "Toughen up.",
      "Handle the situation.",
      "Just do it even if it's hard."
    ],
    "example": "A: I really don't want to tell my boss about the mistake I made.\nB: Look, you've got to bite the bullet and just be honest about it.\nA: It's gonna be such an awkward conversation though.\nB: It'll be worse if they find out from someone else later.\nA: You're right. I'll just go in there and get it over with.\nB: Smart move. Integrity is always the best path."
  },
  "expression_450": {
    "id": 450,
    "primary": "I can't get that off my mind.",
    "meaning": "그게 머릿속에서 떠나질 않아요.",
    "similar": [
      "I'm obsessed with it.",
      "I keep thinking about it.",
      "It's stuck in my head.",
      "I can't stop pondering it.",
      "It's all I can think about."
    ],
    "example": "A: You've been staring at that same page for twenty minutes.\nB: I know. I just can't get that conversation we had earlier off my mind.\nA: Was it that bad? I thought we cleared things up.\nB: It's not that, it's just a lot to process, you know?\nA: I feel you. Just take your time with it.\nB: Thanks. I'll try to focus on something else for a bit."
  },
  "expression_451": {
    "id": 451,
    "primary": "Don't kid yourself.",
    "meaning": "착각하지 마세요.",
    "similar": [
      "Stop lying to yourself.",
      "Be realistic.",
      "Get a reality check.",
      "Don't be delusional.",
      "Face the truth."
    ],
    "example": "A: I think I can finish this whole project in one night.\nB: Look, don't kid yourself. You know that's not gonna happen.\nA: But I'm feeling really motivated right now!\nB: Motivation is great, but physics and time are still real things.\nA: Fine, maybe I'll need two nights then.\nB: Better. Let's aim for a realistic deadline instead."
  },
  "expression_452": {
    "id": 452,
    "primary": "It's no picnic.",
    "meaning": "쉬운 일이 아니에요.",
    "similar": [
      "It's not easy.",
      "It's a struggle.",
      "It's a tough task.",
      "It's difficult.",
      "It's no walk in the park."
    ],
    "example": "A: How was the half-marathon? Was it as fun as you expected?\nB: Honestly? It's no picnic. My legs are basically jelly right now.\nA: I bet. Twenty-one kilometers is a long way to run.\nB: For real. The hills at the end were especially brutal.\nA: I'm still proud of you for finishing though!\nB: Thanks. I'm definitely taking a break from running for a while."
  },
  "expression_453": {
    "id": 453,
    "primary": "Just let it go.",
    "meaning": "그냥 잊어버려요.",
    "similar": [
      "Don't dwell on it.",
      "Move on.",
      "Drop it.",
      "Forget about it.",
      "Ignore it."
    ],
    "example": "A: I still can't believe he said those mean things to me.\nB: Look, it happened weeks ago. You just need to let it go.\nA: It's hard though. I really thought he was my friend.\nB: Some people aren't worth the energy. Focus on yourself instead.\nA: You're right. I'm just wasting my time thinking about him.\nB: Exactly. Let's go out and have some fun instead."
  },
  "expression_454": {
    "id": 454,
    "primary": "We all have to pitch in.",
    "meaning": "우리 모두 협력해야 해요.",
    "similar": [
      "Everyone needs to contribute.",
      "Let's all help out.",
      "Cooperation is key.",
      "Teamwork is required.",
      "Everyone should do their part."
    ],
    "example": "A: The kitchen is a complete mess after that dinner party.\nB: I know. We all have to pitch in if we want to get it clean quickly.\nA: I'll handle the dishes if you can take out the trash.\nB: Deal. And I'll ask the others to wipe down the counters.\nA: Perfect. Many hands make light work, as they say.\nB: Facts. We'll be done in no time."
  },
  "expression_455": {
    "id": 455,
    "primary": "Let's call it a day.",
    "meaning": "오늘은 이만 마칩시다.",
    "similar": [
      "Let's stop working for now.",
      "Finish up for today.",
      "End the shift.",
      "Close up shop.",
      "Wrap it up."
    ],
    "example": "A: We've been at this for ten hours. My brain is officially fried.\nB: Honestly? Let's call it a day. We can finish this in the morning.\nA: I'm all for it. I'm literally seeing spots at this point.\nB: Facts. Everyone go home, get some rest, and we'll regroup then.\nA: Sounds like a plan. Safe travels everyone!\nB: Peace out! See you tomorrow."
  },
  "expression_456": {
    "id": 456,
    "primary": "Act your age.",
    "meaning": "나잇값 좀 하세요.",
    "similar": [
      "Be mature.",
      "Stop being childish.",
      "Grow up.",
      "Behave properly.",
      "Conduct yourself as an adult."
    ],
    "example": "A: Did you see him throwing a tantrum in the middle of the store?\nB: Yeah, it was so embarrassing. Honestly? He needs to act his age.\nA: For real. You're thirty-five, not five. Calm down.\nB: Some people just never learn how to regulate their emotions.\nA: It's honestly just sad to watch.\nB: Facts. Maturity is clearly not inherited."
  },
  "expression_457": {
    "id": 457,
    "primary": "It went over my head.",
    "meaning": "이해가 안 됐어요.",
    "similar": [
      "I didn't understand it.",
      "It was too complex for me.",
      "I missed the point.",
      "It was beyond my comprehension.",
      "I'm confused."
    ],
    "example": "A: Did you understand the technical part of the presentation?\nB: Not at all. Honestly? Most of it just went over my head.\nA: I feel you. Those charts were incredibly confusing.\nB: For real. I'm gonna have to ask for a simplified summary later.\nA: Same. I don't think anyone in that room actually followed along.\nB: Facts. They really need to work on their communication skills."
  },
  "expression_458": {
    "id": 458,
    "primary": "You're barking up the wrong tree.",
    "meaning": "헛다리 짚고 있어요.",
    "similar": [
      "You're mistaken.",
      "You're looking for the wrong person/thing.",
      "You have the wrong idea.",
      "Your suspicion is misplaced.",
      "You're off track."
    ],
    "example": "A: I'm pretty sure you were the one who took my sandwich from the fridge.\nB: Look, you're barking up the wrong tree. I wasn't even in the office today.\nA: Oh... Wait, really? My bad. I just assumed since you usually like turkey.\nB: All good, but maybe check with Bob. He was eyeing that sandwich all morning.\nA: Smart move. I'll go hit him up.\nB: Good luck with your investigations, Detective."
  },
  "expression_459": {
    "id": 459,
    "primary": "Don't make a big deal.",
    "meaning": "호들갑 떨지 마세요.",
    "similar": [
      "Don't overreact.",
      "Keep it low key.",
      "Stay calm.",
      "Don't exaggerate.",
      "Relax."
    ],
    "example": "A: I can't believe I spilled a tiny bit of coffee on my shirt!\nB: Look, it's barely noticeable. Don't make a big deal out of it.\nA: But I have an important meeting in twenty minutes!\nB: Just dab it with some water, it'll be fine. No one's gonna be staring at your chest.\nA: Alright, alright. I'm just overthinking it.\nB: Facts. Just focus on your presentation instead."
  },
  "expression_460": {
    "id": 460,
    "primary": "In a nutshell.",
    "meaning": "한마디로 말하면요.",
    "similar": [
      "Briefly put.",
      "To summarize.",
      "In short.",
      "Essentially.",
      "To make a long story short."
    ],
    "example": "A: Can you explain the whole situation with the merger?\nB: Well, in a nutshell, we're combining two teams to save on costs.\nA: So are there gonna be layoffs then?\nB: That's the part we're still figuring out, but hopefully not.\nA: I see. Thanks for clarify it so clearly.\nB: No problem. I'll keep you posted as I hear more."
  },
  "expression_461": {
    "id": 461,
    "primary": "Don't spill the beans.",
    "meaning": "비밀을 누설하지 마세요.",
    "similar": [
      "Don't tell the secret.",
      "Keep it a surprise.",
      "Stay quiet about it.",
      "Don't ruin the surprise.",
      "Keep it under wraps."
    ],
    "example": "A: We're throwing a surprise party for him this Friday.\nB: Ooh, I love surprises! I'll definitely be there.\nA: Just whatever you do, don't spill the beans! He has no idea.\nB: My lips are sealed. I'm actually really good at keeping secrets.\nA: Good to hear. We want this to be a total shock.\nB: Bet. He's gonna be so hyped."
  },
  "expression_462": {
    "id": 462,
    "primary": "This can't be happening.",
    "meaning": "이런 일이 있을 순 없어.",
    "similar": [
      "I don't believe this.",
      "This can't be real.",
      "Unbelievable.",
      "Is this a joke?",
      "This is a nightmare."
    ],
    "example": "A: Yo, the flight just got cancelled. The next one isn't till tomorrow morning.\nB: You've got to be kidding me. This can't be happening right now.\nA: I wish it was a joke. The whole board is covered in red.\nB: We're gonna miss the wedding! This is honestly the worst timing ever.\nA: Let's go talk to the gate agent and see if they can rebook us.\nB: Facts. I'm literally about to lose my mind."
  },
  "expression_463": {
    "id": 463,
    "primary": "I'm going to keep my eyes peeled.",
    "meaning": "잘 살필게요.",
    "similar": [
      "I'll be on the lookout.",
      "I'll watch closely.",
      "I'll stay alert.",
      "I'll keep a sharp eye out.",
      "I'll be scanning for it."
    ],
    "example": "A: I lost my keys somewhere near the park. Have you seen them?\nB: Haven't seen them yet, but I'm going to keep my eyes peeled for you.\nA: Thanks, man. They've got a little green keychain on them.\nB: Got it. I'll hit you up as soon as I spot anything.\nA: I really appreciate the help. I'm so stressed right now.\nB: Chill, we'll find them. Stay positive."
  },
  "expression_464": {
    "id": 464,
    "primary": "I'm right behind you.",
    "meaning": "내가 뒤에서 응원할게.",
    "similar": [
      "I support you.",
      "I'm here for you.",
      "I've got your back.",
      "I'm with you all the way.",
      "Count on my support."
    ],
    "example": "A: I'm finally gonna ask for that promotion this afternoon.\nB: Go for it! Honestly, I'm right behind you 100%.\nA: Thanks. I'm still a little nervous about how they'll react.\nB: You've earned it, so just be confident and state your case.\nA: Your support really means a lot to me. Fingers crossed!\nB: You'll kill it. Let's celebrate after work either way."
  },
  "expression_465": {
    "id": 465,
    "primary": "There you go again.",
    "meaning": "또 시작이네.",
    "similar": [
      "Here we go again.",
      "You're doing it again.",
      "Same old story.",
      "Typical of you.",
      "Not this again."
    ],
    "example": "A: I'm just saying, maybe if you cleaned up more occasionally...\nB: Ugh, there you go again. Can we please just have one meal without an argument?\nA: I'm just trying to have a reasonable conversation about the house!\nB: Your timing is always the worst though. Let's just eat.\nA: Fine, but we're talking about this later tonight.\nB: Great. Looking forward to it already."
  },
  "expression_466": {
    "id": 466,
    "primary": "Thanks for the heads up.",
    "meaning": "미리 알려줘서 고마워요.",
    "similar": [
      "Thanks for letting me know.",
      "Thanks for the warning.",
      "Appreciate the tip.",
      "Thanks for the info.",
      "I appreciate you informing me."
    ],
    "example": "A: Hey, just so you know, they're closing the main road for construction tonight.\nB: Oh word? Thanks for the heads up. I'll take the side streets instead.\nA: Smart move. It's probably gonna be a total traffic nightmare.\nB: For real. You saved me like thirty minutes of sitting in a car.\nA: No sweat. Just didn't want you to get stuck.\nB: Good looks. See you later tonight!"
  },
  "expression_467": {
    "id": 467,
    "primary": "Don't be a stranger.",
    "meaning": "자주 연락하고 지내요.",
    "similar": [
      "Keep in touch.",
      "Let's stay connected.",
      "Don't ghost me.",
      "Visit often.",
      "Stay in the loop."
    ],
    "example": "A: It's been great getting to know you this past month!\nB: Same here! I'm sad you're moving back to Cali.\nA: I know, but don't be a stranger! Hit me up whenever you're in the area.\nB: Definitely. You better do the same if you ever come back here.\nA: You know it. Safe travels home!\nB: Thanks. Peace out for now!"
  },
  "expression_468": {
    "id": 468,
    "primary": "Stop bugging me.",
    "meaning": "나 좀 괴롭히지 마세요.",
    "similar": [
      "Leave me alone.",
      "Quit annoying me.",
      "Stop bothering me.",
      "Go away.",
      "Give it a rest."
    ],
    "example": "A: Are you done with the report yet? How about now? Now?\nB: Honestly? Stop bugging me! I told you I'll have it by 5 PM.\nA: I just wanted to make sure we're on track.\nB: Your constant questions are actually making me slower. Chill out.\nA: Alright, alright. I'll leave you alone for now.\nB: Thank you. I really need to focus."
  },
  "expression_469": {
    "id": 469,
    "primary": "I've been there before.",
    "meaning": "나도 그런 적이 있어요.",
    "similar": [
      "I've experienced that.",
      "I know exactly how you feel.",
      "I've been in that situation.",
      "Same here.",
      "I've had that happen too."
    ],
    "example": "A: I feel so embarrassed for tripping in front of everyone.\nB: Don't even worry about it. I've been there before, trust me.\nA: Everyone probably thinks I'm such a klutz now.\nB: In three minutes, they'll have forgotten all about it. Stay chill.\nA: I hope so. It was just so public, you know?\nB: Facts. But honestly, most people are too busy with their own stuff to care."
  },
  "expression_470": {
    "id": 470,
    "primary": "We're working with a skeleton crew.",
    "meaning": "최소 인원으로 운영 중이에요.",
    "similar": [
      "We're understaffed.",
      "Minimum staffing only.",
      "We're short-handed.",
      "Only a few people are here.",
      "Bare minimum team."
    ],
    "example": "A: Why is service taking so long at the restaurant today?\nB: Honestly? We're working with a skeleton crew because of the flu going around.\nA: Oh, that makes sense. I apologize for being impatient.\nB: No worries. We're doing our best with what we've got.\nA: I'll just be patient then. I'm in no rush anyway.\nB: I appreciate the understanding. Your food should be out soon."
  },
  "expression_471": {
    "id": 471,
    "primary": "That's the thing.",
    "meaning": "그게 문제예요.",
    "similar": [
      "That's the issue.",
      "That's the point.",
      "Here's the catch.",
      "Exactly my point.",
      "That's what I'm saying."
    ],
    "example": "A: Why don't we just use the new software for the project?\nB: That's the thing... it's not compatible with our current systems.\nA: Oh... I didn't realize that was an issue.\nB: Yeah, we'd have to upgrade everything, which costs a fortune.\nA: Well, that's a huge hurdle then.\nB: Facts. We're gonna have to stick with the old way for now."
  },
  "expression_472": {
    "id": 472,
    "primary": "It's no wonder you think that.",
    "meaning": "그렇게 생각하는 것도 무리는 아니에요.",
    "similar": [
      "It makes sense you feel that way.",
      "It's understandable.",
      "No surprise you'd think so.",
      "Given the circumstances, it's natural.",
      "I see why you'd assume that."
    ],
    "example": "A: I'm really skeptical about this new company policy.\nB: Honestly? It's no wonder you think that after everything that happened last year.\nA: Exactly. They've broken our trust way too many times.\nB: For real. It's gonna take a while before anyone actually believes them again.\nA: Facts. I'm just gonna wait and see what they actually do.\nB: Smart move. Actions speak louder than corporate emails."
  },
  "expression_473": {
    "id": 473,
    "primary": "It happens all the time.",
    "meaning": "늘 있는 일이에요.",
    "similar": [
      "It's a regular occurrence.",
      "It's a common thing.",
      "It's nothing new.",
      "That's typical.",
      "It's always happening."
    ],
    "example": "A: My phone just ran out of battery right when I needed it most.\nB: Don't even stress. It happens all the time to the best of us.\nA: It's just so frustrating! I was in the middle of a call.\nB: Next time just keep a portable charger with you. Game changer.\nA: You're right. I'm just gonna go plug it in now.\nB: Better late than never. I'll wait for you to come back online."
  },
  "expression_474": {
    "id": 474,
    "primary": "There is no smoking gun.",
    "meaning": "결정적인 증거가 없어요.",
    "similar": [
      "There's no definitive proof.",
      "The evidence is inconclusive.",
      "Nothing that proves it for sure.",
      "No clear evidence found.",
      "It's all purely circumstantial."
    ],
    "example": "A: I'm pretty sure he stole the idea, but I can't prove it.\nB: That's the problem. There is no smoking gun, so it's your word against his.\nA: It's so frustrating! I know it's my concept.\nB: I believe you, but without some kind of paper trail, it's tough.\nA: I'll start keeping better notes and records from now on.\nB: Smart move. Protect yourself for next time."
  },
  "expression_475": {
    "id": 475,
    "primary": "I'm salty.",
    "meaning": "삐졌어요 (까칠해졌어요).",
    "similar": [
      "I'm annoyed.",
      "I'm bitter about it.",
      "I'm in a bad mood.",
      "I'm holding a small grudge.",
      "I'm feeling petty."
    ],
    "example": "A: Why are you being so quiet? Are you still mad about the game?\nB: Honestly? Yeah, I'm salty because we should've won that one easily.\nA: It was a close game, though! You played really well.\nB: That doesn't matter if we didn't get the W. Let's just go home.\nA: Alright, alright. Don't be such a sore loser.\nB: Whatever. I'll be over it tomorrow morning."
  },
  "expression_476": {
    "id": 476,
    "primary": "You don't want to know.",
    "meaning": "알면 다쳐요.",
    "similar": [
      "Trust me, don't ask.",
      "Better left unsaid.",
      "You're better off not knowing.",
      "It's too complicated to explain.",
      "Believe me, you don't wanna hear it."
    ],
    "example": "A: How was your meeting with the scary boss today?\nB: Look, you don't even want to know. It was a total disaster.\nA: Was it really that bad? Did they mention the budget thing?\nB: Just stop asking. I'm trying to erase the last hour from my memory.\nA: Alright, alright. I'll stop bugging you. Let's just grab a drink.\nB: Best idea you've had all day. Let's go."
  },
  "expression_477": {
    "id": 477,
    "primary": "I couldn't care less.",
    "meaning": "전혀 상관없어요.",
    "similar": [
      "I don't care at all.",
      "It doesn't bother me.",
      "It's irrelevant to me.",
      "Zero interest.",
      "Whatever."
    ],
    "example": "A: Did you hear that they're changing the office furniture again?\nB: Honestly? I couldn't care less as long as I have a desk and a chair.\nA: But they're getting those fancy standing desks everyone wanted!\nB: Still don't care. I'm here to work, not to admire the decor.\nA: You're so practical. I actually think it's kinda cool.\nB: Good for you. Just let me know when they move my stuff."
  },
  "expression_478": {
    "id": 478,
    "primary": "I got stuck in traffic.",
    "meaning": "차가 막혔어요.",
    "similar": [
      "The traffic was terrible.",
      "I was held up in traffic.",
      "Traffic was a gridlock.",
      "It was a parking lot out there.",
      "Delays everywhere on the road."
    ],
    "example": "A: You're finally here! We were about to start without you.\nB: My bad, I got stuck in traffic on the BQE for like forty minutes.\nA: That road is literally always a nightmare. I hate it.\nB: For real. I should've just taken the train, it would've been way faster.\nA: Well, you're here now. Let's get down to business.\nB: Facts. I'm ready to go."
  },
  "expression_479": {
    "id": 479,
    "primary": "It's a different kettle of fish.",
    "meaning": "그건 전혀 별개의 문제예요.",
    "similar": [
      "It's a separate issue.",
      "It's a whole other thing.",
      "That's incomparable.",
      "Completely different situation.",
      "Apples and oranges."
    ],
    "example": "A: So if you can code in Python, you can definitely handle Java too, right?\nB: Not really. It's a different kettle of fish entirely, man.\nA: I thought they were both just coding languages, though.\nB: The concepts are similar, but the syntax and rules are totally unique.\nA: I see. So it's not as simple as I thought then.\nB: Facts. I'm basically starting from square one with Java."
  },
  "expression_480": {
    "id": 480,
    "primary": "Don't hold your breath.",
    "meaning": "너무 기대하지 마세요.",
    "similar": [
      "Don't count on it.",
      "It's unlikely to happen.",
      "Keep your expectations low.",
      "Don't get your hopes up.",
      "It might not occur."
    ],
    "example": "A: Do you think the train will actually be on time today?\nB: Honestly? Don't hold your breath. It's Friday afternoon.\nA: True. The MTA is always a mess right before the weekend.\nB: For real. I'm already planning for a thirty-minute delay.\nA: Smart move. I should probably do the same.\nB: Facts. Better to be pleasantly surprised than frustrated."
  },
  "expression_481": {
    "id": 481,
    "primary": "I give you my word.",
    "meaning": "약속할게요.",
    "similar": [
      "I promise.",
      "You have my guarantee.",
      "I'm telling the truth.",
      "I swear.",
      "You can trust me on this."
    ],
    "example": "A: Are you sure you'll have the report ready by Monday morning?\nB: 100%. I give you my word, it'll be in your inbox by 9 AM.\nA: Good looks. I really need it for that client meeting.\nB: Don't even worry about it. I'm finishing it up tonight.\nA: I appreciate that focus. You're a lifesaver.\nB: Facts. I never break my word once it's given."
  },
  "expression_482": {
    "id": 482,
    "primary": "It's a long story.",
    "meaning": "사연이 많아요.",
    "similar": [
      "It's complicated.",
      "There's a lot to explain.",
      "I don't have time to get into it.",
      "It's a whole thing.",
      "Briefly said, but not really."
    ],
    "example": "A: How did you end up moving from Brooklyn to Queens?\nB: Man, it's a long story. A lot of stuff happened all at once.\nA: Was it because of the rent hike or something else?\nB: That was part of it, but there were some personal factors too.\nA: I feel you. Moving is always a huge headache anyway.\nB: For real. I'll tell you the details over drinks sometime."
  },
  "expression_483": {
    "id": 483,
    "primary": "We've got to break the mold.",
    "meaning": "관습을 깨야 해요.",
    "similar": [
      "We need to be innovative.",
      "Time to change things up.",
      "Let's do something different.",
      "We've gotta think outside the box.",
      "Let's challenge the status quo."
    ],
    "example": "A: Everyone else is doing the same basic marketing strategy.\nB: Exactly. We've got to break the mold and try something bold.\nA: What if we did a pop-up event in the middle of Times Square?\nB: Now that's what I'm talking about! That would definitely get attention.\nA: It's risky, but I think it could really pay off.\nB: Facts. Innovation always comes with a bit of risk."
  },
  "expression_484": {
    "id": 484,
    "primary": "That's what I'm talking about!",
    "meaning": "바로 그거예요!",
    "similar": [
      "I totally agree!",
      "Exactly!",
      "That's perfect!",
      "You nailed it!",
      "I'm so down for that!"
    ],
    "example": "A: Yo, I just got us front-row seats for the Knicks game!\nB: That's what I'm talking about! Let's go! You're a legend.\nA: It took forever to score them, but honestly? Totally worth it.\nB: For real! I've been wanting to see them live all season.\nA: Me too. We're gonna have the best time.\nB: Best day ever. No cap."
  },
  "expression_485": {
    "id": 485,
    "primary": "The damage is done.",
    "meaning": "이미 엎질러진 물이에요.",
    "similar": [
      "It's too late now.",
      "The harm has occurred.",
      "There's no going back.",
      "What's done is done.",
      "The situation is irreversible."
    ],
    "example": "A: I really should've checked that email before I sent it.\nB: Honestly? The damage is done now. The client already saw it.\nA: Do you think they'll be mad about the typo?\nB: It wasn't just a typo, but hopefully they're in a good mood.\nA: I'm just gonna go hide in my office for a bit.\nB: Chill. Just apologize and move on. No use dwelling on it."
  },
  "expression_486": {
    "id": 486,
    "primary": "I can't sit still.",
    "meaning": "가만히 못 있겠어요.",
    "similar": [
      "I'm feeling restless.",
      "I have too much energy.",
      "I'm anxious to move.",
      "I can't stay in one place.",
      "I'm fidgety."
    ],
    "example": "A: You've been pacing around the room for ten minutes.\nB: I know, I'm just so nervous about the interview results. I can't sit still.\nA: Try to take some deep breaths and relax a little.\nB: I'm trying, but my heart is racing. I just want to know already.\nA: I feel you. The waiting is always the hardest part.\nB: For real. I'm literally about to lose my mind."
  },
  "expression_487": {
    "id": 487,
    "primary": "It's better than nothing.",
    "meaning": "없는 것보다 낫죠.",
    "similar": [
      "It's better than zero.",
      "At least it's something.",
      "Could be worse.",
      "It's a start.",
      "I'll take it."
    ],
    "example": "A: I only got a five percent discount on these shoes.\nB: Hey, it's better than nothing. Rent is expensive anyway.\nA: True, every little bit helps when you live in this city.\nB: For real. I'm always looking for ways to save a few bucks.\nA: Same. I should probably start cooking more at home instead of getting takeout.\nB: Facts. That's a real game changer for the wallet."
  },
  "expression_488": {
    "id": 488,
    "primary": "That's just the way it is.",
    "meaning": "세상일이 다 그렇죠.",
    "similar": [
      "That's life.",
      "It is what it is.",
      "No changing it.",
      "Standard situation.",
      "Just our luck sometimes."
    ],
    "example": "A: I can't believe they increased the subway fare again.\nB: Man, that's just the way it is. Inflation hitting everyone hard.\nA: It's getting so expensive just to commute to work!\nB: For real. But what can we do? We still gotta get there.\nA: I guess I'll just have to cut back on the morning lattes.\nB: Facts. Sacrifices must be made."
  },
  "expression_489": {
    "id": 489,
    "primary": "Stay focused.",
    "meaning": "집중하세요.",
    "similar": [
      "Keep your eyes on the prize.",
      "Don't get distracted.",
      "Concentrate.",
      "Stay on task.",
      "Maintain your focus."
    ],
    "example": "A: I'm so tempted to check my socials right now.\nB: Look, stay focused! We only have twenty minutes to finish this project.\nA: You're right. I'll just leave my phone in my bag for now.\nB: Smart move. Let's knock this out so we can actually enjoy the night.\nA: Bet. I'm locked in now.\nB: That's what I like to hear. Let's get it."
  },
  "expression_490": {
    "id": 490,
    "primary": "He was quite high maintenance.",
    "meaning": "그는 손이 많이 가는 스타일이에요.",
    "similar": [
      "He required a lot of attention.",
      "He's difficult to please.",
      "He's very demanding.",
      "He's a lot of work.",
      "He's needy."
    ],
    "example": "A: How did that date go with the guy you met on the app?\nB: Honestly? He was quite high maintenance. Constant texting and complaining.\nA: Oh no, that's a huge red flag for me.\nB: For real. I just want someone who's chill and can go with the flow.\nA: I feel you. Life is too stressful for all that extra drama.\nB: Facts. I'm definitely not seeing him again."
  },
  "expression_491": {
    "id": 491,
    "primary": "I went cold turkey.",
    "meaning": "단번에 끊었어요.",
    "similar": [
      "I stopped abruptly.",
      "I quit immediately.",
      "I gave it up for good.",
      "No gradual decrease, just stopped.",
      "I cut it out completely."
    ],
    "example": "A: Wait, I haven't seen you with a vape in like a month.\nB: Yeah, I finally went cold turkey. Best decision I ever made.\nA: Was it hard? I heard the first few days are the worst.\nB: It was brutal, honestly. But it gets easier after the first week.\nA: Respect. That takes a lot of willpower.\nB: Facts. I'm just glad I'm finally free from it."
  },
  "expression_492": {
    "id": 492,
    "primary": "Don't keep me waiting.",
    "meaning": "기다리게 하지 마세요.",
    "similar": [
      "Hurry up.",
      "Don't be late.",
      "I'm on a schedule.",
      "Be punctual.",
      "Don't stall."
    ],
    "example": "A: I'm just finishing up my hair, I'll be out in five minutes.\nB: Look, the reservations are at 7, so don't keep me waiting!\nA: Chill, I'm almost done! I just want to look decent.\nB: You always look good, just hurry up or we're gonna lose our table.\nA: Alright, alright. I'm grabbing my bag right now.\nB: Better be. I'm literally in the car already."
  },
  "expression_493": {
    "id": 493,
    "primary": "Get with the program.",
    "meaning": "상황 파악 좀 하세요.",
    "similar": [
      "Catch up.",
      "Understand the situation.",
      "Realize what's happening.",
      "Follow the plan.",
      "Wake up to reality."
    ],
    "example": "A: Wait, why are we all wearing black today? I missed the memo.\nB: Seriously? Get with the program! It's because the boss's pet passed away.\nA: Oh snap... I feel so awkward in this bright yellow shirt now.\nB: Yeah, you definitely stick out like a sore thumb. Go change.\nA: My bad, I'll be back in ten. Is everyone really that upset?\nB: For real. Just keep it low key when you get back."
  },
  "expression_494": {
    "id": 494,
    "primary": "Give me a ballpark figure.",
    "meaning": "대략적인 수치를 알려주세요.",
    "similar": [
      "Give me a rough estimate.",
      "Approximate it for me.",
      "What's the general range?",
      "Give me a guess.",
      "Give me a ballpark estimate."
    ],
    "example": "A: How much is it gonna cost to fix this whole kitchen?\nB: Look, I can't give you the exact price yet, but I can give you a ballpark figure.\nA: Alright, that works for now. Just so I can plan my budget.\nB: I'd say you're looking at around five to seven thousand dollars.\nA: That's a lot, but honestly? It could've been worse.\nB: Facts. I'll get you the detailed quote by tomorrow morning."
  },
  "expression_495": {
    "id": 495,
    "primary": "What's your best guess?",
    "meaning": "대충 짐작해보면 어때요?",
    "similar": [
      "What do you think is likely?",
      "What's your estimation?",
      "What's your initial thought?",
      "Give me your best prediction.",
      "What's your gut feeling?"
    ],
    "example": "A: Which team do you think is gonna win the championship this year?\nB: Honestly? My best guess is the Celtics. They've been playing crazy good.\nA: I don't know, the Warriors are looking pretty solid too.\nB: True, but the Celtics' defense is just on another level right now.\nA: We'll see. It's gonna be a wild season for sure.\nB: Facts. I'm just looking forward to the playoffs."
  },
  "expression_496": {
    "id": 496,
    "primary": "It's a pain in the neck.",
    "meaning": "정말 성가셔요.",
    "similar": [
      "It's annoying.",
      "It's a nuisance.",
      "It's bothersome.",
      "I can't stand it.",
      "It's a real hassle."
    ],
    "example": "A: The elevator in my building is broken again. I have to walk up six floors.\nB: Ugh, that's such a pain in the neck. Especially with groceries!\nA: For real. It's the third time this month. I'm about to call the super.\nB: You should! You pay too much rent for that kind of service.\nA: Facts. It's getting really old, really fast.\nB: Hopefully they fix it for good this time."
  },
  "expression_497": {
    "id": 497,
    "primary": "It keeps me on my toes.",
    "meaning": "긴장을 늦출 수 없게 해요.",
    "similar": [
      "It keeps me alert.",
      "It keeps me focused.",
      "I'm always ready.",
      "It motivates me to stay sharp.",
      "It's a constant challenge."
    ],
    "example": "A: How do you handle working three jobs at once?\nB: It's a lot, but honestly, it keeps me on my toes. I'm never bored.\nA: Respect. I think I'd just be exhausted all the time.\nB: It's all about managing your energy, you know? And plenty of coffee.\nA: Facts. Whatever works for you though.\nB: Definitely. Keeps life interesting for sure."
  },
  "expression_498": {
    "id": 498,
    "primary": "It blows me away.",
    "meaning": "정말 놀라워요.",
    "similar": [
      "I'm amazed.",
      "It's incredible.",
      "I'm stunned.",
      "It's mind-blowing.",
      "It takes my breath away."
    ],
    "example": "A: Did you see that new art installation at the MoMA?\nB: Yeah, and honestly? It blows me away every time I look at it.\nA: The scale of it is just so impressive, right?\nB: 100%. I can't even imagine how much work went into creating that.\nA: I'm definitely going back to see it again next week.\nB: Same. It's a real masterpiece, no cap."
  },
  "expression_499": {
    "id": 499,
    "primary": "I'm susceptible to it.",
    "meaning": "저는 거기에 약해요.",
    "similar": [
      "I'm vulnerable to it.",
      "I'm easily affected by it.",
      "It's my weakness.",
      "I'm prone to it.",
      "I lack resistance to it."
    ],
    "example": "A: Are you okay with spicy food? We're going to that Thai spot tonight.\nB: Honestly? I'm pretty susceptible to it. Even mild stuff makes me cry.\nA: Oh no! We can definitely go somewhere else then.\nB: Nah, don't worry about it! I'll just order something plain.\nA: You sure? I don't want you to be miserable the whole time.\nB: Facts. Maybe let's just do ramen instead. It's safer."
  },
  "expression_500": {
    "id": 500,
    "primary": "I'll level with you.",
    "meaning": "솔직히 털어놓을게요.",
    "similar": [
      "I'll be honest with you.",
      "I'm gonna tell it like it is.",
      "No more secrets.",
      "Let's be real for a second.",
      "I'll give you the truth."
    ],
    "example": "A: Do you think I actually have a shot at getting into that program?\nB: Look, I'll level with you. It's incredibly competitive and your GPA is a bit low.\nA: I appreciate the honesty. I just wanted to know what I'm up against.\nB: You still have a chance if you write a crazy good essay though.\nA: I'll definitely put in the work. Thanks for not sugarcoating it.\nB: Any time. Real talk is always better."
  },
  "expression_501": {
    "id": 501,
    "primary": "They had it coming.",
    "meaning": "자업자득이에요.",
    "similar": [
      "They deserved it.",
      "It was bound to happen to them.",
      "Justice was served.",
      "They brought it on themselves.",
      "They're finally facing the consequences."
    ],
    "example": "A: Did you hear that Mark got fired for lying on his timesheet?\nB: Honestly? He had it coming. Everyone knew he was faking his hours.\nA: It's still pretty crazy though. He'd been there for years.\nB: For real, but you can't just keep doing that and expect to get away with it forever.\nA: Facts. It was only a matter of time before they caught him.\nB: Exactly. Play stupid games, win stupid prizes."
  },
  "expression_502": {
    "id": 502,
    "primary": "I'll spare you the details.",
    "meaning": "자세한 설명은 생략할게요.",
    "similar": [
      "I won't bore you with specifics.",
      "Let's skip the small stuff.",
      "Long story short.",
      "I'll keep it brief.",
      "We can skip the particulars."
    ],
    "example": "A: How did your car end up in the river, anyway?\nB: Man, it's a long story and honestly? I'll spare you the details. It was embarrassing.\nA: I'm just glad you're okay! That looks like it was intense.\nB: It was. I'm just trying to move on and forget about the whole thing.\nA: I feel you. Let me know if you need a ride anywhere.\nB: Thanks, fam. I really appreciate the help."
  },
  "expression_503": {
    "id": 503,
    "primary": "Bad news travels fast.",
    "meaning": "나쁜 소식은 빨리 퍼져요.",
    "similar": [
      "Gossip spreads quickly.",
      "Rumors catch fire fast.",
      "Negativity gets around.",
      "People are quick to share bad news.",
      "Ill tidings gain ground quickly."
    ],
    "example": "A: I literally just got dumped an hour ago, how did everyone already know?\nB: You know what they say—bad news travels fast in this small town.\nA: It's honestly so frustrating. I just wanted some peace and quiet.\nB: For real. Everyone's already texting me asking for the 'tea'.\nA: Just tell them I'm not talking about it. I'm going off the grid for a bit.\nB: Facts. I'll handle the nosy neighbors for you."
  },
  "expression_504": {
    "id": 504,
    "primary": "Why the long face?",
    "meaning": "왜 울상이에요?",
    "similar": [
      "Why so sad?",
      "What's bothering you?",
      "Why are you looking down?",
      "Everything okay?",
      "You look like you've seen a ghost."
    ],
    "example": "A: Yo, why the long face? You're usually so hype on Fridays.\nB: I just found out my favorite lunch spot is closing down for good.\nA: Oh no! That sucks. They had the best sandwiches in the neighborhood.\nB: For real. I don't know what I'm gonna do now.\nA: Don't worry, we'll find a new spot. There's plenty of options around here.\nB: I guess, but it won't be the same."
  },
  "expression_505": {
    "id": 505,
    "primary": "What's the occasion?",
    "meaning": "무슨 특별한 날인가요?",
    "similar": [
      "What are we celebrating?",
      "What's going on?",
      "Why all the fuss?",
      "Is there a special event today?",
      "What's the big deal?"
    ],
    "example": "A: Wow, everyone is so dressed up today! What's the occasion?\nB: It's the company's tenth anniversary! Didn't you see the email?\nA: Oh snap... I completely missed it. I'm just in my regular jeans.\nB: Haha, it's all good. The celebration doesn't start till 3 PM anyway.\nA: I might have to run home and change really quick.\nB: You better! The boss is definitely checking attendance today."
  },
  "expression_506": {
    "id": 506,
    "primary": "What's the matter?",
    "meaning": "무슨 일이에요?",
    "similar": [
      "What's wrong?",
      "Is everything okay?",
      "What happened?",
      "Tell me what's bothering you.",
      "Is there a problem?"
    ],
    "example": "A: You've been staring at that wall for ten minutes. What's the matter?\nB: I'm just worrying about my presentation tomorrow. I feel so unprepared.\nA: Come on, you've been working on it all week! You'll be fine.\nB: I hope so. I just hate public speaking so much.\nA: You've got this. Let's go over your slides one more time.\nB: Thanks, fam. That would actually help a lot."
  },
  "expression_507": {
    "id": 507,
    "primary": "He had a blast.",
    "meaning": "아주 즐거운 시간을 보냈어요.",
    "similar": [
      "He had so much fun.",
      "He really enjoyed himself.",
      "He had a great time.",
      "He was having the time of his life.",
      "He was thrilled with the experience."
    ],
    "example": "A: How was your nephew's birthday party at the arcade?\nB: It was awesome! Honestly, he had a blast and didn't want to leave.\nA: That's classic. Kids and video games are a perfect match.\nB: For real. He even won one of those giant plushies from the crane machine.\nA: No way! Those things are notoriously impossible to beat.\nB: Facts. He was flexing on everyone all afternoon."
  },
  "expression_508": {
    "id": 508,
    "primary": "Don't fall for it.",
    "meaning": "속지 마세요.",
    "similar": [
      "Don't be fooled.",
      "Don't believe their lies.",
      "Avoid the trap.",
      "Stay skeptical.",
      "Don't let them trick you."
    ],
    "example": "A: This website says I can get a free iPhone just by clicking this link.\nB: Yo, don't fall for it! That's definitely a phishing scam.\nA: But it looks so official though! It's got the logo and everything.\nB: That's how they get you. Never enter your info on a random site like that.\nA: Good looks. I almost clicked it without even thinking.\nB: For real. Stay safe out there in the digital wild."
  },
  "expression_509": {
    "id": 509,
    "primary": "Suit yourself.",
    "meaning": "마음대로 하세요.",
    "similar": [
      "Do whatever you want.",
      "It's up to you.",
      "Have it your way.",
      "Whatever makes you happy.",
      "Be my guest."
    ],
    "example": "A: I'm just gonna stay in tonight and finish this book.\nB: Alright, suit yourself! We'll be at the concert if you change your mind.\nA: Have fun for me though! Tell everyone I say hi.\nB: You got it. Just don't complain tomorrow when you see the videos.\nA: Haha, I'll take my chances. Peace out for now!\nB: Later!"
  },
  "expression_510": {
    "id": 510,
    "primary": "It was put on ice.",
    "meaning": "보류되었어요.",
    "similar": [
      "It was delayed.",
      "It's on hold.",
      "The project was suspended.",
      "It's taking a backseat for now.",
      "It was postponed indefinitely."
    ],
    "example": "A: What's the status of the new app redesign project?\nB: Honestly? It was put on ice because of budget cuts.\nA: Oh snap... after all that work we put into the sketches?\nB: For real. They're focusing on more 'immediate revenue' stuff now.\nA: That's such a bummer. I really thought the new look was dope.\nB: Facts. Hopefully they bring it back next quarter."
  },
  "expression_511": {
    "id": 511,
    "primary": "You've lost me.",
    "meaning": "무슨 말인지 모르겠어요.",
    "similar": [
      "I don't follow you.",
      "I'm confused by what you're saying.",
      "Could you repeat that?",
      "I'm not on the same page.",
      "I'm lost in this conversation."
    ],
    "example": "A: So after we optimize the backend, we can parallelize the data fetching layer using asynchronous hooks.\nB: Wait, you've lost me. Can you explain that in plain English for a second?\nA: My bad! Basically, we're making the website load faster by doing two things at once.\nB: Ah, okay. That makes way more sense. Thanks for the clarification.\nA: No sweat. I sometimes get carried away with the technical talk.\nB: For real. I'm more of a visual person anyway."
  },
  "expression_512": {
    "id": 512,
    "primary": "I'm on cloud nine.",
    "meaning": "너무 행복해요.",
    "similar": [
      "I'm incredibly happy.",
      "I'm thrilled.",
      "I'm Over the moon.",
      "Life is perfect right now.",
      "I'm feeling amazing."
    ],
    "example": "A: Yo, I just heard you got into your dream grad school! Congrats!\nB: Thanks, fam! I'm honestly on cloud nine right now. I can't believe it.\nA: You worked so hard for this, you definitely deserve it.\nB: For real. All those late nights in the library finally paid off.\nA: We're definitely celebrating this weekend! Drinks are on me.\nB: Say less! I'm so hyped."
  },
  "expression_513": {
    "id": 513,
    "primary": "She was thirsty.",
    "meaning": "관심을 갈구했어요.",
    "similar": [
      "She was seeking attention.",
      "She was desperate for validation.",
      "She was being too much.",
      "She was craving the spotlight.",
      "She was acting very needy."
    ],
    "example": "A: Did you see her posting like fifty stories from the party last night?\nB: Yeah, honestly? She was thirsty for any kind of attention she could get.\nA: It was a little much, don't you think? Everyone was just trying to chill.\nB: For real. Not everything needs to be on the 'gram all the time.\nA: Facts. I just put my phone away and actually enjoyed the vibe.\nB: Smart move. Quality over quantity, always."
  },
  "expression_514": {
    "id": 514,
    "primary": "There's nothing to it.",
    "meaning": "아주 쉬워요.",
    "similar": [
      "It's very simple.",
      "It's easy as pie.",
      "No big deal.",
      "It's a breeze.",
      "Piece of cake."
    ],
    "example": "A: Do you think you can show me how to assemble this IKEA desk?\nB: For sure! Look, there's nothing to it once you follow the pictures.\nA: I'm just always terrified I'm gonna have extra screws at the end.\nB: Haha, it happens to the best of us. Just take it slow and you'll be fine.\nA: Alright, let's get down to business then.\nB: Bet. Hand me that Allen wrench."
  },
  "expression_515": {
    "id": 515,
    "primary": "But there's a twist.",
    "meaning": "하지만 반전이 있어요.",
    "similar": [
      "However, something unexpected occurs.",
      "There's a surprise element.",
      "It's not as it seems.",
      "Wait till you hear this part.",
      "Things take a sudden turn."
    ],
    "example": "A: I found the perfect apartment in the Lower East Side for only $1500!\nB: Wow! That's an insane deal. What's the catch?\nA: But there's a twist... the landlord says I have to share it with three ghosts.\nB: Haha, you're kidding right? Please tell me you're joking.\nA: I wish! I'm actually starting to think it might be haunted for real.\nB: Save your money and keep looking. No ghost-mates for me!"
  },
  "expression_516": {
    "id": 516,
    "primary": "We're out of the woods.",
    "meaning": "이제 위험에서 벗어났어요.",
    "similar": [
      "We're safe now.",
      "The danger has passed.",
      "We've cleared the main hurdles.",
      "Things are looking better.",
      "We've survived the worst."
    ],
    "example": "A: Is the server still crashing every five minutes?\nB: No, looks like we're finally out of the woods. The traffic has stabilized.\nA: Thank goodness! I was about to have a mental breakdown.\nB: For real. That was a stressful three hours for everyone involved.\nA: Let's just monitor it for another hour just to be totally safe though.\nB: Smart move. I'll keep an eye on the analytics."
  },
  "expression_517": {
    "id": 517,
    "primary": "Let's play it by ear.",
    "meaning": "상황 보고 정합시다.",
    "similar": [
      "Let's see how things go.",
      "We'll decide later.",
      "Go with the flow.",
      "No concrete plans yet.",
      "We'll adjust as we go."
    ],
    "example": "A: What time should we head out for dinner tonight?\nB: Honestly? Let's just play it by ear. It depends on when everyone finishes work.\nA: Alright, just hit me up when you're ready to leave then.\nB: For sure. I'll give you a thirty-minute heads up.\nA: Sounds like a plan. I'm just gonna chill here till then.\nB: Bet. Catch you later."
  },
  "expression_518": {
    "id": 518,
    "primary": "Don't even bring it up.",
    "meaning": "꺼내지도 마세요.",
    "similar": [
      "Don't mention it.",
      "Don't talk about it.",
      "Avoid that subject.",
      "Let's not go there.",
      "Please ignore that topic."
    ],
    "example": "A: So, whatever happened with that guy you were seeing last month?\nB: Look, don't even bring it up. It ended very, very badly.\nA: Oh snap... my bad! I didn't know it was that serious.\nB: It's fine, I'm just trying to delete him from my memory entirely.\nA: I feel you. Let's talk about something way more positive instead.\nB: Best idea. Tell me more about that new project you're working on."
  },
  "expression_519": {
    "id": 519,
    "primary": "Your eyes are bigger than your stomach.",
    "meaning": "욕심부리네요.",
    "similar": [
      "You're overestimating your appetite.",
      "You ordered too much food.",
      "You took more than you can handle.",
      "You're acting greedy.",
      "Be realistic about what you can finish."
    ],
    "example": "A: I think I'm gonna order two more large pizzas for the party.\nB: Look, your eyes are bigger than your stomach! We still have leftovers from last time.\nA: I just don't want anyone to go hungry, you know?\nB: I get it, but we already have plenty of snacks too. Chill on the pizza.\nA: Alright, maybe you're right. I'll just get one more instead.\nB: Still probably too much, but whatever. Suit yourself."
  },
  "expression_520": {
    "id": 520,
    "primary": "It's not even close.",
    "meaning": "어림도 없어요.",
    "similar": [
      "It's way off.",
      "Not even in the ballpark.",
      "A huge difference.",
      "Completely different level.",
      "Doesn't compare at all."
    ],
    "example": "A: Do you think my local pizza spot is as good as Joe's in the Village?\nB: Honestly? It's not even close. Joe's is in a whole other league.\nA: Come on! Mine is pretty solid for a neighborhood joint.\nB: Solid, yeah, but Joe's is legendary. There's just no comparison.\nA: I guess I need to head down there and do a taste test then.\nB: Facts. You'll see exactly what I'm talking about."
  },
  "expression_521": {
    "id": 521,
    "primary": "I don't blame you.",
    "meaning": "당신 탓이 아니에요.",
    "similar": [
      "I understand your decision.",
      "It's not your fault.",
      "I see why you did that.",
      "No judgment from me.",
      "I would've done the same."
    ],
    "example": "A: I decided to quit my corporate job and just travel for a year.\nB: Honestly? I don't blame you. That job was killing your soul.\nA: It really was. I'm just so ready for a change of pace.\nB: For real. You've been working so hard for years, you deserve a break.\nA: Thanks for the support. A lot of people think I'm crazy.\nB: They're just jealous of your freedom. Live your life!"
  },
  "expression_522": {
    "id": 522,
    "primary": "Don't let it bother you.",
    "meaning": "신경 쓰지 마세요.",
    "similar": [
      "Ignore it.",
      "Don't worry about it.",
      "Keep your head up.",
      "Let it slide.",
      "Don't let it get to you."
    ],
    "example": "A: My boss made a really snarky comment about my presentation today.\nB: Look, don't let it bother you. He's always like that after his morning meeting.\nA: It still hurtful though! I worked so hard on those slides.\nB: I know, but you did a great job and everyone else loved it. Stay positive.\nA: You're right. I'm just gonna focus on the good feedback instead.\nB: Smart move. Negative energy is just not worth your time."
  },
  "expression_523": {
    "id": 523,
    "primary": "I'm at your service.",
    "meaning": "무엇을 도와드릴까요?",
    "similar": [
      "I'm here to help.",
      "Let me know what you need.",
      "I'm ready to assist.",
      "I'm available for any tasks.",
      "Count on me for support."
    ],
    "example": "A: I really need some help organizing the event next week.\nB: Any time! I'm at your service. Just tell me what needs doing.\nA: Could you handle the guest list and the catering details?\nB: 100%. I'll get started on it first thing tomorrow morning.\nA: You're a lifesaver! I was honestly about to panic.\nB: Chill, we've got this. Teamwork makes the dream work!"
  },
  "expression_524": {
    "id": 524,
    "primary": "She's cool as a cucumber.",
    "meaning": "아주 침착해요.",
    "similar": [
      "She's incredibly calm.",
      "She handles pressure well.",
      "She's composed.",
      "Nothing rattles her.",
      "She's unflappable."
    ],
    "example": "A: How did she stay so calm when the whole system went down?\nB: Honestly? She's cool as a cucumber during crises. It's impressive.\nA: I'd be running around like a headless chicken, for real.\nB: Me too. I don't know how she does it. It must be meditation or something.\nA: Either way, I'm glad she's on our team.\nB: Facts. We really need that kind of steady energy right now."
  },
  "expression_525": {
    "id": 525,
    "primary": "He's down to earth.",
    "meaning": "겸손하고 현실적이에요.",
    "similar": [
      "He's very practical.",
      "He's relatable.",
      "He's humble.",
      "He's got no ego.",
      "He's a regular guy."
    ],
    "example": "A: Have you met the new CEO yet? Is he as terrifying as everyone says?\nB: Not at all! Honestly, he's super down to earth and actually listens to ideas.\nA: Oh wow! That's such a relief to hear.\nB: For real. He even ate lunch with us in the breakroom today.\nA: That's dope. It's nice to have a leader who actually feels like a human being.\nB: 100%. Makes the whole office vibe so much better."
  },
  "expression_526": {
    "id": 526,
    "primary": "We have to address the problem.",
    "meaning": " 문제를 해결해야 해요.",
    "similar": [
      "We need to deal with the issue.",
      "Let's confront the situation.",
      "We have to fix this.",
      "Tackle the problem head-on.",
      "Find a solution now."
    ],
    "example": "A: We've been ignoring the drop in sales for three months now.\nB: Look, we have to address the problem before it gets any worse.\nA: I agree, but what's our first step? We need more data.\nB: Let's start by surveying our most loyal customers. See what's changed.\nA: Smart move. I'll set that up by the end of the week.\nB: Perfect. Time to be proactive instead of just hoping for the best."
  },
  "expression_527": {
    "id": 527,
    "primary": "How old do you think I am?",
    "meaning": "제 나이가 몇 살 같아요?",
    "similar": [
      "Guess my age.",
      "What's your best guess on my age?",
      "How old do I look?",
      "Do you think I'm older or younger?",
      "Give me a number on my age."
    ],
    "example": "A: You seem so mature for someone just starting their career.\nB: Really? Haha, how old do you think I am? Most people get it wrong.\nA: I'd say... maybe twenty-five? You've got that youthful energy.\nB: Actually, I'm thirty-two! I just take really good care of my skin.\nA: No way! You definitely don't look a day over twenty-two.\nB: Haha, I'll take that as a huge win! Thanks for the kind words."
  },
  "expression_528": {
    "id": 528,
    "primary": "It put me on the map.",
    "meaning": "그것 덕분에 유명해졌어요.",
    "similar": [
      "It made me famous.",
      "It gave me recognition.",
      "It established my reputation.",
      "It brought me into the spotlight.",
      "It was my big break."
    ],
    "example": "A: How did you get that job at the huge tech firm?\nB: Honestly, that viral app I built last year? It really put me on the map.\nA: Oh word! I remember seeing that one on Product Hunt.\nB: Yeah, it got a lot of buzz very quickly. Companies started reaching out to me after that.\nA: That's the dream, for real. Hard work actually paying off.\nB: Facts. It's all about that one project that catches the right eyes."
  },
  "expression_529": {
    "id": 529,
    "primary": "They are selling like hot cakes.",
    "meaning": "불티나게 팔리고 있어요.",
    "similar": [
      "They're very popular.",
      "Demand is through the roof.",
      "They're flying off the shelves.",
      "Sales are booming.",
      "Everyone wants one."
    ],
    "example": "A: Did you manage to get those new sneakers that dropped today?\nB: No way, man! They were selling like hot cakes and sold out in three minutes.\nA: That's wild. I was on the site at 10 AM too and I couldn't even load the page.\nB: For real. Resellers are probably already hiking the price up to five hundred.\nA: I hate that so much. Just ruins the fun for the actual fans.\nB: Facts. I'm just gonna wait for the next restock."
  },
  "expression_530": {
    "id": 530,
    "primary": "This is at the heart of the matter.",
    "meaning": "이것이 핵심이에요.",
    "similar": [
      "This is the core issue.",
      "This is the main point.",
      "This is fundamental.",
      "This is what everything centers around.",
      "This is the crux of the situation."
    ],
    "example": "A: Why are we even talking about the office layout again?\nB: Look, efficiency is at the heart of the matter. We need to work better.\nA: I thought it was just about making the place look nicer.\nB: That's a side effect. The real goal is maximizing our output.\nA: I see. So the layout actually affects how we collaborate then.\nB: Facts. It's the foundation of everything we do here."
  },
  "expression_531": {
    "id": 531,
    "primary": "Who do you think I am?",
    "meaning": "나를 누구로 보는 거예요?",
    "similar": [
      "Don't underestimate me.",
      "You clearly don't know who you're dealing with.",
      "Do you really think I'd do that?",
      "Show some respect.",
      "You have no idea who I am."
    ],
    "example": "A: Are you really gonna try to sneak into the club without an ID?\nB: Yo, who do you think I am? I've been doing this since I was eighteen.\nA: I'm just saying, the bouncer looks pretty intense tonight.\nB: Chill. I've got my ways. Just watch and learn.\nA: Alright, if you get kicked out, I'm not waiting for you.\nB: Don't even worry. I'll be at the bar before you're even through the line."
  },
  "expression_532": {
    "id": 532,
    "primary": "It spiraled out of control.",
    "meaning": "걷잡을 수 없이 악화됐어요.",
    "similar": [
      "It got out of hand.",
      "It escalated quickly.",
      "It became unmanageable.",
      "Things went downhill fast.",
      "It was total chaos."
    ],
    "example": "A: It started as a small argument over who left the milk out.\nB: And then? How did the whole kitchen end up covered in flour?\nA: Honestly? It just spiraled out of control. Things were thrown, people were yelling...\nB: That sounds like a scene from a movie, for real.\nA: It was a nightmare. We're still cleaning up the mess.\nB: Facts. I think you guys need a serious roommate meeting soon."
  },
  "expression_533": {
    "id": 533,
    "primary": "It quickly went viral.",
    "meaning": "순식간에 입소문이 났어요.",
    "similar": [
      "It gained popularity fast.",
      "It was all over the internet.",
      "Everyone was sharing it.",
      "It blew up overnight.",
      "It became an instant trend."
    ],
    "example": "A: Did you see that video of the cat playing the piano?\nB: Yeah! It quickly went viral this morning. My whole feed is full of it.\nA: It's so wholesome though. I've watched it like ten times already.\nB: For real. It's the kind of content we all need right now.\nA: Facts. I heard the owner is already getting talk show invites.\nB: That's wild. The internet is a crazy place for sure."
  },
  "expression_534": {
    "id": 534,
    "primary": "At the end of the day.",
    "meaning": "결국에는요.",
    "similar": [
      "Ultimately.",
      "The bottom line is.",
      "When all is said and done.",
      "In the final analysis.",
      "Basically."
    ],
    "example": "A: We've been debating which color to paint the walls for three hours.\nB: Look, at the end of the day, it's just a wall. We just need to pick one.\nA: But the 'vibe' needs to be perfect for the brand!\nB: I get it, but we have bigger problems to solve right now.\nA: You're right. Let's just go with the light grey and move on.\nB: Facts. Decision made. Let's get some lunch."
  },
  "expression_535": {
    "id": 535,
    "primary": "He was full of beans.",
    "meaning": "에너지가 넘쳤어요.",
    "similar": [
      "He had so much energy.",
      "He was very lively.",
      "He was spirited.",
      "He couldn't sit still.",
      "He was buzzing with excitement."
    ],
    "example": "A: How was the puppy's first day at the park?\nB: Oh man, he was full of beans! He ran around for three hours straight.\nA: I bet he's fast asleep now though.\nB: 100%. He's been snoring for the last two hours. It's adorable.\nA: That's the best part about high-energy dogs, they crash hard.\nB: Facts. I'm just glad he had a good time."
  },
  "expression_536": {
    "id": 536,
    "primary": "That is a tough nut to crack.",
    "meaning": "해결하기 어려운 문제예요.",
    "similar": [
      "That's a difficult problem.",
      "It's a challenge to solve.",
      "It's a complex situation.",
      "That's no easy task.",
      "It's a hard nut to crack."
    ],
    "example": "A: We're still trying to figure out how to reduce our churn rate.\nB: Yeah, that is a tough nut to crack. Customers seem so fickle these days.\nA: We've tried discounts, better support, everything...\nB: Maybe it's not the service, but the actual product itself?\nA: That's a scary thought, but you might be right.\nB: Facts. It's time for some deep analysis."
  },
  "expression_537": {
    "id": 537,
    "primary": "We will chew the fat.",
    "meaning": "수다를 떨 거예요.",
    "similar": [
      "We'll have a long talk.",
      "We'll catch up properly.",
      "We'll chat for a while.",
      "Let's vent and talk.",
      "We'll gossip and share stories."
    ],
    "example": "A: Are you coming over tonight for dinner?\nB: For sure! I haven't seen you in weeks, we really need to chew the fat.\nA: I've got so much to tell you about the new job.\nB: I bet! I've got some tea to share too. It's gonna be a long night.\nA: Perfect. I'll have the wine ready.\nB: Say less. I'm on my way."
  },
  "expression_538": {
    "id": 538,
    "primary": "Don't let your guard down.",
    "meaning": "방심하지 마세요.",
    "similar": [
      "Stay alert.",
      "Be vigilant.",
      "Don't get complacent.",
      "Keep your eyes open.",
      "Watch your step."
    ],
    "example": "A: We're finally ahead in the fourth quarter!\nB: That's great, but don't let your guard down. They could still come back.\nA: True, their star player just got back on the court.\nB: Exactly. Keep the pressure on till the final buzzer sounds.\nA: Roger that. We're staying locked in.\nB: Facts. No room for mistakes now."
  },
  "expression_539": {
    "id": 539,
    "primary": "They promised the moon.",
    "meaning": "지키지 못할 약속을 했어요.",
    "similar": [
      "They made unrealistic promises.",
      "They claimed they could do everything.",
      "They overpromised.",
      "They offered the world with no way to deliver.",
      "They gave false hope."
    ],
    "example": "A: The new agency says they can triple our traffic in one month.\nB: Look, they're promising the moon. No one can actually guarantee that.\nA: I know it sounds too good to be true, but what if they're legit?\nB: Trust me, I've heard this before. They just want the contract.\nA: I should probably ask for some case studies then.\nB: Smart move. Don't believe the hype without some proof."
  },
  "expression_540": {
    "id": 540,
    "primary": "He's on track.",
    "meaning": "잘하고 있어요.",
    "similar": [
      "He's making progress as expected.",
      "He's staying following the plan.",
      "He's doing well.",
      "He's on schedule.",
      "He's making good headway."
    ],
    "example": "A: How is the new intern doing with his first project?\nB: Honestly? He's on track. He should be done by Friday.\nA: That's good to hear. I was worried the learning curve would be too much.\nB: He's a quick learner, for real. Very proactive too.\nA: Dope. I'll check in with him tomorrow morning.\nB: Sounds good. He's doing a solid job."
  },
  "expression_541": {
    "id": 541,
    "primary": "It's not as bad as it seems.",
    "meaning": "보기보다 나쁘지 않아요.",
    "similar": [
      "It's better than you think.",
      "It's manageable.",
      "Don't overreact, it's okay.",
      "The situation is salvageable.",
      "It's not a total disaster."
    ],
    "example": "A: I accidentally formatted the wrong drive and lost all my notes!\nB: Chill, it's not as bad as it seems. We have most of that backed up to the cloud.\nA: Wait, really? Even the stuff from this morning?\nB: Yeah, the auto-sync actually saved your life. Check your account.\nA: Oh my god, you're right! Thank you! I was about to cry.\nB: See? Technology actually works sometimes."
  },
  "expression_542": {
    "id": 542,
    "primary": "Calm your nerves.",
    "meaning": "진정하세요.",
    "similar": [
      "Relax.",
      "Take a deep breath.",
      "Stay calm.",
      "Don't be so anxious.",
      "Chill out for a second."
    ],
    "example": "A: I'm literally shaking right now. What if I mess up my line?\nB: Look, just calm your nerves. You've practiced this a hundred times.\nA: But the audience is so huge! And my parents are in the front row!\nB: Just focus on your breathing. You're gonna be amazing, trust me.\nA: Alright, I'm taking a big breath now. Okay, I can do this.\nB: That's the spirit. You're a pro."
  },
  "expression_543": {
    "id": 543,
    "primary": "It was a shot in the arm.",
    "meaning": "큰 활력소가 되었어요.",
    "similar": [
      "It was a much-needed boost.",
      "It provided significant encouragement.",
      "It was a stimulant for the situation.",
      "It gave us extra energy.",
      "It was a positive catalyst."
    ],
    "example": "A: The team was really feeling down after that last loss.\nB: Yeah, but that new sponsorship was exactly the shot in the arm we needed.\nA: For real. Everyone is so motivated now.\nB: It's crazy how much of a difference some good news can make.\nA: Facts. We're ready to take on the next challenge with full energy.\nB: Let's get it."
  },
  "expression_544": {
    "id": 544,
    "primary": "That's the way the ball bounces.",
    "meaning": "세상일이 다 그렇죠.",
    "similar": [
      "That's life.",
      "It is what it is.",
      "Sometimes things just don't go your way.",
      "No use complaining.",
      "That's the situation now."
    ],
    "example": "A: I was so sure I was gonna win that raffle, but I didn't even place.\nB: Well, that's just the way the ball bounces sometimes. Better luck next time.\nA: I guess I'll just have to keep trying my luck with other stuff.\nB: For real. You can't win them all, right?\nA: Facts. It was just a fun little thing anyway.\nB: Exactly. Keep that positive attitude going."
  },
  "expression_545": {
    "id": 545,
    "primary": "It's a no-brainer.",
    "meaning": "생각할 필요도 없는 쉬운 결정이죠.",
    "similar": [
      "It's an easy choice.",
      "It's obvious.",
      "No need to hesitate.",
      "The decision is clear.",
      "It's the most logical option."
    ],
    "example": "A: They're offering me a fifty percent raise to move to their new office.\nB: Honestly? It's a no-brainer. You should definitely take it.\nA: But I'll have to commute for an extra thirty minutes every day.\nB: For fifty percent more cash? 100% worth it. No cap.\nA: You're right. I'm signing the offer letter right now.\nB: Facts. That's a life-changing move."
  },
  "expression_546": {
    "id": 546,
    "primary": "He was not pulling his weight.",
    "meaning": "제 몫을 다하지 않았어요.",
    "similar": [
      "He was being lazy.",
      "He wasn't contributing enough.",
      "He was slacking off.",
      "He was a burden on the team.",
      "He wasn't doing his fair share."
    ],
    "example": "A: Why did you decide to let the lead designer go?\nB: Honestly? He was not pulling his weight and the rest of the team was frustrated.\nA: I noticed some of the projects were falling behind lately.\nB: Exactly. Everyone else was working overtime while he was just chilling.\nA: That's not fair to anyone. It's better to have a smaller, more dedicated team.\nB: Facts. We're already seeing better results without the dead weight."
  },
  "expression_547": {
    "id": 547,
    "primary": "I don't buy it.",
    "meaning": "안 믿어요.",
    "similar": [
      "I don't believe you.",
      "I'm skeptical.",
      "That sounds fake to me.",
      "I'm not convinced.",
      "I'm calling cap on that."
    ],
    "example": "A: He says he missed the meeting because his alarm clock literally exploded.\nB: Honestly? I don't buy it. That sounds like a complete lie.\nA: It's a pretty creative excuse though, you gotta admit.\nB: Creative, yeah, but definitely not true. He just overslept again.\nA: I should probably just give him a formal warning then.\nB: Facts. Consistency matters in this office."
  },
  "expression_548": {
    "id": 548,
    "primary": "I got all dolled up.",
    "meaning": "한껏 멋을 부렸어요.",
    "similar": [
      "I dressed up nicely.",
      "I'm looking glamorous.",
      "I put in effort for my outfit.",
      "I'm all decked out.",
      "I'm ready for the red carpet."
    ],
    "example": "A: Wow! You look amazing today! Where are you going?\nB: Thanks! I got all dolled up for that awards ceremony tonight.\nA: You're definitely gonna be the star of the show.\nB: Haha, I appreciate that! I even did my hair and makeup myself.\nA: Teach me your ways! Seriously, you look like a whole different person.\nB: It's all about the confidence and some secret lipstick tricks."
  },
  "expression_549": {
    "id": 549,
    "primary": "Put your feet up.",
    "meaning": "편히 쉬세요.",
    "similar": [
      "Relax.",
      "Take a break.",
      "Take a load off.",
      "Sit back and chill.",
      "Slow down and rest."
    ],
    "example": "A: You've been on your feet for eight hours. Come over here.\nB: Thanks. I'm honestly so exhausted I could fall asleep right here.\nA: Just put your feet up and I'll bring you some water.\nB: You're too kind. I really need to stay off my feet for a bit.\nA: Take as long as you need. You've earned this break.\nB: I appreciate the support, for real."
  },
  "expression_550": {
    "id": 550,
    "primary": "Easy does it.",
    "meaning": "조심해서 천천히 하세요.",
    "similar": [
      "Be careful.",
      "Do it gently.",
      "Take it slow.",
      "No rush.",
      "Proceed with caution."
    ],
    "example": "A: I'm trying to move this huge glass table into the hallway.\nB: Easy does it! Don't tilt it too much or it might crack.\nA: I've got it, I've got it. Just need to go around this corner.\nB: Slowly! There you go. Perfect. Now let's set it down gently.\nA: Phew, that was intense. I was so worried about breaking it.\nB: Facts. Better safe than sorry when it comes to glass."
  },
  "expression_551": {
    "id": 551,
    "primary": "I had a falling out with him.",
    "meaning": "그와 다퉜어요.",
    "similar": [
      "We had a disagreement.",
      "We're no longer friends.",
      "We had a big argument.",
      "We've stopped speaking to each other.",
      "Our relationship turned sour."
    ],
    "example": "A: How is your best friend doing? I haven't seen him around lately.\nB: Honestly? I had a falling out with him last month. We haven't talked since.\nA: Oh no! I'm so sorry to hear that. I thought you guys were inseparable.\nB: Yeah, me too, but some things just can't be easily fixed.\nA: I feel you. If you ever wanna talk about it, I'm here.\nB: Thanks. I appreciate the support, for real."
  },
  "expression_552": {
    "id": 552,
    "primary": "It's not rocket science.",
    "meaning": "그렇게 어려운 일이 아니에요.",
    "similar": [
      "It's simple.",
      "It's not complicated at all.",
      "Anyone can do it.",
      "It's quite straightforward.",
      "Don't overthink it, it's easy."
    ],
    "example": "A: I'm struggling to set up this new coffee machine. There are so many buttons!\nB: Chill out. It's not rocket science. Just press the 'brew' button after adding water.\nA: But what about all these other settings? 'Aroma', 'Strength'...\nB: Just ignore those for now. Start with the basics and you'll be fine.\nA: Alright, alright. I'm overthinking it as usual.\nB: Facts. Just focus on your morning cup of joe."
  },
  "expression_553": {
    "id": 553,
    "primary": "We all have to pick up the slack.",
    "meaning": "부족한 부분을 보충해야 해요.",
    "similar": [
      "We need to compensate for the missing effort.",
      "Everyone needs to help out more.",
      "Contribute extra when others can't.",
      "Compensate for someone else's deficiency.",
      "Tackle the overflow work."
    ],
    "example": "A: Since two developers left unexpectedly, things have been crazy.\nB: I know. We all have to pick up the slack until new hires are on board.\nA: I'm already taking on three extra projects myself.\nB: For real. It's not ideal, but it's what's needed right now.\nA: Hopefully they find some good replacements soon.\nB: Facts. We can't keep this pace up forever."
  },
  "expression_554": {
    "id": 554,
    "primary": "I threw caution to the wind.",
    "meaning": "위험을 무릅쓰고 감행했어요.",
    "similar": [
      "I took a big risk.",
      "I acted impulsively.",
      "I was reckless.",
      "I ignored all warnings.",
      "I just went for it without worrying about the consequences."
    ],
    "example": "A: You actually booked a flight to Bali without checking your bank account?\nB: Yeah! I just threw caution to the wind and went for it. YOLO!\nA: That's either incredibly brave or very bold of you.\nB: A bit of both, I guess. I just really needed a break from reality.\nA: I feel you. Sometimes you just gotta take the leap, right?\nB: Facts. I'll figure out the money situation later. For now, it's island time."
  },
  "expression_555": {
    "id": 555,
    "primary": "Beauty is only skin deep.",
    "meaning": "외모는 겉모습일 뿐이에요.",
    "similar": [
      "Personality matters more than looks.",
      "Outer appearance can be deceiving.",
      "True value is internal.",
      "Character is what truly counts.",
      "Don't judge a book by its cover."
    ],
    "example": "A: He's so attractive! But honestly, he's kind of rude to everyone.\nB: See? Beauty is only skin deep. You gotta find someone with a good heart.\nA: I know, I know. I just wish he was nicer.\nB: For real. Aesthetic only takes you so far in a real relationship.\nA: Facts. I'm definitely looking for something more substantial now.\nB: Exactly. Personality is the real winner."
  },
  "expression_556": {
    "id": 556,
    "primary": "I'm not good with words.",
    "meaning": "말주변이 없어요.",
    "similar": [
      "I struggle to express myself.",
      "I'm not a smooth talker.",
      "I find it hard to say what I mean.",
      "I'm a bit shy in conversations.",
      "Communication isn't my strongest skill."
    ],
    "example": "A: You should tell her how you really feel. Be romantic!\nB: Honestly? I'm not good with words. I always get tongues-tied around her.\nA: Try writing her a letter instead. It's more thoughtful and less pressure.\nB: That's a good idea. I can take my time and say exactly what I mean.\nA: Exactly. Just be sincere and she'll love it.\nB: Thanks for the advice. I'll get started on that tonight."
  },
  "expression_557": {
    "id": 557,
    "primary": "I'm running on fumes.",
    "meaning": "기운이 하나도 없어요.",
    "similar": [
      "I'm at the end of my energy.",
      "I'm incredibly tired.",
      "I'm barely hanging on.",
      "I'm exhausted.",
      "I have no more stamina."
    ],
    "example": "A: Do you wanna grab a late-night snack after this shift?\nB: Honestly? I'm running on fumes. I just want to go home and sleep.\nA: I feel you. It's been a long day for both of us.\nB: For real. I've been awake for like eighteen hours. My brain is fried.\nA: Get some rest then! We'll catch up tomorrow when you're human again.\nB: Facts. See you later."
  },
  "expression_558": {
    "id": 558,
    "primary": "I call the shots.",
    "meaning": "내가 결정권을 갖고 있어요.",
    "similar": [
      "I'm in charge here.",
      "I make the final decision.",
      "I'm the boss.",
      "Everything goes through me.",
      "I have the last word."
    ],
    "example": "A: Should we ask the team which direction we should go for the project?\nB: Look, I call the shots around here. We're going with my plan.\nA: I just thought some extra input would be helpful.\nB: I appreciate that, but I have the most experience and I'm leading this.\nA: Alright, if that's how it's gonna be. I'll just follow the lead.\nB: Smart move. Let's stay focused and execute."
  },
  "expression_559": {
    "id": 559,
    "primary": "I have butterflies in my stomach.",
    "meaning": "너무 긴장돼요.",
    "similar": [
      "I'm very nervous.",
      "I'm feeling anxious.",
      "I have that nervous fluttering feeling.",
      "I'm slightly terrified but excited.",
      "I'm feeling jumpy."
    ],
    "example": "A: You're about to go out on stage in front of five thousand people!\nB: I know! I have serious butterflies in my stomach right now.\nA: Just take a deep breath and remember why you're here.\nB: I'm trying! But my hands are literally shaking. This is insane.\nA: You've got this. Once you get out there, the nerves will fade away.\nB: Thanks. I'm going for it. See you on the other side!"
  },
  "expression_560": {
    "id": 560,
    "primary": "You've been left on read.",
    "meaning": "읽씹 당했네요.",
    "similar": [
      "They saw your message and didn't reply.",
      "Ghosted via text.",
      "Ignored after reading.",
      "Message read but no response.",
      "Stuck on seen."
    ],
    "example": "A: It's been six hours and he still hasn't replied to my text.\nB: Ouch. Looks like you've been left on read, my friend.\nA: But he was just active on Instagram two minutes ago!\nB: That's a classic sign. Honestly? Just let it go for now.\nA: I hate that feeling so much. It's so awkward.\nB: Facts. Don't double text. Just wait and see if he eventually reaches out."
  },
  "expression_561": {
    "id": 561,
    "primary": "She doted on me.",
    "meaning": "나를 애지중지했어요.",
    "similar": [
      "She spoiled me with affection.",
      "She adored me.",
      "She showered me with love.",
      "She was overly fond of me.",
      "She really took great care of me."
    ],
    "example": "A: It's so nice to see how much your grandma loves you.\nB: Yeah, she always doted on me when I was growing up. I was her favorite.\nA: I can tell! She always has your favorite cookies ready when we visit.\nB: For real. She's the best. I try to visit her as often as I can.\nA: That's sweet. Family connections like that are precious.\nB: Facts. I really appreciate everything she's done for me."
  },
  "expression_562": {
    "id": 562,
    "primary": "I made it from scratch.",
    "meaning": "맨 처음부터 직접 만들었어요.",
    "similar": [
      "I created it entirely by myself.",
      "It's handmade/home-made.",
      "I didn't use any shortcuts.",
      "I built it from zero.",
      "It's an original creation."
    ],
    "example": "A: This pasta sauce is incredible! Where did you get the recipe?\nB: Honestly? I made it from scratch using tomatoes from my own garden.\nA: No way! This tastes like it's from a high-end restaurant.\nB: Thanks! It takes a while to simmer everything down, but it's totally worth it.\nA: You should definitely start selling this. People would love it.\nB: Maybe one day! For now, it's just for friends."
  },
  "expression_563": {
    "id": 563,
    "primary": "Don't steal my thunder.",
    "meaning": "내 공을 가로채지 마세요.",
    "similar": [
      "Don't take credit for my work.",
      "Don't overshadow me.",
      "Stop taking the spotlight for yourself.",
      "Let me have my moment.",
      "Don't ruin my big reveal."
    ],
    "example": "A: I was just about to tell everyone about the new partnership...\nB: But I already posted it on the company Slack channel this morning!\nA: Yo! Don't steal my thunder like that! I wanted to announce it officially.\nB: My bad! I thought you wanted it out as soon as possible.\nA: I did, but I also wanted to share the credit with the team during the meeting.\nB: I see. I'm sorry. I'll let you handle the rest of the updates then."
  },
  "expression_564": {
    "id": 564,
    "primary": "He clammed up.",
    "meaning": "입을 꾹 다물었어요.",
    "similar": [
      "He stopped talking entirely.",
      "He became silent.",
      "He refused to speak.",
      "He shut down in conversation.",
      "He was speechless."
    ],
    "example": "A: Did you ask him about the missing files yet?\nB: Yeah, but as soon as I mentioned the budget, he just clammed up.\nA: That's suspicious. He's usually so talkative about everything else.\nB: For real. It's like he's hiding something he doesn't want me to find.\nA: I should probably have a more formal chat with him tomorrow.\nB: Good luck with that. He's acting very strange lately."
  },
  "expression_565": {
    "id": 565,
    "primary": "I would go on a spending spree.",
    "meaning": "돈을 펑펑 쓰고 싶어요.",
    "similar": [
      "I'd shop until I drop.",
      "I'd spend all my money at once.",
      "I'd indulge in excessive shopping.",
      "I'd buy everything I want.",
      "I'd blow all my cash on fun things."
    ],
    "example": "A: If I won the lottery today, the first thing I'd do is hire a financial advisor.\nB: Not me! I would go on a huge spending spree at all the luxury stores in SoHo.\nA: Aren't you worried about running out of money eventually?\nB: Not with a hundred million dollars! I'd have plenty to spare.\nA: Facts, but I'd still be nervous about losing it all overnight.\nB: Live a bit! Life is too short for all that worry."
  },
  "expression_566": {
    "id": 566,
    "primary": "I don't want to open up a can of worms.",
    "meaning": "문제를 복잡하게 만들고 싶지 않아요.",
    "similar": [
      "I don't want to cause more problems.",
      "Let's not get into a complicated situation.",
      "Avoiding unnecessary drama.",
      "I'd rather not start something complex.",
      "Keep the peace by not mentioning it."
    ],
    "example": "A: Should we mention the unresolved issue from last month during the meeting?\nB: Honestly? I don't want to open up a can of worms right now. Let's focus on today's tasks.\nA: I agree, it might derail the whole conversation for hours.\nB: Exactly. We have enough on our plate without more drama.\nA: We'll bring it up in a separate session then.\nB: Facts. Better to handle it when we have more time to properly deal with it."
  },
  "expression_567": {
    "id": 567,
    "primary": "It's my treat.",
    "meaning": "제가 낼게요.",
    "similar": [
      "I'm paying.",
      "The bill is on me.",
      "I'll handle the check.",
      "No, let me pay for this.",
      "It's my shout."
    ],
    "example": "A: This dinner was incredible! Let's split it fifty-fifty.\nB: No way, don't worry about it. It's my treat today since you helped me with my project.\nA: Are you sure? That was a really expensive meal though.\nB: 100%. I really appreciate all your support lately. It means a lot.\nA: Thank you so much! I'll get the next round for sure then.\nB: Say less. It was my pleasure!"
  },
  "expression_568": {
    "id": 568,
    "primary": "Snap out of it!",
    "meaning": "정신 차려!",
    "similar": [
      "Wake up!",
      "Get focused again!",
      "Come back to reality!",
      "Stop spacing out!",
      "Get your head in the game!"
    ],
    "example": "A: I was just imagining what it would be like to live on Mars for a year...\nB: Yo! Snap out of it! We have a deadline in thirty minutes and you haven't even started.\nA: My bad! I got lost in my own thoughts for a second.\nB: Clearly! Let's focus on the actual work before the boss gets mad.\nA: On it. I'm locked in now, I promise.\nB: That's what I like to hear. Let's get it done."
  },
  "expression_569": {
    "id": 569,
    "primary": "You got us into this mess.",
    "meaning": "당신 때문에 이 지경이 됐어요.",
    "similar": [
      "It's your fault we're in this situation.",
      "You caused this problem.",
      "This is all because of you.",
      "You led us into this trouble.",
      "We're here because of your decision."
    ],
    "example": "A: Why are we stuck in the middle of a traffic jam in Brooklyn at midnight?\nB: Look, you're the one who thought this shortcut was a 'game changer'! \nA: I didn't know there was literally going to be construction on every single block!\nB: Well, you got us into this mess, so now we're just gonna have to wait it out.\nA: I'm sorry, okay? I was just trying to save us some time.\nB: Next time, let's just use the regular GPS and stay on the main road."
  },
  "expression_570": {
    "id": 570,
    "primary": "It's not what it looks like.",
    "meaning": "오해하지 마세요.",
    "similar": [
      "You're misinterpreting the situation.",
      "Let me explain the truth.",
      "It's not as it appears.",
      "There's a logical explanation for this.",
      "Don't jump to conclusions."
    ],
    "example": "A: Why were you at the office at 3 AM with all the lights off?\nB: Honestly? It's not what it looks like. I just forgot my keys and didn't want to bother anyone.\nA: That sounds incredibly suspicious, don't you think?\nB: I know! I was literally crawling through the window when security saw me.\nA: Wow, that's intense. I'm just glad you didn't get arrested.\nB: Facts. I'm definitely not doing that again."
  },
  "expression_571": {
    "id": 571,
    "primary": "I owe you one.",
    "meaning": "신세 한번 졌네요.",
    "similar": [
      "I appreciate your help.",
      "I'll make it up to you.",
      "You did me a huge favor.",
      "I'm in your debt.",
      "Thank you, I'll return the favor soon."
    ],
    "example": "A: Thanks again for lending me your laptop while mine was in the shop.\nB: Any time! I'm glad it helped you finish your final project.\nA: For real, I owe you one. Let me buy you lunch this weekend.\nB: You really don't have to, but I won't say no to some free pizza!\nA: Say less. I'll hit you up on Saturday then.\nB: Sounds like a plan. Catch you later!"
  },
  "expression_572": {
    "id": 572,
    "primary": "I got the short straw.",
    "meaning": "재수 없게 제가 걸렸어요.",
    "similar": [
      "I was chosen for the worst task.",
      "I got unlucky.",
      "I ended up with the responsibility no one wanted.",
      "Fate wasn't on my side this time.",
      "I'm stuck with the undesirable duty."
    ],
    "example": "A: Why are you cleaning the coffee machine on a Friday afternoon?\nB: Ugh, I got the short straw during the team meeting today. Everyone else escaped.\nA: That's rough! It always seems to be you, doesn't it?\nB: For real. I think they're secretly out to get me at this point.\nA: I'll help you finish it so you can leave earlier too.\nB: You're a legend! I really appreciate that, for real."
  },
  "expression_573": {
    "id": 573,
    "primary": "She truly is the GOAT.",
    "meaning": "그녀는 정말 최고예요.",
    "similar": [
      "She's the greatest of all time.",
      "She's unmatched in her field.",
      "She's an absolute legend.",
      "She's at the top of her game.",
      "She's a total icon."
    ],
    "example": "A: Did you see Beyonce's performance last night? It was insane!\nB: 100%. She truly is the GOAT. No one else even comes close.\nA: The production, the vocals, the energy... it was just a whole different level.\nB: Facts. She's been consistent for decades now. It's pure dedication.\nA: I want to be like her when I grow up. Not even joking.\nB: We all do. She's a true inspiration to everyone."
  },
  "expression_574": {
    "id": 574,
    "primary": "I've got a lot of mixed emotions.",
    "meaning": "만감이 교차하네요.",
    "similar": [
      "I'm feeling many things at once.",
      "I have conflicting feelings.",
      "I'm not exactly sure how to feel.",
      "It's a complicated emotional situation.",
      "I'm feeling bittersweet."
    ],
    "example": "A: How do you feel about moving to a whole new city for the first time?\nB: Honestly? I've got a lot of mixed emotions. Excitement, but also a lot of fear.\nA: That's totally normal! It's a huge life change for you.\nB: For real. I'm gonna miss all my friends here, but the new opportunity is dope.\nA: Just take it one step at a time. You'll settle in before you know it.\nB: Thanks. I'm trying to stay positive and focused on the future."
  },
  "expression_575": {
    "id": 575,
    "primary": "I've seen worse.",
    "meaning": "이것보다 더 심한 것도 봤어요.",
    "similar": [
      "This isn't as bad as it could be.",
      "I've encountered worse situations before.",
      "It's manageable compared to my past experiences.",
      "It's not the end of the world.",
      "I've dealt with more difficult things."
    ],
    "example": "A: Look at the state of this office after the party! It's a disaster!\nB: Chill out. I've seen worse. At least there's no permanent damage.\nA: You call this manageable? There's literally glitter on every single surface!\nB: It'll take a few hours to clean up, but it's not the worst thing I've ever seen.\nA: You should've seen my college dorm after finals week then.\nB: Facts. This is basically a nursery school compared to that chaos."
  },
  "expression_576": {
    "id": 576,
    "primary": "The tea tastes funny.",
    "meaning": "차 맛이 이상해요.",
    "similar": [
      "The tea tastes unusual.",
      "Something is off about this tea.",
      "This tea has a strange flavor.",
      "I'm not liking the taste of this tea.",
      "Is this tea expired or something?"
    ],
    "example": "A: You didn't finish your matcha latte. Is everything okay with it?\nB: Honestly? The tea tastes funny. It's almost... metallic?\nA: Oh no! Maybe the milk was off or the water wasn't filtered correctly.\nB: For real. It's definitely not the usual quality I expect from this place.\nA: I'll go ask them to remake it for you. You shouldn't have to drink that.\nB: Thanks, I appreciate it. I was just gonna leave it but it's so expensive!"
  },
  "expression_577": {
    "id": 577,
    "primary": "That's a steal.",
    "meaning": "거저나 다름없네요.",
    "similar": [
      "That's an incredible deal.",
      "It's very cheap for the value.",
      "What an amazing price!",
      "I'm essentially getting it for free.",
      "That's a total bargain."
    ],
    "example": "A: Look at these vintage boots I found for only twenty bucks!\nB: No way! They look like they're worth at least two hundred. That's a steal.\nA: I know! I saw them in the back of the store and couldn't believe the price tag.\nB: You definitely scored big time today. Those are gonna look dope with your outfit.\nA: Facts. Thrifting is honestly my favorite thing to do on weekends.\nB: Same. Nothing beats that feeling of finding a diamond in the rough."
  },
  "expression_578": {
    "id": 578,
    "primary": "Now is the time to decide.",
    "meaning": "지금이 결정할 때예요.",
    "similar": [
      "Decision time is now.",
      "We can't wait any longer to choose.",
      "Finalize your choice immediately.",
      "The deadline for deciding has arrived.",
      "Make up your mind now."
    ],
    "example": "A: I'm still not sure which summer internship I should take.\nB: Look, now is the time to decide. Both offers expire by the end of today.\nA: I know, both are so good but for different reasons!\nB: Just go with your gut feeling. Which one makes you feel more excited about the work?\nA: Honestly? The creative agency one. I'm just worried about the pay.\nB: Facts, but the experience might lead to something way bigger later. Just do it!"
  },
  "expression_579": {
    "id": 579,
    "primary": "I just winged it.",
    "meaning": "그냥 즉흥적으로 했어요.",
    "similar": [
      "I improvised without a plan.",
      "I didn't prepare at all.",
      "I just went for it spontaneously.",
      "I made it up as I went along.",
      "No planning involved, I just did it."
    ],
    "example": "A: Your presentation today was so smooth! How long did you spend practicing?\nB: Honestly? I didn't prepare at all. I just winged it based on what I remembered from the meeting.\nA: Wow! You're a natural at public speaking then. I would've been a mess.\nB: Thanks! I just try to stay calm and speak from the heart, you know?\nA: I wish I had that kind of confidence. I literally have to write everything down.\nB: Facts. Whatever works for you though, everyone has their own style."
  },
  "expression_580": {
    "id": 580,
    "primary": "It's kind of bittersweet.",
    "meaning": "시원섭섭하네요.",
    "similar": [
      "It's a mix of happy and sad.",
      "It's bittersweet.",
      "I have conflicting feelings about this.",
      "It's a poignant moment.",
      "Glad it's over, but sad to see it end."
    ],
    "example": "A: Today is my last day at the firm after ten years.\nB: How are you feeling? It must be a big change.\nA: Honestly? It's kind of bittersweet. I'm excited for the new gig, but I'll miss everyone here.\nB: I bet. You've made some great friends over the years.\nA: Facts. We've been through a lot together.\nB: Well, at least we're throwing you a dope goodbye party tonight."
  },
  "expression_581": {
    "id": 581,
    "primary": "I'm at a loss for words.",
    "meaning": "할 말을 잃었어요.",
    "similar": [
      "I'm speechless.",
      "I don't know what to say.",
      "That left me stunned.",
      "I'm genuinely surprised.",
      "Words fail me right now."
    ],
    "example": "A: Surprise! We all pitched in to get you that guitar you've been eyeing!\nB: Oh my god... I'm at a loss for words right now. You guys are the best.\nA: We know how much you've been wanting to start playing again.\nB: This is incredible. I'm literally shaking.\nA: Just start practicing! We expect a concert by next month.\nB: Facts. I'm gonna get on that right away. Thank you so much!"
  },
  "expression_582": {
    "id": 582,
    "primary": "We went the extra mile.",
    "meaning": "기대 이상으로 노력했어요.",
    "similar": [
      "We put in extra effort.",
      "We exceeded expectations.",
      "We went above and beyond.",
      "We did more than what was required.",
      "We gave it 110 percent."
    ],
    "example": "A: The client was absolutely blown away by the final presentation.\nB: That's great! We really went the extra mile with those custom animations.\nA: For real. It took us all weekend, but it was totally worth it.\nB: Facts. Now we're definitely gonna get that contract extension.\nA: I'm just glad everyone's hard work paid off.\nB: Let's celebrate with a team dinner tonight."
  },
  "expression_583": {
    "id": 583,
    "primary": "I canceled them.",
    "meaning": "손절했어요.",
    "similar": [
      "I've stopped interacting with them.",
      "I cut them out of my life.",
      "I'm done with them.",
      "I ghosted them for good.",
      "They are no longer in my circle."
    ],
    "example": "A: Haven't seen you hanging out with that group lately. What happened?\nB: Honestly? I canceled them after that drama last weekend. I don't need that energy.\nA: Wow, that's a bold move. They were your main friends for a while.\nB: I know, but life is too short for toxic people. No cap.\nA: I feel you. Sometimes you just gotta protect your peace.\nB: Facts. I'm much happier already."
  },
  "expression_584": {
    "id": 584,
    "primary": "I was swamped with work.",
    "meaning": "일에 파묻혀 지냈어요.",
    "similar": [
      "I was overwhelmed with tasks.",
      "I had so much to do.",
      "I was buried in work.",
      "I was incredibly busy.",
      "My schedule was completely full."
    ],
    "example": "A: Sorry I didn't get back to your text yesterday.\nB: No worries! I figured you were swamped with work for the big launch.\nA: For real. I didn't even have time to eat lunch until 4 PM.\nB: That sounds intense. Hope things are calming down today.\nA: A little bit, but I still have a mountain of emails to get through.\nB: Facts. The grind never stops, huh?"
  },
  "expression_585": {
    "id": 585,
    "primary": "That's as cheap as chips.",
    "meaning": "정말 싸요.",
    "similar": [
      "That's a total bargain.",
      "It's incredibly inexpensive.",
      "It's dirt cheap.",
      "That's peanuts.",
      "You're getting it for next to nothing."
    ],
    "example": "A: I found this high-end blender at a garage sale for five dollars!\nB: No way! That's as cheap as chips. Those usually go for over a hundred.\nA: I know! I checked the price online as soon as I got home.\nB: You really scored big time today. Does it even work?\nA: Perfectly. I already made a smoothie this morning.\nB: Facts. What a lucky find!"
  },
  "expression_586": {
    "id": 586,
    "primary": "Make yourself at home.",
    "meaning": "편히 계세요.",
    "similar": [
      "Feel comfortable here.",
      "Treat this place like your own.",
      "Mi casa es su casa.",
      "Don't be shy, settle in.",
      "Relax and enjoy yourself."
    ],
    "example": "A: Thanks for letting me stay here while I look for an apartment.\nB: Of course! Make yourself at home. There's plenty of space in the fridge.\nA: You're a lifesaver. I'll try not to get in the way too much.\nB: Chill. We've been friends for years. Just do your thing.\nA: I really appreciate it, for real.\nB: Say less. Let's grab some takeout tonight."
  },
  "expression_587": {
    "id": 587,
    "primary": "Take it or leave it.",
    "meaning": "싫으면 마세요.",
    "similar": [
      "This is my final offer.",
      "Accept it or not.",
      "No further negotiations.",
      "Take the deal as it is.",
      "That's it, take it or walk away."
    ],
    "example": "A: I'll give you fifty bucks for that vintage jacket.\nB: No way, it's worth at least eighty. Sixty-five, take it or leave it.\nA: Sixty is the most I can do right now, honestly.\nB: Alright, fine. Take it or leave it, sixty is the final price.\nA: Okay, deal. I've been looking for this specific style for weeks.\nB: Facts. It's a classic piece."
  },
  "expression_588": {
    "id": 588,
    "primary": "I don't want to have egg on my face.",
    "meaning": "창피당하고 싶지 않아요.",
    "similar": [
      "I want to avoid embarrassment.",
      "I don't want to look foolish.",
      "I want to save face.",
      "I don't want to be humiliated.",
      "I'm trying to avoid a public fail."
    ],
    "example": "A: Are you sure about these statistics for the meeting?\nB: Definitely. I don't want to have egg on my face in front of the board.\nA: Good thinking. They can be pretty brutal with their questions.\nB: For real. I've double-checked everything three times already.\nA: Better safe than sorry when it comes to the executives.\nB: Facts. I'm ready for whatever they throw at me."
  },
  "expression_589": {
    "id": 589,
    "primary": "I'm at a crossroads.",
    "meaning": "갈림길에 서 있어요.",
    "similar": [
      "I'm at a turning point.",
      "I have a big decision to make.",
      "I'm faced with a difficult choice.",
      "My life is about to change direction.",
      "I'm uncertain about which path to take."
    ],
    "example": "A: I'm not sure if I should stay at this job or go back to grad school.\nB: It sounds like you're at a crossroads. What does your gut tell you?\nA: Honestly, it change every day. One minute I'm ready to quit, the next I'm fine.\nB: Maybe take a week off and clear your head?\nA: That's a good idea. I need to figure out what I really want long-term.\nB: Facts. Don't rush into anything you'll regret later."
  },
  "expression_590": {
    "id": 590,
    "primary": "I'm an open book.",
    "meaning": "숨기는 게 없어요.",
    "similar": [
      "I'm very transparent.",
      "I don't keep secrets.",
      "I'm easy to read.",
      "I'm honest about everything.",
      "You can ask me anything."
    ],
    "example": "A: You always seem so honest about everything in your life.\nB: Yeah, I'm an open book. I don't see the point in hiding things.\nA: I wish I could be more like that. I'm always worried about what people think.\nB: Life is much easier when you're just yourself. No cap.\nA: I guess it takes a lot of confidence to be that vulnerable.\nB: Facts. But it's totally worth it for the real connections you make."
  },
  "expression_591": {
    "id": 591,
    "primary": "There was a little bit of a kerfuffle.",
    "meaning": "약간의 소동이 있었어요.",
    "similar": [
      "There was a minor disturbance.",
      "There was a bit of a fuss.",
      "A small commotion occurred.",
      "Things got a little messy for a second.",
      "It was a slight disagreement."
    ],
    "example": "A: What was all that noise in the lobby earlier?\nB: Oh, there was a little bit of a kerfuffle over a missing delivery.\nA: Did they figure it out? Everyone sounded pretty heated.\nB: Yeah, turns out it was just at the wrong door. All good now.\nA: People really lose their cool over the smallest things sometimes.\nB: Facts. Delivery day brings out the crazy in everyone."
  },
  "expression_592": {
    "id": 592,
    "primary": "The boys didn't cut the mustard.",
    "meaning": "기대에 미치지 못했어요.",
    "similar": [
      "They weren't good enough.",
      "They failed to meet the standard.",
      "They didn't perform as expected.",
      "They were inadequate for the task.",
      "They fell short of the goal."
    ],
    "example": "A: How did the new interns do on their first assignment?\nB: Honestly? The boys didn't cut the mustard. I've had to redo most of it.\nA: That's disappointing. I thought they were supposed to be top-tier.\nB: They have the degrees, but no real-world experience. It shows.\nA: Maybe they just need a bit more time to adjust?\nB: Possibly, but right now, it's more work for me. Facts."
  },
  "expression_593": {
    "id": 593,
    "primary": "How thoughtful of you to say that.",
    "meaning": "그렇게 말해주니 고맙네요.",
    "similar": [
      "Thank you for being so kind.",
      "That's very nice of you to mention.",
      "I appreciate your kind words.",
      "You're so considerate.",
      "That means a lot coming from you."
    ],
    "example": "A: I really think your new project is going to change the industry.\nB: Wow, how thoughtful of you to say that. I've been working so hard on it.\nA: It really shows. Your dedication is inspiring, for real.\nB: I appreciate the support. It's been a long journey.\nA: You deserve all the success that's coming your way.\nB: Facts. Thank you so much for the encouragement."
  },
  "expression_594": {
    "id": 594,
    "primary": "There is a fat chance of you winning.",
    "meaning": "이길 가능성이 거의 없어요.",
    "similar": [
      "You have very little chance of winning.",
      "It's highly unlikely you'll succeed.",
      "Success is a long shot.",
      "Don't count on winning.",
      "Zero chance of you taking the W."
    ],
    "example": "A: I'm thinking about entering the city marathon next month.\nB: Honestly? There is a fat chance of you winning against those pros.\nA: Hey! I've been training for three months already!\nB: I know, but these guys train for years. Just being realistic.\nA: I'm still gonna do it for the experience though.\nB: Facts. That's a better mindset anyway. Just finish the race!"
  },
  "expression_595": {
    "id": 595,
    "primary": "He finally got the message.",
    "meaning": "드디어 알아들었네요.",
    "similar": [
      "He finally understood.",
      "He eventually caught on.",
      "He got the hint at last.",
      "He's finally on the same page.",
      "He finally realized what was going on."
    ],
    "example": "A: After three warnings, he finally stopped showing up late.\nB: Good. It took him long enough, but he finally got the message.\nA: I was about to let him go, honestly.\nB: I think the threat of losing the job really motivated him.\nA: Facts. Some people just need a wake-up call to change.\nB: Glad things are finally running smoothly in the office."
  },
  "expression_596": {
    "id": 596,
    "primary": "He's lying through his teeth.",
    "meaning": "새빨간 거짓말을 하고 있어요.",
    "similar": [
      "He's telling a total lie.",
      "He's being completely dishonest.",
      "He's lying boldly.",
      "He's full of it.",
      "He's absolutely capping right now."
    ],
    "example": "A: He told the boss he finished the entire report over the weekend.\nB: No way! I saw him at the beach on Saturday. He's lying through his teeth.\nA: I knew it! His version of the story didn't make any sense.\nB: For real. He thinks he can just fake his way through everything.\nA: I should probably mention what I saw to the manager then.\nB: Facts. Don't let him get away with that. It's not fair to the team."
  },
  "expression_597": {
    "id": 597,
    "primary": "This is news to me.",
    "meaning": "처음 듣는 소식이네요.",
    "similar": [
      "I didn't know about this.",
      "This is the first I'm hearing of it.",
      "I'm surprised by this information.",
      "I was completely unaware.",
      "That's a new one for me."
    ],
    "example": "A: Did you hear that the office is moving to Brooklyn next month?\nB: Wait, really? This is news to me! No one mentioned it to my team.\nA: They just announced it in the company newsletter this morning.\nB: I must have missed that email. That's a huge change for my commute.\nA: For real. You might want to check for more details ASAP.\nB: Facts. I'm going to talk to HR right now."
  },
  "expression_598": {
    "id": 598,
    "primary": "It's time to get moving.",
    "meaning": "이제 움직일 시간이에요.",
    "similar": [
      "Let's get started.",
      "We should head out now.",
      "Time to make a move.",
      "Let's push forward.",
      "Stop waiting and start doing."
    ],
    "example": "A: We've been sitting here for two hours talking about the plan.\nB: You're right. It's time to get moving and actually execute.\nA: Ready when you are. Let's head to the site.\nB: Grab your gear and let's go. We have a lot of work ahead.\nA: No more talking, just doing from now on.\nB: Facts. Let's show them what we're capable of."
  },
  "expression_599": {
    "id": 599,
    "primary": "That's the spirit!",
    "meaning": "바로 그 기세야!",
    "similar": [
      "That's a great attitude!",
      "Keep that positive energy going!",
      "Nice job staying motivated!",
      "I love the enthusiasm!",
      "Exactly, that's what I want to hear!"
    ],
    "example": "A: I'm not gonna let that setback stop me. I'm gonna try again tomorrow!\nB: That's the spirit! I knew you wouldn't give up that easily.\nA: For real. One failure doesn't define the whole project.\nB: Facts. Consistency is the key to winning anyway.\nA: I'm feeling more motivated than ever now.\nB: Let's get it! I'm right behind you."
  },
  "expression_600": {
    "id": 600,
    "primary": "I'm on the mend.",
    "meaning": "회복 중이에요.",
    "similar": [
      "I'm getting better.",
      "I'm recovering.",
      "I'm on the road to recovery.",
      "My health is improving.",
      "I'm feeling much better lately."
    ],
    "example": "A: How are you feeling after that flu you had last week?\nB: Much better, thanks. I'm on the mend and should be back in the office by Monday.\nA: That's great news! We've really missed having you around.\nB: I missed being there too. Staying in bed all day is so boring.\nA: Rest up for a few more days just to be safe though.\nB: Facts. I don't want to overdo it and get sick again."
  },
  "expression_601": {
    "id": 601,
    "primary": "You sold me.",
    "meaning": "설득당했어요.",
    "similar": [
      "I'm convinced.",
      "You've persuaded me.",
      "I'm on board with your idea.",
      "I agree with you now.",
      "You've won me over."
    ],
    "example": "A: Think about it: we'd have a pool, a private chef, and zero noise.\nB: Honestly? You sold me with the 'private chef' part. Let's book the villa.\nA: I knew that would be the game changer for you!\nB: For real. I'm tired of cooking every single day while on vacation.\nA: It's gonna be the most relaxing trip ever, I promise.\nB: Facts. I'm already counting down the days."
  },
  "expression_602": {
    "id": 602,
    "primary": "I can't wrap my head around that.",
    "meaning": "도저히 이해가 안 가요.",
    "similar": [
      "I don't understand it at all.",
      "It's incomprehensible to me.",
      "I'm struggling to grasp the concept.",
      "It makes no sense to me.",
      "It's totally beyond my understanding."
    ],
    "example": "A: They're saying the universe is constantly expanding into... what, exactly?\nB: Honestly, I can't wrap my head around that either. It's too abstract.\nA: My brain literally starts hurting when I think about it for too long.\nB: Same. Physics is just on a whole different level, no cap.\nA: Maybe we should just stick to talking about movies instead.\nB: Facts. That's much easier for my human brain to handle."
  },
  "expression_603": {
    "id": 603,
    "primary": "That's so sweet of you.",
    "meaning": "정말 친절하시네요.",
    "similar": [
      "That's very kind of you.",
      "You're so thoughtful.",
      "I appreciate your kindness.",
      "That's lovely of you to do.",
      "You're such a sweetheart."
    ],
    "example": "A: I brought you some homemade soup since I heard you were feeling under the weather.\nB: Aw, that's so sweet of you! I really needed this right now.\nA: It's my grandma's recipe, so it's guaranteed to make you feel better.\nB: You're a lifesaver, for real. I'm gonna eat it right away.\nA: Let me know if you need anything else from the store later.\nB: Facts. You're the best friend a person could ask for."
  },
  "expression_604": {
    "id": 604,
    "primary": "I'll figure it out.",
    "meaning": "해결책을 찾을게요.",
    "similar": [
      "I'll find a solution.",
      "I'll sort it out.",
      "I'll manage it.",
      "I'll handle the problem.",
      "Leave it to me, I'll solve it."
    ],
    "example": "A: We lost the keys to the storage unit and we need that gear by tomorrow morning!\nB: Chill. I'll figure it out. I think I know where they might be hidden.\nA: I've looked everywhere! I'm starting to panic, honestly.\nB: Just take a deep breath. I've got this under control.\nA: I hope so. We really can't afford any more delays.\nB: Facts. I'll hit you up as soon as I find them."
  },
  "expression_605": {
    "id": 605,
    "primary": "Mobile technology is taking center stage.",
    "meaning": "모바일 기술이 중심이 되고 있어요.",
    "similar": [
      "Mobile is becoming the priority.",
      "Everything is revolving around smartphones now.",
      "Mobile tech is dominant.",
      "Mobile is at the forefront.",
      "Mobile technology is the main focus."
    ],
    "example": "A: Why are we prioritizing the mobile app over the web version this year?\nB: Look at the data. Mobile technology is taking center stage for our users.\nA: True, over eighty percent of our traffic comes from phones now.\nB: Exactly. We need to go where our audience is already spending their time.\nA: It's a big shift, but it definitely makes sense for the brand.\nB: Facts. It's all about staying relevant in this market."
  },
  "expression_606": {
    "id": 606,
    "primary": "He will lay bare the ugly truth.",
    "meaning": "추악한 진실을 밝힐 거예요.",
    "similar": [
      "He will reveal the harsh reality.",
      "He'll expose everything that's wrong.",
      "He's going to tell the unfiltered truth.",
      "He'll uncover the hidden problems.",
      "He won't sugarcoat the situation."
    ],
    "example": "A: I heard the CEO is giving a state-of-the-company speech tomorrow.\nB: Yeah, and everyone's nervous because he said he will lay bare the ugly truth about our finances.\nA: No more corporate fluff then? That's actually kind of refreshing.\nB: In a way, yeah, but it might mean some serious layoffs are coming.\nA: That's the scary part. We've known things were bad for a while though.\nB: Facts. It's better to know the truth than to live in denial."
  },
  "expression_607": {
    "id": 607,
    "primary": "I will leave no stone unturned.",
    "meaning": "온갖 수단을 다 쓸 거예요.",
    "similar": [
      "I'll search everywhere.",
      "I'll try every possible option.",
      "I'll be thorough in my search.",
      "I won't stop until I find it.",
      "I'm going to look into every detail."
    ],
    "example": "A: We still haven't found the source of the leak in the database.\nB: Don't worry. I will leave no stone unturned until we identify the problem.\nA: We've checked the logs, the server, everything... it's like a ghost.\nB: I'm going to do a deep dive into the actual code structure tonight.\nA: I appreciate the dedication. This is a critical issue for us.\nB: Facts. I won't sleep until this is resolved."
  },
  "expression_608": {
    "id": 608,
    "primary": "I'm off to the gym.",
    "meaning": "나 헬스장 가요.",
    "similar": [
      "I'm heading to work out.",
      "I'm going to hit the gym.",
      "Time for my workout.",
      "I'm off for some exercise.",
      "Heading to the fitness center now."
    ],
    "example": "A: Hey, you wanna grab some pizza after work?\nB: I wish! But I'm off to the gym. I've been slacking lately.\nA: Respect. I should probably go too, but I'm just too lazy today.\nB: Come with me! You'll feel so much better after a good session.\nA: Maybe tomorrow. For now, it's just me and my sofa.\nB: Facts. Enjoy your rest then, I'll see you later!"
  },
  "expression_609": {
    "id": 609,
    "primary": "Here's the thing.",
    "meaning": "실은 이래요.",
    "similar": [
      "This is the situation.",
      "Actually, the point is this.",
      "Here's the main idea.",
      "Let me explain it plainly.",
      "Basically, this is what's happening."
    ],
    "example": "A: Why are you being so quiet today? Is everything okay?\nB: Look, here's the thing: I'm just really stressed about this move next week.\nA: Oh! I thought I did something to annoy you!\nB: No, not at all. It's just a lot to handle all by myself.\nA: I'm so sorry! I should have realized you needed some help.\nB: Facts. If you have any free time this weekend, let me know."
  },
  "expression_610": {
    "id": 610,
    "primary": "The day can't come soon enough.",
    "meaning": "그날이 빨리 왔으면 좋겠어요.",
    "similar": [
      "I'm so looking forward to it.",
      "I can't wait for that day.",
      "I'm counting down the days.",
      "I wish it were that day already.",
      "I'm incredibly excited about it."
    ],
    "example": "A: Only three more days until we leave for Europe!\nB: For real. The day can't come soon enough. I'm so ready to disconnect.\nA: Have you finished all your packing yet?\nB: Almost. I just need to grab a few travel-size toiletries today.\nA: I'm so jealous! Take lots of pictures for me.\nB: Facts. I'll be posting them all over my feed, don't worry."
  },
  "expression_611": {
    "id": 611,
    "primary": "He has clout.",
    "meaning": "그는 영향력이 있어요.",
    "similar": [
      "He's influential.",
      "He has a lot of power.",
      "He's a big deal in the industry.",
      "He has social capital.",
      "People listen to what he says."
    ],
    "example": "A: How did he manage to get a meeting with the investors so quickly?\nB: Honestly? He has serious clout in the tech world. One phone call and he's in.\nA: I wish I had that kind of influence. It would make things so much easier.\nB: It takes years to build that kind of reputation, for real.\nA: Facts. I guess I'll just have to keep grinding until I get there.\nB: That's the only way to do it. Keep pushing."
  },
  "expression_612": {
    "id": 612,
    "primary": "He vanished into thin air.",
    "meaning": "감쪽같이 사라졌어요.",
    "similar": [
      "He disappeared completely.",
      "He went missing without a trace.",
      "He's nowhere to be found.",
      "He just evaporated.",
      "It's like he never existed."
    ],
    "example": "A: Where did that guy go who was talking to us earlier?\nB: Man, I have no idea. He literally vanished into thin air as soon as I turned my back.\nA: That's so creepy! He didn't even say goodbye or anything.\nB: For real. It's like he just phased out of reality. This place is weird.\nA: Maybe he was just an NPC in our simulation?\nB: Facts. Let's get out of here before something else happens."
  },
  "expression_613": {
    "id": 613,
    "primary": "Don't change the subject.",
    "meaning": "말 돌리지 마세요.",
    "similar": [
      "Stay on topic.",
      "Don't try to distract me.",
      "Answer my question properly.",
      "Stop avoiding the issue.",
      "I'm still waiting for an answer on the original point."
    ],
    "example": "A: So, about the money you owe me from last month...\nB: Oh! Did you see that the new season of that show just dropped?\nA: Yo, don't change the subject. We were talking about the fifty bucks.\nB: Alright, alright. I'll Venmo you right now, chill out.\nA: Thank you. I've been asking you for weeks, man.\nB: Facts. My bad. It slipped my mind, I promise."
  },
  "expression_614": {
    "id": 614,
    "primary": "I'm a glass half full person.",
    "meaning": "낙천적인 사람이에요.",
    "similar": [
      "I'm an optimist.",
      "I try to look on the bright side.",
      "I have a positive outlook.",
      "I'm naturally hopeful.",
      "I focus on the good things."
    ],
    "example": "A: Everything is going wrong today! This project is a absolute disaster.\nB: Look, I'm a glass half full person. At least we found the problem early.\nA: How can you be so positive right now? We're literally three days behind schedule!\nB: Panicking won't help. Let's just focus on what we can fix today.\nA: I guess you're right. Your attitude is actually kind of helpful, for real.\nB: Facts. Let's just take it one step at a time and we'll get through it."
  },
  "expression_615": {
    "id": 615,
    "primary": "Money doesn't grow on trees.",
    "meaning": "돈이 그냥 생기는 게 아니에요.",
    "similar": [
      "Money isn't easy to come by.",
      "You have to work hard for your cash.",
      "Funds are limited.",
      "We need to be careful with our spending.",
      "Wealth doesn't just appear out of nowhere."
    ],
    "example": "A: Can I get those new three-hundred-dollar sneakers for my birthday?\nB: Listen, money doesn't grow on trees. You need to show me you're taking your chores seriously first.\nA: But all my friends already have them! I feel so left out.\nB: I understand, but that doesn't mean we can just blow our budget on shoes.\nA: Fine, I'll start helping out around the house more then.\nB: Facts. Show me some effort and we'll talk about it next month."
  },
  "expression_616": {
    "id": 616,
    "primary": "Let's get into the swing of things.",
    "meaning": "흐름을 타봅시다 (익숙해집시다).",
    "similar": [
      "Let's get accustomed to the routine.",
      "Time to get into the flow of work.",
      "Let's familiarize ourselves with the situation.",
      "Let's get into the rhythm.",
      "Time to start working at our usual pace."
    ],
    "example": "A: It's my first day back after a two-week vacation and my brain is totally fried.\nB: No worries. Let's just get into the swing of things slowly. No stress.\nA: I have three hundred unread emails! Where do I even start?\nB: Just pick one, handle it, and move to the next. You'll be back in the flow in no time.\nA: I hope so. I feel like I've forgotten how to do my basic job tasks.\nB: Facts. It happens to the best of us after a long break."
  },
  "expression_617": {
    "id": 617,
    "primary": "I'm working on it.",
    "meaning": "노력 중이에요.",
    "similar": [
      "I'm in the process of doing it.",
      "It's a work in progress.",
      "I'm tackling the task now.",
      "I haven't forgotten, I'm making progress.",
      "I'm currently addressing the issue."
    ],
    "example": "A: Have you finished the design for the new landing page yet?\nB: I'm working on it right now. It should be ready by the end of the day.\nA: Awesome. The client is really eager to see the initial concepts.\nB: For real. I'm just trying to make sure the color palette is perfect.\nA: Take your time, then. Quality over speed every single time.\nB: Facts. I'll send you a preview link in a couple of hours."
  },
  "expression_618": {
    "id": 618,
    "primary": "She dropped a bombshell.",
    "meaning": "폭탄 선언을 했어요.",
    "similar": [
      "She shared shocking news.",
      "She made a surprising announcement.",
      "She revealed something completely unexpected.",
      "She told us something that blew our minds.",
      "She gave us a huge surprise."
    ],
    "example": "A: Did you hear about Sarah at the meeting earlier?\nB: Yeah! She dropped a bombshell that she's moving to Japan next month!\nA: No way! I had no idea she was even thinking about leaving the country.\nB: For real. Everyone was just sitting there in total shock. It was wild.\nA: I wonder what prompted such a big change so suddenly?\nB: Facts. I'm definitely going to reach out and ask her about it tonight."
  },
  "expression_619": {
    "id": 619,
    "primary": "I was in a quandary.",
    "meaning": "진퇴양난이었어요.",
    "similar": [
      "I was in a difficult dilemma.",
      "I was faced with two equally tough choices.",
      "I didn't know which way to turn.",
      "I was stuck in a complex situation.",
      "I was in a real pickle."
    ],
    "example": "A: Why did you take so long to decide between the two job offers?\nB: Honestly? I was in a real quandary. Both had amazing benefits and great teams.\nA: That's a good problem to have, but I bet it was still stressful.\nB: 100%. I literally made a pro and con list that was three pages long.\nA: So what finally made you choose the startup over the big bank?\nB: Facts. The potential for growth and the creative freedom just felt more 'me'."
  },
  "expression_620": {
    "id": 620,
    "primary": "Keep a lid on it.",
    "meaning": "비밀로 해주세요.",
    "similar": [
      "Keep it a secret.",
      "Don't tell anyone.",
      "Stay quiet about this info.",
      "Keep this under wraps.",
      "Hush-hush, okay?"
    ],
    "example": "A: I'm planning a surprise party for Mike's thirtieth birthday next week.\nB: No way! He's gonna be so shocked. I won't say a word.\nA: Perfect. Keep a lid on it because he's really good at guessing surprises.\nB: Trust me, my lips are sealed. I won't even mention the date to anyone.\nA: Thanks. I want this to be the best party he's ever had.\nB: Facts. He's a great guy, he definitely deserves it."
  },
  "expression_621": {
    "id": 621,
    "primary": "I pulled an all-nighter.",
    "meaning": "밤을 꼬박 새웠어요.",
    "similar": [
      "I stayed up all night to work.",
      "I didn't sleep at all last night.",
      "I was awake through the entire night.",
      "I worked until the sun came up.",
      "I had zero sleep because of this project."
    ],
    "example": "A: You look absolutely exhausted today. What happened?\nB: Ugh, I pulled an all-nighter trying to finish that final report before the deadline.\nA: Wow! You really should have started on it earlier, man.\nB: I know, I know. I'm a terrible procrastinator. It finally caught up with me.\nA: Well, at least it's done now. Go home and crash for twelve hours.\nB: Facts. I'm gonna fall asleep as soon as my head hits the pillow."
  },
  "expression_622": {
    "id": 622,
    "primary": "He has a heart of gold.",
    "meaning": "마음씨가 너무 착해요.",
    "similar": [
      "He's incredibly kind-hearted.",
      "He's a truly good person.",
      "He's very compassionate.",
      "He would do anything for anyone.",
      "He's the sweetest person I know."
    ],
    "example": "A: I heard Jim spent his entire Saturday helping that new family move in.\nB: That doesn't surprise me. He really has a heart of gold.\nA: For real. He never asks for anything in return either. He's just naturally helpful.\nB: Exactly. We need more people like him in this world, honestly.\nA: Facts. He's a real gem of a human being.\nB: I'm glad he's part of our team, for sure."
  },
  "expression_623": {
    "id": 623,
    "primary": "Everything is up in the air.",
    "meaning": "결정된 게 없어요.",
    "similar": [
      "Nothing is finalized yet.",
      "The situation is uncertain.",
      "Plans are still fluctuating.",
      "It's all undecided.",
      "We're still waiting for a final decision."
    ],
    "example": "A: Are we still going to the conference in Vegas next month?\nB: Honestly? Everything is up in the air right now because of the budget cuts.\nA: Oh no! I was really looking forward to that trip.\nB: Same here, but we're just waiting for the final word from the management.\nA: I hope they don't cancel it at the last minute.\nB: Facts. It's frustrating not knowing what's going to happen."
  },
  "expression_624": {
    "id": 624,
    "primary": "I'm on the fence.",
    "meaning": "고민 중이에요.",
    "similar": [
      "I'm undecided.",
      "I haven't made up my mind yet.",
      "I'm torn between two options.",
      "I'm still thinking about it.",
      "I'm not sure which way to go."
    ],
    "example": "A: Do you want to join the company softball team this season?\nB: Honestly? I'm on the fence. I'm worried about the time commitment.\nA: It's only once a week! It's a great way to meet people from other departments.\nB: I know, but I also have that evening class on Thursdays...\nA: Just come to the first practice and see if you like the vibe.\nB: Facts. I'll think about it and let you know by tomorrow morning."
  },
  "expression_625": {
    "id": 625,
    "primary": "My heart skipped a beat.",
    "meaning": "가슴이 철렁했어요.",
    "similar": [
      "I was suddenly startled.",
      "I felt a shock of fear/excitement.",
      "My breath hitched for a second.",
      "I was genuinely surprised.",
      "I had a momentary heart attack from shock."
    ],
    "example": "A: Did you see that guy almost get hit by that taxi earlier?\nB: Oh man, my heart skipped a beat just watching it! That was so close.\nA: For real. He wasn't even looking at the road, just staring at his phone.\nB: People really need to be more careful in this city. It's dangerous out here.\nA: Facts. I'm still feeling a little shaky from seeing it, honestly.\nB: Glad he's okay though. That was almost a disaster."
  },
  "expression_626": {
    "id": 626,
    "primary": "This is a walk in the park.",
    "meaning": "식은 죽 먹기죠.",
    "similar": [
      "This is incredibly easy.",
      "It's a piece of cake.",
      "No problem at all.",
      "I can do this with my eyes closed.",
      "It's quite simple to accomplish."
    ],
    "example": "A: Wow, that coding challenge looks really intense. Are you gonna be okay?\nB: Honestly? This is a walk in the park for me. I've done way harder stuff than this.\nA: Respect. I would have no idea where to even start with that logic.\nB: Once you learn the fundamentals, it's just like solving a puzzle.\nA: I'll have to take your word for it. Good luck anyway!\nB: Facts. I'll have this finished in ten minutes, just watch."
  },
  "expression_627": {
    "id": 627,
    "primary": "Speak for yourself.",
    "meaning": "네 생각일 뿐이야.",
    "similar": [
      "That's just your opinion.",
      "I don't necessarily agree with that.",
      "Don't include me in your statement.",
      "I have a different perspective.",
      "That only applies to you."
    ],
    "example": "A: Everyone is so bored during these weekly meetings, right?\nB: Hey! Speak for yourself. I actually find the updates quite helpful.\nA: Seriously? It's just two hours of people talking about things that don't matter.\nB: Well, some of us actually like knowing what's going on in the rest of the firm.\nA: I guess I'm just more task-oriented than you are then.\nB: Facts. Different strokes for different folks, I guess."
  },
  "expression_628": {
    "id": 628,
    "primary": "Get your act together.",
    "meaning": "정신 차려요.",
    "similar": [
      "Start behaving more responsibly.",
      "Organize your life better.",
      "Improve your performance.",
      "Stop making mistakes.",
      "Focus and do a better job."
    ],
    "example": "A: I forgot my laptop at home again and I have a presentation in ten minutes!\nB: Seriously? You really need to get your act together. This is the third time this month.\nA: I know, I know. My morning routine is just so chaotic lately.\nB: Maybe try setting a checklist by the door or something. You're gonna get fired.\nA: You're right. I'm gonna make some serious changes starting tonight.\nB: Facts. Consistency and reliability are everything in this industry."
  },
  "expression_629": {
    "id": 629,
    "primary": "I'm not phased.",
    "meaning": "당황하지 않아요.",
    "similar": [
      "I'm not bothered by it.",
      "I'm staying calm.",
      "That doesn't upset me.",
      "I'm unfazed by the situation.",
      "It doesn't affect my composure."
    ],
    "example": "A: Aren't you worried about the major changes they announced for next year?\nB: Honestly? I'm not phased. I've been through plenty of corporate restructures before.\nA: I wish I had your confidence. I'm already looking for other job opportunities.\nB: Chill out. Change is part of life. Just adapt and keep moving forward.\nA: I guess you're right. Experience really does make a difference, huh?\nB: Facts. Once you've seen it all, nothing really surprises you anymore."
  },
  "expression_630": {
    "id": 630,
    "primary": "Don't drag your feet.",
    "meaning": "꾸물거리지 마세요.",
    "similar": [
      "Stop procrastinating.",
      "Don't take so long.",
      "Move a bit faster, please.",
      "Get on it already.",
      "Don't delay any further."
    ],
    "example": "A: I'll start working on the project after I finish this game.\nB: Seriously? Don't drag your feet, the deadline is in two hours!\nA: I know, I know. I just needed a quick break to clear my head.\nB: You've been on that 'break' for forty-five minutes, man.\nA: alright, alright. I'm closing the game now. I'm on it.\nB: Facts. We really need to get this done."
  },
  "expression_631": {
    "id": 631,
    "primary": "Knock it off!",
    "meaning": "그만 좀 해!",
    "similar": [
      "Stop it!",
      "Quit doing that!",
      "Enough already!",
      "Cut it out!",
      "Give it a rest!"
    ],
    "example": "A: Hey! I'm trying to study and you're making way too much noise!\nB: I was just practicing my drums for a second...\nA: Knock it off! You've been 'practicing' for an hour. My head is pounding.\nB: My bad, I didn't realize it was that loud. I'll stop now.\nA: Thank you. I really need to focus on this final exam.\nB: Say less. I'll go play something on my phone instead."
  },
  "expression_632": {
    "id": 632,
    "primary": "What brought you here?",
    "meaning": "여긴 어쩐 일이에요?",
    "similar": [
      "What are you doing here?",
      "What's the occasion for your visit?",
      "What brings you to this place?",
      "How did you end up here today?",
      "I didn't expect to see you here!"
    ],
    "example": "A: Oh! Hey Mark! What brought you here to the library on a Saturday?\nB: Honestly? I just needed some quiet time to work on my portfolio.\nA: I thought you always worked at that coffee shop downtown.\nB: It was too crowded today, no cap. This place is much more peaceful.\nA: I feel you. It's a hidden gem for productivity, for real.\nB: Facts. I'm actually getting quite a lot done today."
  },
  "expression_633": {
    "id": 633,
    "primary": "The ball is in your court.",
    "meaning": "이제 네 결정에 달렸어.",
    "similar": [
      "It's up to you now.",
      "The decision is yours.",
      "I've done my part, now you decide.",
      "You have the final word.",
      "The next move is yours."
    ],
    "example": "A: I've sent you all the details and my final offer for the partnership.\nB: Thanks, I'll review it with my team this afternoon and let you know.\nA: Perfect. The ball is in your court now. I hope we can make this work.\nB: We're definitely interested, we just need to double-check the numbers.\nA: Take your time. I'm confident it's a great deal for both of us.\nB: Facts. I'll hit you up by tomorrow morning for sure."
  },
  "expression_634": {
    "id": 634,
    "primary": "That will be the day.",
    "meaning": "절대 그럴 리 없어요.",
    "similar": [
      "That's never going to happen.",
      "I'll believe it when I see it.",
      "Yeah, right!",
      "Not in a million years.",
      "Don't count on it."
    ],
    "example": "A: I heard he's finally going to start showing up to meetings on time.\nB: Haha! That will be the day. He's been late every single time for three years.\nA: Maybe he's actually trying to change his habits now?\nB: I doubt it. He literally laughed when the boss mentioned punctuality.\nA: I guess some people just never learn, no cap.\nB: Facts. I'll keep my expectations exactly where they are—at zero."
  },
  "expression_635": {
    "id": 635,
    "primary": "They're fighting tooth and nail.",
    "meaning": "필사적으로 싸우고 있어요.",
    "similar": [
      "They're putting up a fierce fight.",
      "They're struggling with everything they have.",
      "They're battling intensely.",
      "They're determined to win at all costs.",
      "They're giving it their absolute all in the conflict."
    ],
    "example": "A: Both companies are trying to win that government contract.\nB: Yeah, they're fighting tooth and nail for it. It's gettin' pretty intense.\nA: I heard they're even hiring specialized lobbyists now.\nB: For real. Millions of dollars are on the line, so it makes sense.\nA: It's definitely gonna be a long and messy battle.\nB: Facts. Only one of them is coming out on top."
  },
  "expression_636": {
    "id": 636,
    "primary": "I passed with flying colors.",
    "meaning": "우수한 성적으로 합격했어요.",
    "similar": [
      "I succeeded brilliantly.",
      "I did exceptionally well on the test.",
      "I passed with top marks.",
      "I nailed it completely.",
      "I crushed the exam beyond expectations."
    ],
    "example": "A: How did your driving test go? Were you nervous?\nB: I was! But honestly? I passed with flying colors. Not a single mistake.\nA: No way! That's incredible! Most people fail on their first try.\nB: I know! I was so focused, I didn't even notice the instructor was there.\nA: You should celebrate tonight. Let's grab some dinner.\nB: Facts. I'm treated myself to a big steak as soon as I get home."
  },
  "expression_637": {
    "id": 637,
    "primary": "I don't want to make a scene.",
    "meaning": "소란 피우고 싶지 않아요.",
    "similar": [
      "I want to avoid public drama.",
      "Let's keep this private.",
      "I don't want to embarrass anyone.",
      "Let's not draw attention to ourselves.",
      "Keep the peace by not reacting loudly."
    ],
    "example": "A: Can you believe he just said that to her in front of everyone?\nB: I know! She was so calm though. She clearly didn't want to make a scene.\nA: If it were me, I would have yelled right back, no cap.\nB: That would have just made things worse for everyone. She's classier than that.\nA: You're right. Sometimes staying quiet is the most powerful move.\nB: Facts. She handle that situation with so much grace."
  },
  "expression_638": {
    "id": 638,
    "primary": "That cracked me up.",
    "meaning": "빵 터졌어요.",
    "similar": [
      "That was hilarious.",
      "I laughed so hard at that.",
      "That really got me laughing.",
      "That was so funny I couldn't stop.",
      "You literal made my day with that joke."
    ],
    "example": "A: Did you see that video of the dog trying to eat its own Shadow?\nB: Oh man, that cracked me up for like ten minutes straight!\nA: The way it just kept spinning in circles was pure comedy gold.\nB: For real. Dogs are honestly the best thing on the internet.\nA: I shared it with my whole family. Everyone loved it.\nB: Facts. We all need a good laugh like that sometimes."
  },
  "expression_639": {
    "id": 639,
    "primary": "I'll have you know.",
    "meaning": "알아두셔야 할 게 있어요.",
    "similar": [
      "For your information.",
      "I'd like to point out that.",
      "Just so you're aware.",
      "Let me tell you something.",
      "I want to clarify that."
    ],
    "example": "A: You're always so lazy when it comes to chores around here.\nB: Actually, I'll have you know that I already did all the laundry this morning.\nA: Wait, really? The whole basket? Even my heavy jeans?\nB: Yes, everything is already folded and in your room. Check it yourself.\nA: Wow... I'm sorry, I shouldn't have assumed you were slacking.\nB: Facts. Don't underestimate my productivity when I'm motivated."
  },
  "expression_640": {
    "id": 640,
    "primary": "Hear me out.",
    "meaning": "끝까지 들어보세요.",
    "similar": [
      "Listen to what I have to say first.",
      "Let me explain before you react.",
      "Give me a chance to finish.",
      "Hear my side of the story.",
      "Listen carefully to my explanation."
    ],
    "example": "A: I really don't think we should invest in that new crypto platform.\nB: Just hear me out for a second. The technology behind it is actually innovative.\nA: I've heard this a thousand times before. It's all hype, no cap.\nB: Look, I've done the research and the whitepaper is solid. Just let me show you.\nA: Alright, fine. You have five minutes to convince me.\nB: Facts. That's all I need. Watch this video first."
  },
  "expression_641": {
    "id": 641,
    "primary": "You're telling me!",
    "meaning": "내 말이 그 말이야!",
    "similar": [
      "I couldn't agree more!",
      "Exactly what I was thinking!",
      "I know, right?",
      "You're preachin' to the choir!",
      "Tell me about it!"
    ],
    "example": "A: This summer heat in the city is getting absolutely unbearable.\nB: You're telling me! I've had my AC on full blast for three days straight.\nA: My electricity bill is gonna be insane next month, but it's worth it.\nB: For real. I can't even step outside without melting in five minutes.\nA: I'm just staying inside until September at this point.\nB: Facts. Let's just pray for some literal rain soon."
  },
  "expression_642": {
    "id": 642,
    "primary": "His wife chewed him out.",
    "meaning": "아내가 그를 몹시 꾸짖었어요.",
    "similar": [
      "She gave him a piece of her mind.",
      "She scolded him severely.",
      "She lectured him for a long time.",
      "She was really angry and let him know.",
      "He got a serious talking-to from her."
    ],
    "example": "A: Why was Mike looking so depressed at the party last night?\nB: Man, his wife chewed him out for forgetting their anniversary. It was brutal.\nA: Ouch. That's a huge mistake to make, no cap.\nB: For real. He felt so bad he didn't even want to eat his favorite cake.\nA: I hope he made it up to her with something really special today.\nB: Facts. He was already looking at jewelry websites this morning."
  },
  "expression_643": {
    "id": 643,
    "primary": "Please spread the word.",
    "meaning": "소문 좀 내주세요.",
    "similar": [
      "Tell everyone about this.",
      "Help get the message out.",
      "Share this information with others.",
      "Broadcast this news to your network.",
      "Promote this to your friends and family."
    ],
    "example": "A: Our new community garden is finally open to the public this weekend!\nB: That's amazing! I'll definitely be there to support it.\nA: Please spread the word on your social media. We need more volunteers.\nB: Say less. I'll post it on my Instagram story right now.\nA: Thank you! We really want this to be a success for the whole neighborhood.\nB: Facts. People need more green spaces in this city anyway."
  },
  "expression_644": {
    "id": 644,
    "primary": "I hate to break it to you, but.",
    "meaning": "말하기 미안하지만.",
    "similar": [
      "I'm sorry to have to tell you this.",
      "Unfortunately, the truth is that.",
      "I regret being the bearer of bad news, but.",
      "I've got some difficult information for you.",
      "Don't take this the wrong way, but."
    ],
    "example": "A: I'm so excited to use my new discount code for that luxury store!\nB: Look, I hate to break it to you, but that code expired at midnight.\nA: Wait, really? But it said it was valid until the end of the month!\nB: I think it was 'while supplies last' or something. It's not working for me either.\nA: Oh my god, I was literally about to buy that purse. I'm so sad.\nB: Facts. Better to know now than at the checkout screen though."
  },
  "expression_645": {
    "id": 645,
    "primary": "For all I care.",
    "meaning": "나랑은 상관없어.",
    "similar": [
      "I don't care at all.",
      "It makes no difference to me.",
      "I'm completely indifferent.",
      "As far as I'm concerned, it doesn't matter.",
      "Whatever happens, I don't give a damn."
    ],
    "example": "A: He's actually thinking about quitting the team and joining the rival club.\nB: For all I care, he can go. He hasn't been a good teammate lately anyway.\nA: Wow, you really don't seem bothered by it at all.\nB: Honestly? The team vibe will probably improve without his negative energy.\nA: I guess it's better to have people who actually want to be here.\nB: Facts. We're better off focusing on our own performance."
  },
  "expression_646": {
    "id": 646,
    "primary": "Don't sweat it.",
    "meaning": "걱정 마세요.",
    "similar": [
      "Don't worry about it.",
      "No big deal.",
      "It's all good.",
      "Don't stress over it.",
      "Focus on something else, it's fine."
    ],
    "example": "A: I'm so sorry I'm ten minutes late! The subway was absolutely packed.\nB: Relax, don't sweat it. The meeting hasn't even started yet.\nA: I hate being late, I feel so irresponsible when it happens.\nB: Chill. We all know how unpredictable the commute can be in this city.\nA: Thanks for being so understanding. I really appreciate it.\nB: Facts. Let's just grab some coffee and get ready for the presentation."
  },
  "expression_647": {
    "id": 647,
    "primary": "No word of a lie.",
    "meaning": "거짓말 하나 안 보태고요.",
    "similar": [
      "I'm telling the absolute truth.",
      "I'm not exaggerating at all.",
      "This is 100% facts.",
      "I swear this is exactly what happened.",
      "Every word I'm saying is true."
    ],
    "example": "A: You actually met a celebrity at the grocery store last night?\nB: Yes! No word of a lie, he was standing right behind me in the cereal aisle.\nA: Did you say anything? Or were you too starstruck?\nB: I just said 'Hi' and he gave me a little nod. It was so intense.\nA: That's a crazy story to tell! People are gonna think you're capping.\nB: Facts. But I have a blurry photo to prove it! Check this out."
  },
  "expression_648": {
    "id": 648,
    "primary": "People came out of the woodwork.",
    "meaning": "갑자기 나타났어요.",
    "similar": [
      "They appeared unexpectedly from nowhere.",
      "A bunch of people showed up suddenly.",
      "Unexpected arrivals occurred.",
      "Everyone suddenly wanted a piece of the action.",
      "It felt like a swarm appeared out of nowhere."
    ],
    "example": "A: As soon as I announced I had extra tickets to the concert, people came out of the woodwork.\nB: I bet! Everyone's been trying to get into that show for months.\nA: I had random people from high school messaging me asking for a favor!\nB: For real. Success really brings out the 'old friends', doesn't it?\nA: It was a bit overwhelming, to be honest. I just ended up giving them to my cousins.\nB: Facts. Best way to avoid all that unnecessary drama."
  },
  "expression_649": {
    "id": 649,
    "primary": "It's like riding a bike.",
    "meaning": "금방 다시 할 수 있는 일이에요.",
    "similar": [
      "It's something you never forget how to do.",
      "It'll come back to you quickly.",
      "You'll regain the skill in no time.",
      "It's a natural ability once learned.",
      "Muscle memory will kick in."
    ],
    "example": "A: I haven't coded in Python in over three years. I'm worried I've forgotten it all.\nB: Don't worry, it's like riding a bike. Once you start, it'll all come back.\nA: I hope so. I have that big technical interview on Monday.\nB: Just spend a few hours on some practice problems tonight. You'll be fine.\nA: You're right. The fundamentals are still there somewhere in my brain.\nB: Facts. Just trust your experience and you'll crush it."
  },
  "expression_650": {
    "id": 650,
    "primary": "I poured over this book.",
    "meaning": "정독했어요.",
    "similar": [
      "I studied this book very carefully.",
      "I read every single word in detail.",
      "I was deeply absorbed in this reading.",
      "I scrutinized the entire contents.",
      "I spent hours analyzing this text."
    ],
    "example": "A: You seem to know everything about ancient history all of a sudden.\nB: Well, I poured over this book for the last three weeks. It's fascinating.\nA: No way! That looks like a textbook from the 80s. Is it even readable?\nB: Surprisingly, yeah. The level of detail is just unmatched by modern stuff.\nA: Respect. I can barely finish a five-page article these days.\nB: Facts. Deep reading really changes your perspective on things, for real."
  },
  "expression_651": {
    "id": 651,
    "primary": "It's high time we did.",
    "meaning": "진작 했어야 할 시간이에요.",
    "similar": [
      "It should have been done a long time ago.",
      "We're overdue for this action.",
      "Finally, we're doing it!",
      "It's about time we made a move.",
      "No more waiting, it's necessary now."
    ],
    "example": "A: Are we finally starting the office renovation next week?\nB: Yes! It's high time we did. The carpets are literally falling apart.\nA: I've been complaining about those stains for two years, honestly.\nB: For real. It's embarrassing to have clients come in here with the place looking like this.\nA: I'm just glad the budget finally got approved for the whole building.\nB: Facts. It's gonna look like a whole different place soon."
  },
  "expression_652": {
    "id": 652,
    "primary": "I don't want to split hairs.",
    "meaning": "사소한 걸로 따지기 싫어요.",
    "similar": [
      "Let's not get bogged down in tiny details.",
      "Avoid unnecessary nitpicking.",
      "Let's focus on the big picture.",
      "Don't argue over trivial matters.",
      "I'm not trying to be pedantic here."
    ],
    "example": "A: Technicianly, we were three minutes late, not five.\nB: Look, I don't want to split hairs. The meeting already started, let's just go in.\nA: I'm just saying, accuracy matters when it comes to time management!\nB: I get it, but right now, three or five doesn't make a difference. Move it.\nA: Alright, alright. I'm going. Sorry for being such a stickler.\nB: Facts. Let's just get the info we need and get out of here."
  },
  "expression_653": {
    "id": 653,
    "primary": "He made a blunder.",
    "meaning": "큰 실수를 했어요.",
    "similar": [
      "He committed a major error.",
      "He made a serious mistake.",
      "He messed up big time.",
      "That was a significant fail on his part.",
      "He really dropped the ball this time."
    ],
    "example": "A: What happened with the marketing campaign? I heard it was a absolute disaster.\nB: Man, the lead designer made a blunder and forgot the link to the actual product.\nA: No way! So all that traffic just went to... nowhere?\nB: Exactly. Thousands of dollars in ad spend just gone down the drain.\nA: Ouch. He's definitely gonna be in trouble for that one.\nB: Facts. It's a miracle he still has a job after such a huge error."
  },
  "expression_654": {
    "id": 654,
    "primary": "He has money to burn.",
    "meaning": "돈이 아주 많아요.",
    "similar": [
      "He's incredibly wealthy.",
      "He has more money than he knows what to do with.",
      "He's super rich and loves to spend.",
      "He's loaded.",
      "Wealthy beyond measure."
    ],
    "example": "A: Did you see his new sports car? It must have cost a fortune.\nB: Oh, he has money to burn. He's got three more just like it at home.\nA: I wish I could just drop that much cash on a whim like it's nothing.\nB: For real. Some people really live in a different world than the rest of us.\nA: I guess it's nice if you can afford that kind of lifestyle though.\nB: Facts. I'd definitely be traveling the world every single weekend."
  },
  "expression_655": {
    "id": 655,
    "primary": "I got choked up.",
    "meaning": "목이 메었어요.",
    "similar": [
      "I became very emotional.",
      "I was on the verge of crying.",
      "I felt a lump in my throat.",
      "I was moved to tears.",
      "I struggled to speak due to being overwhelmed with emotion."
    ],
    "example": "A: How was the movie? I heard it was a real tear-jerker.\nB: Oh man, I got so choked up during the ending. I wasn't expecting that.\nA: I saw it too! When they finally reunited, I was literally sobbing.\nB: For real. It's rare for a movie to actually touch your heart like that.\nA: I definitely need a fluffy comedy to watch after this to feel better.\nB: Facts. That was too heavy for a Friday night, no cap."
  },
  "expression_656": {
    "id": 656,
    "primary": "Try not to get in the way.",
    "meaning": "방해하지 마세요.",
    "similar": [
      "Stay out of the middle of things.",
      "Don't obstruct the process.",
      "Avoid being a hindrance.",
      "Stay clear of the action.",
      "Make sure you're not a nuisance while others work."
    ],
    "example": "A: Can I help with the cooking for the big dinner tonight?\nB: Thanks, but honestly? Try not to get in the way for now. It's a tiny kitchen.\nA: Oh! I didn't realize there were already three people in there.\nB: Yeah, it's a bit of a literal zoo. Just wait in the living room for a bit.\nA: Alright, I'll just be the official taster when things are ready then.\nB: Facts. That's a job I know you'll be perfect for."
  },
  "expression_657": {
    "id": 657,
    "primary": "You have to learn the ropes.",
    "meaning": "요령을 익혀야 해요.",
    "similar": [
      "You need to understand how things work here.",
      "Get familiar with the procedures.",
      "Learn the basics of the job.",
      "Figure out the routine and unspoken rules.",
      "Acquire the necessary skills for this environment."
    ],
    "example": "A: It's my first week here and I feel so overwhelmed by all the systems.\nB: Don't worry, you just have to learn the ropes. It takes a bit of time for everyone.\nA: Is there a manual or something I can read to understand the workflow?\nB: Honestly? The best way is to just shadowing someone for a few days.\nA: That sounds much better than reading a boring PDF anyway.\nB: Facts. You'll catch on much faster once you see it in action."
  },
  "expression_658": {
    "id": 658,
    "primary": "He's milking it.",
    "meaning": "과하게 이용해 먹고 있어요.",
    "similar": [
      "He's exploiting the situation for all it's worth.",
      "He's taking unfair advantage.",
      "He's dragging it out for personal gain.",
      "He's being greedy with the opportunity.",
      "He's making a big deal out of it just to get attention."
    ],
    "example": "A: Did you see his latest post about that minor injury from two weeks ago?\nB: Man, he's totally milking it for likes and sympathy at this point.\nA: I know! He's still wearing a 'brace' that clearly isn't even for his arm.\nB: For real. It's so obvious what he's doing. Everyone sees through it.\nA: People really do anything for clout these days, no cap.\nB: Facts. It's actually kind of embarrassing to watch, honestly."
  },
  "expression_659": {
    "id": 659,
    "primary": "You can't cherry pick.",
    "meaning": "좋은 것만 골라 가질 순 없어요.",
    "similar": [
      "You have to take the good with the bad.",
      "Don't just choose the easy parts.",
      "No selective choosing allowed.",
      "Take the whole package as it is.",
      "Consistency matters across everything, not just the fun stuff."
    ],
    "example": "A: I only want to work on the creative side of the business, not the admin stuff.\nB: Look, it's a small team. You can't cherry pick the tasks you like.\nA: But I'm way better at designing things than I am at spreadsheets!\nB: I get it, but we all have to do the boring work too. It's part of the job.\nA: Fine, I'll start working on those reports this afternoon then.\nB: Facts. Thank you for being a team player. It makes a difference."
  },
  "expression_660": {
    "id": 660,
    "primary": "You hit the bullseye.",
    "meaning": "정곡을 찔렀네요.",
    "similar": [
      "You're exactly right.",
      "You nailed the point perfectly.",
      "That's an accurate assessment.",
      "Spot on with that analysis!",
      "You identified the core issue correctly."
    ],
    "example": "A: I think the real reason we're losing customers is the confusing checkout process.\nB: You hit the bullseye! I've been saying that for months but no one listened.\nA: It just feels like there are too many steps and it's frustrating.\nB: For real. We need to simplify it ASAP if we want to save our sales.\nA: I'll start working on a redesign concept tomorrow morning.\nB: Facts. That should be our number one priority right now."
  },
  "expression_661": {
    "id": 661,
    "primary": "What's in a name?",
    "meaning": "이름이 뭐 그리 중요한가요?",
    "similar": [
      "Does the name really matter that much?",
      "The name isn't the most important part.",
      "A name doesn't define the essence.",
      "It's what's inside that counts, not the label.",
      "Why focus so much on the title or name?"
    ],
    "example": "A: They're changing the brand name from 'TechGuru' to 'SmarterThings'.\nB: Honestly? What's in a name? As long as the product still works, I don't care.\nA: It sounds a bit more modern, but I'll miss the original vibe.\nB: For real. People worry way too much about branding these days, no cap.\nA: I guess it's just about staying competitive in the market, right?\nB: Facts. But ultimately, the service is what keeps people coming back."
  },
  "expression_662": {
    "id": 662,
    "primary": "He walks the walk.",
    "meaning": "행동으로 보여주는 사람이에요.",
    "similar": [
      "He backs up his words with actions.",
      "He's a man of action, not just talk.",
      "He practices what he preaches.",
      "He's consistent in his behavior.",
      "He's reliable and does what he says he will."
    ],
    "example": "A: I wasn't sure about the new manager, but he's actually helping us with the heavy lifting.\nB: Yeah, he's great. He really walks the walk. No more just barking orders.\nA: It's so refreshing to have a leader who isn't afraid to get their hands dirty.\nB: For real. The morale of the team has improved so much since he started.\nA: I actually feel motivated to work harder when he's around.\nB: Facts. That's the difference between a boss and a real leader."
  },
  "expression_663": {
    "id": 663,
    "primary": "We'll cross that bridge when we come to it.",
    "meaning": "그 일은 그때 가서 생각하죠.",
    "similar": [
      "Let's not worry about that until it happens.",
      "We'll deal with that problem later.",
      "One step at a time.",
      "Save that discussion for when it's relevant.",
      "No need to stress about potential future issues now."
    ],
    "example": "A: What if the client rejects the whole concept after we've already built it?\nB: You know what? We'll cross that bridge when we come to it. Focus on the now.\nA: I just want to have a backup plan just in case things go south.\nB: I hear you, but let's not waste energy on 'what ifs' right now. Let's build it.\nA: Alright, alright. I'm staying focused on the current phase.\nB: Facts. That's the only way we're gonna finish this on time anyway."
  },
  "expression_664": {
    "id": 664,
    "primary": "Let's let the dust settle.",
    "meaning": "상황이 진정되길 기다립시다.",
    "similar": [
      "Wait for things to calm down first.",
      "Let's wait for the initial reaction to pass.",
      "Give it some time to normalize.",
      "Don't make a move until the situation is clear.",
      "Patience is key right now, let's wait."
    ],
    "example": "A: Everyone is so upset after the announcement this morning!\nB: I know. Let's let the dust settle before we try to explain anything else.\nA: People need time to process the news, for real.\nB: Exactly. Acting impulsively right now will only make things more heated.\nA: We'll have a formal follow-up meeting next week then.\nB: Facts. By then, cooler heads should hopefully prevail."
  },
  "expression_665": {
    "id": 665,
    "primary": "He was as hard as nails.",
    "meaning": "냉혹한 사람이었어요.",
    "similar": [
      "He was incredibly tough and unsympathetic.",
      "He had a cold and unyielding personality.",
      "He was very stern and strict.",
      "He was emotionally distant and harsh.",
      "He didn't show any mercy or weakness."
    ],
    "example": "A: I heard the old professor was absolute nightmare to work with.\nB: Man, he was as hard as nails. He never gave anyone a break, no cap.\nA: No matter how hard I studied, I could never get a grade higher than a B-.\nB: For real. He used to fail people for the smallest mistakes. It was brutal.\nA: Some people are just built differently, in a bad way.\nB: Facts. I'm just glad I finally finished his class and moved on."
  },
  "expression_666": {
    "id": 666,
    "primary": "You have what it takes to succeed.",
    "meaning": "성공할 자질이 있어요.",
    "similar": [
      "You possess the necessary skills and qualities.",
      "You're capable of achieving great things.",
      "You have the potential to win.",
      "I believe in your ability to make it happen.",
      "You're built for this success."
    ],
    "example": "A: I'm really nervous about starting my own business from zero.\nB: Look, you have what it takes to succeed. You're hardworking and smart.\nA: Do you really think so? It feels like such a huge risk, no cap.\nB: 100%. Every successful person feels that way at the start. Just keep going.\nA: I appreciate the vote of confidence. It really helps right now.\nB: Facts. I know you're gonna crush it. Don't let anyone tell you otherwise."
  },
  "expression_667": {
    "id": 667,
    "primary": "Don't push your luck.",
    "meaning": "너무 욕심부리지 마세요 (운을 시험하지 마세요).",
    "similar": [
      "Don't take too many risks.",
      "Stop while you're ahead.",
      "Don't overextend yourself.",
      "Be careful not to ruin your current good situation.",
      "Don't test fate by asking for too much."
    ],
    "example": "A: I already got a free appetizer, maybe I should ask for a free drink too?\nB: Honestly? Don't push your luck. They've already been very generous today.\nA: But the service was a bit slow at first! I think I deserve it.\nB: Chill. You got a whole meal for fifty percent off. Just enjoy it and move on.\nA: Alright, alright. I'll just be happy with what I got.\nB: Facts. Don't be that guy who always wants more than his fair share."
  },
  "expression_668": {
    "id": 668,
    "primary": "I'm at the end of my rope.",
    "meaning": "이제 한계예요.",
    "similar": [
      "I've reached my limit.",
      "I'm completely exhausted and stressed out.",
      "I can't handle any more of this.",
      "I'm desperate and don't know what to do.",
      "I'm emotionally drained."
    ],
    "example": "A: I have three deadlines tomorrow and my laptop just literally died.\nB: Oh no! I'm so sorry! Do you want to borrow mine for the night?\nA: Honestly? I'm at the end of my rope. I just want to give up and cry.\nB: Take a deep breath. We'll find a solution together. No stress.\nA: Thank you. I'm just so overwhelmed by everything right now.\nB: Facts. Let's grab some coffee and tackle one thing at a time."
  },
  "expression_669": {
    "id": 669,
    "primary": "It's a small world.",
    "meaning": "세상 참 좁네요.",
    "similar": [
      "What a coincidence to see you here!",
      "The world is surprisingly connected.",
      "Strange to meet you in this place!",
      "Isn't it funny how things work out?",
      "What a tiny world we live in!"
    ],
    "example": "A: Wait, you went to the same high school as my brother in Seattle?\nB: No way! It's such a small world! I literally haven't seen him in years.\nA: He always talks about how much he miss that city. It's so beautiful.\nB: Small world, for real. I'm actually visiting there next month for a wedding.\nA: I'll have to tell him we met! He's gonna be so surprised.\nB: Facts. Let's exchange numbers and I'll send him a message."
  },
  "expression_670": {
    "id": 670,
    "primary": "You're on thin ice.",
    "meaning": "너 지금 아슬아슬해 (위험한 상황이야).",
    "similar": [
      "You're in a risky position.",
      "One more mistake and you're in big trouble.",
      "You're pushing the boundaries too far.",
      "Be very careful about your next move.",
      "You're in a precarious situation."
    ],
    "example": "A: I was only five minutes late to the meeting, why is the boss so mad?\nB: Look, you're on thin ice after that feedback you missed last week.\nA: I didn't think it was such a big deal, no cap.\nB: It is to him. He's really big on professional and consistency lately.\nA: I guess I'll have to be extra careful from now on then.\nB: Facts. Don't give him any more reasons to doubt your commitment."
  },
  "expression_671": {
    "id": 671,
    "primary": "I'll give it a shot.",
    "meaning": "한번 해볼게요.",
    "similar": [
      "I'll try my best.",
      "Let's see if I can do it.",
      "I'll take a crack at it.",
      "I'm willing to attempt it.",
      "I'll go for it and see what happens."
    ],
    "example": "A: We need someone to lead the presentation in front of the whole team.\nB: Honestly? I'll give it a shot. I've been wanting to practice public speaking.\nA: That's the spirit! It's a great opportunity to show your expertise.\nB: I'm a bit nervous, but I'll prepare as much as I can by Friday.\nA: You'll be amazing. Just speak from the heart and you'll crush it.\nB: Facts. I'm actually kind of excited for the challenge now."
  },
  "expression_672": {
    "id": 672,
    "primary": "Keep your chin up.",
    "meaning": "기운 내요.",
    "similar": [
      "Stay positive!",
      "Don't lose hope!",
      "Stay strong during this difficult time!",
      "Look forward to better days!",
      "Keep your head held high!"
    ],
    "example": "A: I didn't get the internship I really wanted, I feel so defeated.\nB: I'm sorry to hear that, but keep your chin up! There are plenty of other opportunities.\nA: I know, but it felt like the perfect fit for my career path, no cap.\nB: Trust me, something even better will come along. Just stay focused and positive.\nA: I'll try. I guess I'll just keep applying to other companies for now.\nB: Facts. That's the only way to win anyway. Don't give up."
  },
  "expression_673": {
    "id": 673,
    "primary": "That's a wrap.",
    "meaning": "이제 다 끝났어요.",
    "similar": [
      "Everything is finished.",
      "We're done for the day/event.",
      "That concludes our work.",
      "All set and done!",
      "We've reached the end of the project."
    ],
    "example": "A: We've finally edited all the videos for the campaign! Phew.\nB: Awesome. That's a wrap for the whole team then. Well done everyone.\nA: Can we actually go home early today? I'm exhausted.\nB: For real. You all worked so hard this week, you definitely deserve a break.\nA: Let's celebrate with some drinks after we drop the files off.\nB: Facts. See everyone at the bar in an hour. Great job!"
  },
  "expression_674": {
    "id": 674,
    "primary": "Don't jump to conclusions.",
    "meaning": "성급하게 결론 내리지 마세요.",
    "similar": [
      "Wait for all the facts first.",
      "Avoid making assumptions prematurely.",
      "Patience is needed before deciding.",
      "Don't act on incomplete information.",
      "Check the details before you judge the situation."
    ],
    "example": "A: I saw him talking to a recruiter from the rival company earlier!\nB: Look, don't jump to conclusions. He might just be catchin' up with a friend.\nA: But why would he be meeting him at a coffee shop near their office?\nB: It could be anything. Let's just wait and see if he actually mentions it to us.\nA: You're right. I shouldn't automatically assume the worst, no cap.\nB: Facts. People's lives are more complicated than they look on the surface."
  },
  "expression_675": {
    "id": 675,
    "primary": "I'm all ears.",
    "meaning": "잘 듣고 있어요.",
    "similar": [
      "I'm listening intently.",
      "Tell me everything!",
      "You have my full attention.",
      "I'm curious to hear what you have to say.",
      "Direct your words to me, I'm ready."
    ],
    "example": "A: I have a crazy idea for the next marketing stunt, you're gonna love it.\nB: Alright, I'm all ears. What have you got for me this time?\nA: Imagine this: a literal flash mob in the middle of Times Square...\nB: Go on... I'm listening. How does the product fit into all this drama?\nA: Well, that's the best part. Each dancer will be wearing our new gear.\nB: Facts. That actually sounds pretty dope if we can pull it off."
  },
  "expression_676": {
    "id": 676,
    "primary": "It's written all over your face.",
    "meaning": "네 얼굴에 다 쓰여 있어.",
    "similar": [
      "Your expression reveals everything.",
      "I can easily see your true feelings.",
      "You're not hiding your emotions well at all.",
      "Your face tells the whole story.",
      "It's obvious how you're feeling just by looking at you."
    ],
    "example": "A: I'm really not that upset about the project being pushed back.\nB: Honestly? It's written all over your face. You're absolutely gutted.\nA: Is it that obvious? I thought I was doing a good job of staying calm.\nB: Not even close. You have that 'disappointed puppy' look going on, no cap.\nA: Well, I really did put a lot of effort into the initial design.\nB: Facts. It's totally understandable to be frustrated. Just take some time."
  },
  "expression_677": {
    "id": 677,
    "primary": "Better late than never.",
    "meaning": "늦더라도 안 하는 것보다 나아요.",
    "similar": [
      "Late is better than not at all.",
      "At least you finally did it!",
      "I'm glad you arrived eventually.",
      "It's good that it's finished now.",
      "Finally, success, even if it took a while."
    ],
    "example": "A: I finally finished my taxes for last year. I know I'm four months late...\nB: Hey, better late than never! At least you won't get any more penalties now.\nA: I was so stressed about it for months, I feel such a literal weight off my shoulders.\nB: For real. It's better to just get it done and move on with your life.\nA: I'm never waiting until the last minute ever again, I swear.\nB: Facts. That's what you said last year too, but good job anyway!"
  },
  "expression_678": {
    "id": 678,
    "primary": "The sky is the limit.",
    "meaning": "한계는 없어요.",
    "similar": [
      "There are no boundaries to your success.",
      "You can achieve anything you set your mind to.",
      "The potential is infinite.",
      "Potential for growth is everywhere.",
      "Nothing can stop you now!"
    ],
    "example": "A: With this new investment, we can actually expand to three new cities!\nB: For real. Honestly? The sky is the limit for this project now.\nA: I never thought we'd get this far when we started in your basement.\nB: Facts. It's all about that consistency and hard work finally paying off.\nA: Let's dream big for the next two years. Global domination, maybe?\nB: 100%. Let's get it! The world is our oyster now."
  },
  "expression_679": {
    "id": 679,
    "primary": "Practice makes perfect.",
    "meaning": "연습이 완벽을 만들어요.",
    "similar": [
      "Consistency leads to success.",
      "Keep working at it to master the skill.",
      "Improvement comes from repeated effort.",
      "Don't give up, keep practicing.",
      "Skill is built through dedicated time and effort."
    ],
    "example": "A: I still struggle with my pronunciation in English, especially the 'th' sound.\nB: Don't worry about it too much. Practice makes perfect, for real.\nA: I've been watching YouTube tutorials every single day for a week.\nB: That's the spirit. You're already making significant progress from when we first met.\nA: I hope so. I want to sound like a native New Yorker eventually, no cap.\nB: Facts. Just keep talking and you'll get there before you know it."
  }
}