{
  "expression_530": {
    "id": 530,
    "primary": "This is at the heart of the matter.",
    "meaning": "이것이 핵심이에요.",
    "similar": ["This is the core issue.", "This is the main point.", "This is fundamental.", "This is what everything centers around.", "This is the crux of the situation."],
    "example": "A: Why are we even talking about the office layout again?\nB: Look, efficiency is at the heart of the matter. We need to work better.\nA: I thought it was just about making the place look nicer.\nB: That's a side effect. The real goal is maximizing our output.\nA: I see. So the layout actually affects how we collaborate then.\nB: Facts. It's the foundation of everything we do here."
  },
  "expression_531": {
    "id": 531,
    "primary": "Who do you think I am?",
    "meaning": "나를 누구로 보는 거예요?",
    "similar": ["Don't underestimate me.", "You clearly don't know who you're dealing with.", "Do you really think I'd do that?", "Show some respect.", "You have no idea who I am."],
    "example": "A: Are you really gonna try to sneak into the club without an ID?\nB: Yo, who do you think I am? I've been doing this since I was eighteen.\nA: I'm just saying, the bouncer looks pretty intense tonight.\nB: Chill. I've got my ways. Just watch and learn.\nA: Alright, if you get kicked out, I'm not waiting for you.\nB: Don't even worry. I'll be at the bar before you're even through the line."
  },
  "expression_532": {
    "id": 532,
    "primary": "It spiraled out of control.",
    "meaning": "걷잡을 수 없이 악화됐어요.",
    "similar": ["It got out of hand.", "It escalated quickly.", "It became unmanageable.", "Things went downhill fast.", "It was total chaos."],
    "example": "A: It started as a small argument over who left the milk out.\nB: And then? How did the whole kitchen end up covered in flour?\nA: Honestly? It just spiraled out of control. Things were thrown, people were yelling...\nB: That sounds like a scene from a movie, for real.\nA: It was a nightmare. We're still cleaning up the mess.\nB: Facts. I think you guys need a serious roommate meeting soon."
  },
  "expression_533": {
    "id": 533,
    "primary": "It quickly went viral.",
    "meaning": "순식간에 입소문이 났어요.",
    "similar": ["It gained popularity fast.", "It was all over the internet.", "Everyone was sharing it.", "It blew up overnight.", "It became an instant trend."],
    "example": "A: Did you see that video of the cat playing the piano?\nB: Yeah! It quickly went viral this morning. My whole feed is full of it.\nA: It's so wholesome though. I've watched it like ten times already.\nB: For real. It's the kind of content we all need right now.\nA: Facts. I heard the owner is already getting talk show invites.\nB: That's wild. The internet is a crazy place for sure."
  },
  "expression_534": {
    "id": 534,
    "primary": "At the end of the day.",
    "meaning": "결국에는요.",
    "similar": ["Ultimately.", "The bottom line is.", "When all is said and done.", "In the final analysis.", "Basically."],
    "example": "A: We've been debating which color to paint the walls for three hours.\nB: Look, at the end of the day, it's just a wall. We just need to pick one.\nA: But the 'vibe' needs to be perfect for the brand!\nB: I get it, but we have bigger problems to solve right now.\nA: You're right. Let's just go with the light grey and move on.\nB: Facts. Decision made. Let's get some lunch."
  },
  "expression_535": {
    "id": 535,
    "primary": "He was full of beans.",
    "meaning": "에너지가 넘쳤어요.",
    "similar": ["He had so much energy.", "He was very lively.", "He was spirited.", "He couldn't sit still.", "He was buzzing with excitement."],
    "example": "A: How was the puppy's first day at the park?\nB: Oh man, he was full of beans! He ran around for three hours straight.\nA: I bet he's fast asleep now though.\nB: 100%. He's been snoring for the last two hours. It's adorable.\nA: That's the best part about high-energy dogs, they crash hard.\nB: Facts. I'm just glad he had a good time."
  },
  "expression_536": {
    "id": 536,
    "primary": "That is a tough nut to crack.",
    "meaning": "해결하기 어려운 문제예요.",
    "similar": ["That's a difficult problem.", "It's a challenge to solve.", "It's a complex situation.", "That's no easy task.", "It's a hard nut to crack."],
    "example": "A: We're still trying to figure out how to reduce our churn rate.\nB: Yeah, that is a tough nut to crack. Customers seem so fickle these days.\nA: We've tried discounts, better support, everything...\nB: Maybe it's not the service, but the actual product itself?\nA: That's a scary thought, but you might be right.\nB: Facts. It's time for some deep analysis."
  },
  "expression_537": {
    "id": 537,
    "primary": "We will chew the fat.",
    "meaning": "수다를 떨 거예요.",
    "similar": ["We'll have a long talk.", "We'll catch up properly.", "We'll chat for a while.", "Let's vent and talk.", "We'll gossip and share stories."],
    "example": "A: Are you coming over tonight for dinner?\nB: For sure! I haven't seen you in weeks, we really need to chew the fat.\nA: I've got so much to tell you about the new job.\nB: I bet! I've got some tea to share too. It's gonna be a long night.\nA: Perfect. I'll have the wine ready.\nB: Say less. I'm on my way."
  },
  "expression_538": {
    "id": 538,
    "primary": "Don't let your guard down.",
    "meaning": "방심하지 마세요.",
    "similar": ["Stay alert.", "Be vigilant.", "Don't get complacent.", "Keep your eyes open.", "Watch your step."],
    "example": "A: We're finally ahead in the fourth quarter!\nB: That's great, but don't let your guard down. They could still come back.\nA: True, their star player just got back on the court.\nB: Exactly. Keep the pressure on till the final buzzer sounds.\nA: Roger that. We're staying locked in.\nB: Facts. No room for mistakes now."
  },
  "expression_539": {
    "id": 539,
    "primary": "They promised the moon.",
    "meaning": "지키지 못할 약속을 했어요.",
    "similar": ["They made unrealistic promises.", "They claimed they could do everything.", "They overpromised.", "They offered the world with no way to deliver.", "They gave false hope."],
    "example": "A: The new agency says they can triple our traffic in one month.\nB: Look, they're promising the moon. No one can actually guarantee that.\nA: I know it sounds too good to be true, but what if they're legit?\nB: Trust me, I've heard this before. They just want the contract.\nA: I should probably ask for some case studies then.\nB: Smart move. Don't believe the hype without some proof."
  },
  "expression_540": {
    "id": 540,
    "primary": "He's on track.",
    "meaning": "잘하고 있어요.",
    "similar": ["He's making progress as expected.", "He's staying following the plan.", "He's doing well.", "He's on schedule.", "He's making good headway."],
    "example": "A: How is the new intern doing with his first project?\nB: Honestly? He's on track. He should be done by Friday.\nA: That's good to hear. I was worried the learning curve would be too much.\nB: He's a quick learner, for real. Very proactive too.\nA: Dope. I'll check in with him tomorrow morning.\nB: Sounds good. He's doing a solid job."
  },
  "expression_541": {
    "id": 541,
    "primary": "It's not as bad as it seems.",
    "meaning": "보기보다 나쁘지 않아요.",
    "similar": ["It's better than you think.", "It's manageable.", "Don't overreact, it's okay.", "The situation is salvageable.", "It's not a total disaster."],
    "example": "A: I accidentally formatted the wrong drive and lost all my notes!\nB: Chill, it's not as bad as it seems. We have most of that backed up to the cloud.\nA: Wait, really? Even the stuff from this morning?\nB: Yeah, the auto-sync actually saved your life. Check your account.\nA: Oh my god, you're right! Thank you! I was about to cry.\nB: See? Technology actually works sometimes."
  },
  "expression_542": {
    "id": 542,
    "primary": "Calm your nerves.",
    "meaning": "진정하세요.",
    "similar": ["Relax.", "Take a deep breath.", "Stay calm.", "Don't be so anxious.", "Chill out for a second."],
    "example": "A: I'm literally shaking right now. What if I mess up my line?\nB: Look, just calm your nerves. You've practiced this a hundred times.\nA: But the audience is so huge! And my parents are in the front row!\nB: Just focus on your breathing. You're gonna be amazing, trust me.\nA: Alright, I'm taking a big breath now. Okay, I can do this.\nB: That's the spirit. You're a pro."
  },
  "expression_543": {
    "id": 543,
    "primary": "It was a shot in the arm.",
    "meaning": "큰 활력소가 되었어요.",
    "similar": ["It was a much-needed boost.", "It provided significant encouragement.", "It was a stimulant for the situation.", "It gave us extra energy.", "It was a positive catalyst."],
    "example": "A: The team was really feeling down after that last loss.\nB: Yeah, but that new sponsorship was exactly the shot in the arm we needed.\nA: For real. Everyone is so motivated now.\nB: It's crazy how much of a difference some good news can make.\nA: Facts. We're ready to take on the next challenge with full energy.\nB: Let's get it."
  },
  "expression_544": {
    "id": 544,
    "primary": "That's the way the ball bounces.",
    "meaning": "세상일이 다 그렇죠.",
    "similar": ["That's life.", "It is what it is.", "Sometimes things just don't go your way.", "No use complaining.", "That's the situation now."],
    "example": "A: I was so sure I was gonna win that raffle, but I didn't even place.\nB: Well, that's just the way the ball bounces sometimes. Better luck next time.\nA: I guess I'll just have to keep trying my luck with other stuff.\nB: For real. You can't win them all, right?\nA: Facts. It was just a fun little thing anyway.\nB: Exactly. Keep that positive attitude going."
  },
  "expression_545": {
    "id": 545,
    "primary": "It's a no-brainer.",
    "meaning": "생각할 필요도 없는 쉬운 결정이죠.",
    "similar": ["It's an easy choice.", "It's obvious.", "No need to hesitate.", "The decision is clear.", "It's the most logical option."],
    "example": "A: They're offering me a fifty percent raise to move to their new office.\nB: Honestly? It's a no-brainer. You should definitely take it.\nA: But I'll have to commute for an extra thirty minutes every day.\nB: For fifty percent more cash? 100% worth it. No cap.\nA: You're right. I'm signing the offer letter right now.\nB: Facts. That's a life-changing move."
  },
  "expression_546": {
    "id": 546,
    "primary": "He was not pulling his weight.",
    "meaning": "제 몫을 다하지 않았어요.",
    "similar": ["He was being lazy.", "He wasn't contributing enough.", "He was slacking off.", "He was a burden on the team.", "He wasn't doing his fair share."],
    "example": "A: Why did you decide to let the lead designer go?\nB: Honestly? He was not pulling his weight and the rest of the team was frustrated.\nA: I noticed some of the projects were falling behind lately.\nB: Exactly. Everyone else was working overtime while he was just chilling.\nA: That's not fair to anyone. It's better to have a smaller, more dedicated team.\nB: Facts. We're already seeing better results without the dead weight."
  },
  "expression_547": {
    "id": 547,
    "primary": "I don't buy it.",
    "meaning": "안 믿어요.",
    "similar": ["I don't believe you.", "I'm skeptical.", "That sounds fake to me.", "I'm not convinced.", "I'm calling cap on that."],
    "example": "A: He says he missed the meeting because his alarm clock literally exploded.\nB: Honestly? I don't buy it. That sounds like a complete lie.\nA: It's a pretty creative excuse though, you gotta admit.\nB: Creative, yeah, but definitely not true. He just overslept again.\nA: I should probably just give him a formal warning then.\nB: Facts. Consistency matters in this office."
  },
  "expression_548": {
    "id": 548,
    "primary": "I got all dolled up.",
    "meaning": "한껏 멋을 부렸어요.",
    "similar": ["I dressed up nicely.", "I'm looking glamorous.", "I put in effort for my outfit.", "I'm all decked out.", "I'm ready for the red carpet."],
    "example": "A: Wow! You look amazing today! Where are you going?\nB: Thanks! I got all dolled up for that awards ceremony tonight.\nA: You're definitely gonna be the star of the show.\nB: Haha, I appreciate that! I even did my hair and makeup myself.\nA: Teach me your ways! Seriously, you look like a whole different person.\nB: It's all about the confidence and some secret lipstick tricks."
  },
  "expression_549": {
    "id": 549,
    "primary": "Put your feet up.",
    "meaning": "편히 쉬세요.",
    "similar": ["Relax.", "Take a break.", "Take a load off.", "Sit back and chill.", "Slow down and rest."],
    "example": "A: You've been on your feet for eight hours. Come over here.\nB: Thanks. I'm honestly so exhausted I could fall asleep right here.\nA: Just put your feet up and I'll bring you some water.\nB: You're too kind. I really need to stay off my feet for a bit.\nA: Take as long as you need. You've earned this break.\nB: I appreciate the support, for real."
  },
  "expression_550": {
    "id": 550,
    "primary": "Easy does it.",
    "meaning": "조심해서 천천히 하세요.",
    "similar": ["Be careful.", "Do it gently.", "Take it slow.", "No rush.", "Proceed with caution."],
    "example": "A: I'm trying to move this huge glass table into the hallway.\nB: Easy does it! Don't tilt it too much or it might crack.\nA: I've got it, I've got it. Just need to go around this corner.\nB: Slowly! There you go. Perfect. Now let's set it down gently.\nA: Phew, that was intense. I was so worried about breaking it.\nB: Facts. Better safe than sorry when it comes to glass."
  },
  "expression_551": {
    "id": 551,
    "primary": "I had a falling out with him.",
    "meaning": "그와 다퉜어요.",
    "similar": ["We had a disagreement.", "We're no longer friends.", "We had a big argument.", "We've stopped speaking to each other.", "Our relationship turned sour."],
    "example": "A: How is your best friend doing? I haven't seen him around lately.\nB: Honestly? I had a falling out with him last month. We haven't talked since.\nA: Oh no! I'm so sorry to hear that. I thought you guys were inseparable.\nB: Yeah, me too, but some things just can't be easily fixed.\nA: I feel you. If you ever wanna talk about it, I'm here.\nB: Thanks. I appreciate the support, for real."
  },
  "expression_552": {
    "id": 552,
    "primary": "It's not rocket science.",
    "meaning": "그렇게 어려운 일이 아니에요.",
    "similar": ["It's simple.", "It's not complicated at all.", "Anyone can do it.", "It's quite straightforward.", "Don't overthink it, it's easy."],
    "example": "A: I'm struggling to set up this new coffee machine. There are so many buttons!\nB: Chill out. It's not rocket science. Just press the 'brew' button after adding water.\nA: But what about all these other settings? 'Aroma', 'Strength'...\nB: Just ignore those for now. Start with the basics and you'll be fine.\nA: Alright, alright. I'm overthinking it as usual.\nB: Facts. Just focus on your morning cup of joe."
  },
  "expression_553": {
    "id": 553,
    "primary": "We all have to pick up the slack.",
    "meaning": "부족한 부분을 보충해야 해요.",
    "similar": ["We need to compensate for the missing effort.", "Everyone needs to help out more.", "Contribute extra when others can't.", "Compensate for someone else's deficiency.", "Tackle the overflow work."],
    "example": "A: Since two developers left unexpectedly, things have been crazy.\nB: I know. We all have to pick up the slack until new hires are on board.\nA: I'm already taking on three extra projects myself.\nB: For real. It's not ideal, but it's what's needed right now.\nA: Hopefully they find some good replacements soon.\nB: Facts. We can't keep this pace up forever."
  },
  "expression_554": {
    "id": 554,
    "primary": "I threw caution to the wind.",
    "meaning": "위험을 무릅쓰고 감행했어요.",
    "similar": ["I took a big risk.", "I acted impulsively.", "I was reckless.", "I ignored all warnings.", "I just went for it without worrying about the consequences."],
    "example": "A: You actually booked a flight to Bali without checking your bank account?\nB: Yeah! I just threw caution to the wind and went for it. YOLO!\nA: That's either incredibly brave or very bold of you.\nB: A bit of both, I guess. I just really needed a break from reality.\nA: I feel you. Sometimes you just gotta take the leap, right?\nB: Facts. I'll figure out the money situation later. For now, it's island time."
  },
  "expression_555": {
    "id": 555,
    "primary": "Beauty is only skin deep.",
    "meaning": "외모는 겉모습일 뿐이에요.",
    "similar": ["Personality matters more than looks.", "Outer appearance can be deceiving.", "True value is internal.", "Character is what truly counts.", "Don't judge a book by its cover."],
    "example": "A: He's so attractive! But honestly, he's kind of rude to everyone.\nB: See? Beauty is only skin deep. You gotta find someone with a good heart.\nA: I know, I know. I just wish he was nicer.\nB: For real. Aesthetic only takes you so far in a real relationship.\nA: Facts. I'm definitely looking for something more substantial now.\nB: Exactly. Personality is the real winner."
  },
  "expression_556": {
    "id": 556,
    "primary": "I'm not good with words.",
    "meaning": "말주변이 없어요.",
    "similar": ["I struggle to express myself.", "I'm not a smooth talker.", "I find it hard to say what I mean.", "I'm a bit shy in conversations.", "Communication isn't my strongest skill."],
    "example": "A: You should tell her how you really feel. Be romantic!\nB: Honestly? I'm not good with words. I always get tongues-tied around her.\nA: Try writing her a letter instead. It's more thoughtful and less pressure.\nB: That's a good idea. I can take my time and say exactly what I mean.\nA: Exactly. Just be sincere and she'll love it.\nB: Thanks for the advice. I'll get started on that tonight."
  },
  "expression_557": {
    "id": 557,
    "primary": "I'm running on fumes.",
    "meaning": "기운이 하나도 없어요.",
    "similar": ["I'm at the end of my energy.", "I'm incredibly tired.", "I'm barely hanging on.", "I'm exhausted.", "I have no more stamina."],
    "example": "A: Do you wanna grab a late-night snack after this shift?\nB: Honestly? I'm running on fumes. I just want to go home and sleep.\nA: I feel you. It's been a long day for both of us.\nB: For real. I've been awake for like eighteen hours. My brain is fried.\nA: Get some rest then! We'll catch up tomorrow when you're human again.\nB: Facts. See you later."
  },
  "expression_558": {
    "id": 558,
    "primary": "I call the shots.",
    "meaning": "내가 결정권을 갖고 있어요.",
    "similar": ["I'm in charge here.", "I make the final decision.", "I'm the boss.", "Everything goes through me.", "I have the last word."],
    "example": "A: Should we ask the team which direction we should go for the project?\nB: Look, I call the shots around here. We're going with my plan.\nA: I just thought some extra input would be helpful.\nB: I appreciate that, but I have the most experience and I'm leading this.\nA: Alright, if that's how it's gonna be. I'll just follow the lead.\nB: Smart move. Let's stay focused and execute."
  },
  "expression_559": {
    "id": 559,
    "primary": "I have butterflies in my stomach.",
    "meaning": "너무 긴장돼요.",
    "similar": ["I'm very nervous.", "I'm feeling anxious.", "I have that nervous fluttering feeling.", "I'm slightly terrified but excited.", "I'm feeling jumpy."],
    "example": "A: You're about to go out on stage in front of five thousand people!\nB: I know! I have serious butterflies in my stomach right now.\nA: Just take a deep breath and remember why you're here.\nB: I'm trying! But my hands are literally shaking. This is insane.\nA: You've got this. Once you get out there, the nerves will fade away.\nB: Thanks. I'm going for it. See you on the other side!"
  },
  "expression_560": {
    "id": 560,
    "primary": "You've been left on read.",
    "meaning": "읽씹 당했네요.",
    "similar": ["They saw your message and didn't reply.", "Ghosted via text.", "Ignored after reading.", "Message read but no response.", "Stuck on seen."],
    "example": "A: It's been six hours and he still hasn't replied to my text.\nB: Ouch. Looks like you've been left on read, my friend.\nA: But he was just active on Instagram two minutes ago!\nB: That's a classic sign. Honestly? Just let it go for now.\nA: I hate that feeling so much. It's so awkward.\nB: Facts. Don't double text. Just wait and see if he eventually reaches out."
  },
  "expression_561": {
    "id": 561,
    "primary": "She doted on me.",
    "meaning": "나를 애지중지했어요.",
    "similar": ["She spoiled me with affection.", "She adored me.", "She showered me with love.", "She was overly fond of me.", "She really took great care of me."],
    "example": "A: It's so nice to see how much your grandma loves you.\nB: Yeah, she always doted on me when I was growing up. I was her favorite.\nA: I can tell! She always has your favorite cookies ready when we visit.\nB: For real. She's the best. I try to visit her as often as I can.\nA: That's sweet. Family connections like that are precious.\nB: Facts. I really appreciate everything she's done for me."
  },
  "expression_562": {
    "id": 562,
    "primary": "I made it from scratch.",
    "meaning": "맨 처음부터 직접 만들었어요.",
    "similar": ["I created it entirely by myself.", "It's handmade/home-made.", "I didn't use any shortcuts.", "I built it from zero.", "It's an original creation."],
    "example": "A: This pasta sauce is incredible! Where did you get the recipe?\nB: Honestly? I made it from scratch using tomatoes from my own garden.\nA: No way! This tastes like it's from a high-end restaurant.\nB: Thanks! It takes a while to simmer everything down, but it's totally worth it.\nA: You should definitely start selling this. People would love it.\nB: Maybe one day! For now, it's just for friends."
  },
  "expression_563": {
    "id": 563,
    "primary": "Don't steal my thunder.",
    "meaning": "내 공을 가로채지 마세요.",
    "similar": ["Don't take credit for my work.", "Don't overshadow me.", "Stop taking the spotlight for yourself.", "Let me have my moment.", "Don't ruin my big reveal."],
    "example": "A: I was just about to tell everyone about the new partnership...\nB: But I already posted it on the company Slack channel this morning!\nA: Yo! Don't steal my thunder like that! I wanted to announce it officially.\nB: My bad! I thought you wanted it out as soon as possible.\nA: I did, but I also wanted to share the credit with the team during the meeting.\nB: I see. I'm sorry. I'll let you handle the rest of the updates then."
  },
  "expression_564": {
    "id": 564,
    "primary": "He clammed up.",
    "meaning": "입을 꾹 다물었어요.",
    "similar": ["He stopped talking entirely.", "He became silent.", "He refused to speak.", "He shut down in conversation.", "He was speechless."],
    "example": "A: Did you ask him about the missing files yet?\nB: Yeah, but as soon as I mentioned the budget, he just clammed up.\nA: That's suspicious. He's usually so talkative about everything else.\nB: For real. It's like he's hiding something he doesn't want me to find.\nA: I should probably have a more formal chat with him tomorrow.\nB: Good luck with that. He's acting very strange lately."
  },
  "expression_565": {
    "id": 565,
    "primary": "I would go on a spending spree.",
    "meaning": "돈을 펑펑 쓰고 싶어요.",
    "similar": ["I'd shop until I drop.", "I'd spend all my money at once.", "I'd indulge in excessive shopping.", "I'd buy everything I want.", "I'd blow all my cash on fun things."],
    "example": "A: If I won the lottery today, the first thing I'd do is hire a financial advisor.\nB: Not me! I would go on a huge spending spree at all the luxury stores in SoHo.\nA: Aren't you worried about running out of money eventually?\nB: Not with a hundred million dollars! I'd have plenty to spare.\nA: Facts, but I'd still be nervous about losing it all overnight.\nB: Live a bit! Life is too short for all that worry."
  },
  "expression_566": {
    "id": 566,
    "primary": "I don't want to open up a can of worms.",
    "meaning": "문제를 복잡하게 만들고 싶지 않아요.",
    "similar": ["I don't want to cause more problems.", "Let's not get into a complicated situation.", "Avoiding unnecessary drama.", "I'd rather not start something complex.", "Keep the peace by not mentioning it."],
    "example": "A: Should we mention the unresolved issue from last month during the meeting?\nB: Honestly? I don't want to open up a can of worms right now. Let's focus on today's tasks.\nA: I agree, it might derail the whole conversation for hours.\nB: Exactly. We have enough on our plate without more drama.\nA: We'll bring it up in a separate session then.\nB: Facts. Better to handle it when we have more time to properly deal with it."
  },
  "expression_567": {
    "id": 567,
    "primary": "It's my treat.",
    "meaning": "제가 낼게요.",
    "similar": ["I'm paying.", "The bill is on me.", "I'll handle the check.", "No, let me pay for this.", "It's my shout."],
    "example": "A: This dinner was incredible! Let's split it fifty-fifty.\nB: No way, don't worry about it. It's my treat today since you helped me with my project.\nA: Are you sure? That was a really expensive meal though.\nB: 100%. I really appreciate all your support lately. It means a lot.\nA: Thank you so much! I'll get the next round for sure then.\nB: Say less. It was my pleasure!"
  },
  "expression_568": {
    "id": 568,
    "primary": "Snap out of it!",
    "meaning": "정신 차려!",
    "similar": ["Wake up!", "Get focused again!", "Come back to reality!", "Stop spacing out!", "Get your head in the game!"],
    "example": "A: I was just imagining what it would be like to live on Mars for a year...\nB: Yo! Snap out of it! We have a deadline in thirty minutes and you haven't even started.\nA: My bad! I got lost in my own thoughts for a second.\nB: Clearly! Let's focus on the actual work before the boss gets mad.\nA: On it. I'm locked in now, I promise.\nB: That's what I like to hear. Let's get it done."
  },
  "expression_569": {
    "id": 569,
    "primary": "You got us into this mess.",
    "meaning": "당신 때문에 이 지경이 됐어요.",
    "similar": ["It's your fault we're in this situation.", "You caused this problem.", "This is all because of you.", "You led us into this trouble.", "We're here because of your decision."],
    "example": "A: Why are we stuck in the middle of a traffic jam in Brooklyn at midnight?\nB: Look, you're the one who thought this shortcut was a 'game changer'! \nA: I didn't know there was literally going to be construction on every single block!\nB: Well, you got us into this mess, so now we're just gonna have to wait it out.\nA: I'm sorry, okay? I was just trying to save us some time.\nB: Next time, let's just use the regular GPS and stay on the main road."
  },
  "expression_570": {
    "id": 570,
    "primary": "It's not what it looks like.",
    "meaning": "오해하지 마세요.",
    "similar": ["You're misinterpreting the situation.", "Let me explain the truth.", "It's not as it appears.", "There's a logical explanation for this.", "Don't jump to conclusions."],
    "example": "A: Why were you at the office at 3 AM with all the lights off?\nB: Honestly? It's not what it looks like. I just forgot my keys and didn't want to bother anyone.\nA: That sounds incredibly suspicious, don't you think?\nB: I know! I was literally crawling through the window when security saw me.\nA: Wow, that's intense. I'm just glad you didn't get arrested.\nB: Facts. I'm definitely not doing that again."
  },
  "expression_571": {
    "id": 571,
    "primary": "I owe you one.",
    "meaning": "신세 한번 졌네요.",
    "similar": ["I appreciate your help.", "I'll make it up to you.", "You did me a huge favor.", "I'm in your debt.", "Thank you, I'll return the favor soon."],
    "example": "A: Thanks again for lending me your laptop while mine was in the shop.\nB: Any time! I'm glad it helped you finish your final project.\nA: For real, I owe you one. Let me buy you lunch this weekend.\nB: You really don't have to, but I won't say no to some free pizza!\nA: Say less. I'll hit you up on Saturday then.\nB: Sounds like a plan. Catch you later!"
  },
  "expression_572": {
    "id": 572,
    "primary": "I got the short straw.",
    "meaning": "재수 없게 제가 걸렸어요.",
    "similar": ["I was chosen for the worst task.", "I got unlucky.", "I ended up with the responsibility no one wanted.", "Fate wasn't on my side this time.", "I'm stuck with the undesirable duty."],
    "example": "A: Why are you cleaning the coffee machine on a Friday afternoon?\nB: Ugh, I got the short straw during the team meeting today. Everyone else escaped.\nA: That's rough! It always seems to be you, doesn't it?\nB: For real. I think they're secretly out to get me at this point.\nA: I'll help you finish it so you can leave earlier too.\nB: You're a legend! I really appreciate that, for real."
  },
  "expression_573": {
    "id": 573,
    "primary": "She truly is the GOAT.",
    "meaning": "그녀는 정말 최고예요.",
    "similar": ["She's the greatest of all time.", "She's unmatched in her field.", "She's an absolute legend.", "She's at the top of her game.", "She's a total icon."],
    "example": "A: Did you see Beyonce's performance last night? It was insane!\nB: 100%. She truly is the GOAT. No one else even comes close.\nA: The production, the vocals, the energy... it was just a whole different level.\nB: Facts. She's been consistent for decades now. It's pure dedication.\nA: I want to be like her when I grow up. Not even joking.\nB: We all do. She's a true inspiration to everyone."
  },
  "expression_574": {
    "id": 574,
    "primary": "I've got a lot of mixed emotions.",
    "meaning": "만감이 교차하네요.",
    "similar": ["I'm feeling many things at once.", "I have conflicting feelings.", "I'm not exactly sure how to feel.", "It's a complicated emotional situation.", "I'm feeling bittersweet."],
    "example": "A: How do you feel about moving to a whole new city for the first time?\nB: Honestly? I've got a lot of mixed emotions. Excitement, but also a lot of fear.\nA: That's totally normal! It's a huge life change for you.\nB: For real. I'm gonna miss all my friends here, but the new opportunity is dope.\nA: Just take it one step at a time. You'll settle in before you know it.\nB: Thanks. I'm trying to stay positive and focused on the future."
  },
  "expression_575": {
    "id": 575,
    "primary": "I've seen worse.",
    "meaning": "이것보다 더 심한 것도 봤어요.",
    "similar": ["This isn't as bad as it could be.", "I've encountered worse situations before.", "It's manageable compared to my past experiences.", "It's not the end of the world.", "I've dealt with more difficult things."],
    "example": "A: Look at the state of this office after the party! It's a disaster!\nB: Chill out. I've seen worse. At least there's no permanent damage.\nA: You call this manageable? There's literally glitter on every single surface!\nB: It'll take a few hours to clean up, but it's not the worst thing I've ever seen.\nA: You should've seen my college dorm after finals week then.\nB: Facts. This is basically a nursery school compared to that chaos."
  },
  "expression_576": {
    "id": 576,
    "primary": "The tea tastes funny.",
    "meaning": "차 맛이 이상해요.",
    "similar": ["The tea tastes unusual.", "Something is off about this tea.", "This tea has a strange flavor.", "I'm not liking the taste of this tea.", "Is this tea expired or something?"],
    "example": "A: You didn't finish your matcha latte. Is everything okay with it?\nB: Honestly? The tea tastes funny. It's almost... metallic?\nA: Oh no! Maybe the milk was off or the water wasn't filtered correctly.\nB: For real. It's definitely not the usual quality I expect from this place.\nA: I'll go ask them to remake it for you. You shouldn't have to drink that.\nB: Thanks, I appreciate it. I was just gonna leave it but it's so expensive!"
  },
  "expression_577": {
    "id": 577,
    "primary": "That's a steal.",
    "meaning": "거저나 다름없네요.",
    "similar": ["That's an incredible deal.", "It's very cheap for the value.", "What an amazing price!", "I'm essentially getting it for free.", "That's a total bargain."],
    "example": "A: Look at these vintage boots I found for only twenty bucks!\nB: No way! They look like they're worth at least two hundred. That's a steal.\nA: I know! I saw them in the back of the store and couldn't believe the price tag.\nB: You definitely scored big time today. Those are gonna look dope with your outfit.\nA: Facts. Thrifting is honestly my favorite thing to do on weekends.\nB: Same. Nothing beats that feeling of finding a diamond in the rough."
  },
  "expression_578": {
    "id": 578,
    "primary": "Now is the time to decide.",
    "meaning": "지금이 결정할 때예요.",
    "similar": ["Decision time is now.", "We can't wait any longer to choose.", "Finalize your choice immediately.", "The deadline for deciding has arrived.", "Make up your mind now."],
    "example": "A: I'm still not sure which summer internship I should take.\nB: Look, now is the time to decide. Both offers expire by the end of today.\nA: I know, both are so good but for different reasons!\nB: Just go with your gut feeling. Which one makes you feel more excited about the work?\nA: Honestly? The creative agency one. I'm just worried about the pay.\nB: Facts, but the experience might lead to something way bigger later. Just do it!"
  },
  "expression_579": {
    "id": 579,
    "primary": "I just winged it.",
    "meaning": "그냥 즉흥적으로 했어요.",
    "similar": ["I improvised without a plan.", "I didn't prepare at all.", "I just went for it spontaneously.", "I made it up as I went along.", "No planning involved, I just did it."],
    "example": "A: Your presentation today was so smooth! How long did you spend practicing?\nB: Honestly? I didn't prepare at all. I just winged it based on what I remembered from the meeting.\nA: Wow! You're a natural at public speaking then. I would've been a mess.\nB: Thanks! I just try to stay calm and speak from the heart, you know?\nA: I wish I had that kind of confidence. I literally have to write everything down.\nB: Facts. Whatever works for you though, everyone has their own style."
  }
}
