{
  "expression_380": {
    "id": 380,
    "primary": "I put my family first.",
    "meaning": "나는 가족을 최우선으로 생각해요.",
    "similar": ["Family is my top priority.", "I'm all about my fam.", "My family comes before everything.", "Day one is always family.", "I prioritize my kin."],
    "example": "A: Yo, you still coming through to the party tonight?\nB: Nah, I gotta stay in. My sister's visiting and I put my family first.\nA: Respect. I didn't know the fam was in town.\nB: Yeah, we don't get to see each other much, so it's a must.\nA: For sure. Family always comes first no matter what.\nB: Facts. Catch you later this week though?"
  },
  "expression_381": {
    "id": 381,
    "primary": "I could get the most out of it.",
    "meaning": "그것을 최대한 활용할 수 있었어요.",
    "similar": ["I maximized the benefits.", "I squeezed every drop out of it.", "I made the most of the situation.", "I really capitalized on it.", "I utilized it to the fullest."],
    "example": "A: How was that internship you did over the summer?\nB: It was solid. I really felt like I could get the most out of it.\nA: That's dope. Did you get to work on any big projects?\nB: Yeah, they let me lead a small team. It was a huge learning curve.\nA: I'm glad you didn't let that opportunity go to waste.\nB: No way. I was definitely trying to level up."
  },
  "expression_382": {
    "id": 382,
    "primary": "Sometimes we don't see eye to eye.",
    "meaning": "가끔 우리는 의견이 맞지 않아요.",
    "similar": ["We have our differences.", "We don't always agree.", "We're not on the same page sometimes.", "Our views clash occasionally.", "We bump heads every now and then."],
    "example": "A: You and your roommate still good?\nB: Yeah, we're fine, but sometimes we don't see eye to eye on the chores.\nA: I feel you. Living with people is a constant adjustment.\nB: For real. He thinks the dishes can wait, and I'm like 'nope'.\nA: As long as you guys can talk it out, it's whatever.\nB: Facts. We just gotta find that middle ground."
  },
  "expression_383": {
    "id": 383,
    "primary": "If everything goes according to plan.",
    "meaning": "모든 게 계획대로 된다면요.",
    "similar": ["If all goes well.", "With any luck.", "If things pan out as expected.", "Assuming the plan sticks.", "If we stay on track."],
    "example": "A: When are you officially moving into the new spot?\nB: If everything goes according to plan, I'll be there by Friday.\nA: That's a quick turnaround. You all packed yet?\nB: Almost. Just a few more boxes and I'm good to go.\nA: Dope. Let me know if you need a hand with the heavy lifting.\nB: Shot. I'll definitely hit you up."
  },
  "expression_384": {
    "id": 384,
    "primary": "You're more than welcome to stay.",
    "meaning": "얼마든지 더 머물다 가셔도 돼요.",
    "similar": ["Feel free to hang back.", "We'd love to have you stay.", "Don't feel rushed to leave.", "The door's always open for you.", "Mi casa es su casa."],
    "example": "A: It's getting late. I should probably head out.\nB: Honestly, you're more than welcome to stay if you don't wanna drive.\nA: You sure? I don't wanna overstay my welcome.\nB: Not at all. We've got extra space, so it's chill.\nA: I really appreciate that. I am pretty beat.\nB: Say less. I'll grab some extra blankets for you."
  },
  "expression_385": {
    "id": 385,
    "primary": "It will do the trick.",
    "meaning": "그거면 충분할 거예요.",
    "similar": ["That'll work.", "That'll get the job done.", "It's good enough.", "That should solve it.", "That'll suffice."],
    "example": "A: Do you think this duct tape is enough for the leak?\nB: Yeah, it will do the trick until the plumber gets here.\nA: Hope so. I don't want the kitchen floor to turn into a pool.\nB: It's just a temporary fix, so don't stress too much.\nA: True. I'll keep an eye on it just in case.\nB: Smart move. Let's just pray it holds."
  },
  "expression_386": {
    "id": 386,
    "primary": "Once you get the hang of it, it's pretty easy.",
    "meaning": "일단 요령을 터득하면 꽤 쉬워요.",
    "similar": ["Once you catch on, it's a breeze.", "It's simple once you find your rhythm.", "You'll get it down in no time.", "It's all about that learning curve.", "After some practice, it's effortless."],
    "example": "A: This editing software is so confusing, I'm about to quit.\nB: Chill. Once you get the hang of it, it's pretty easy.\nA: Easy for you to say. You've been doing this for years.\nB: Trust me, it was a struggle for me at first too.\nA: Alright, show me that shortcut again.\nB: See? Once it clicks, you'll be flying through these edits."
  },
  "expression_387": {
    "id": 387,
    "primary": "As far as that is concerned.",
    "meaning": "그 점에 관해서라면요.",
    "similar": ["In regards to that.", "Regarding that matter.", "When it comes to that.", "Speaking of which.", "As for that part."],
    "example": "A: Are we still worried about the budget for the event?\nB: As far as that is concerned, we're actually in the clear.\nA: Oh word? Did we get that extra sponsorship?\nB: Yeah, they confirmed this morning. We've got more than enough.\nA: That's a huge weight off my shoulders.\nB: Definitely. Now we can finally focus on the actual content."
  },
  "expression_388": {
    "id": 388,
    "primary": "I leaned on him.",
    "meaning": "나는 그에게 의지했어요.",
    "similar": ["I relied on him.", "He was my support system.", "I counted on him.", "He was my rock.", "I turned to him for help."],
    "example": "A: How did you get through that rough patch last year?\nB: Honestly, I leaned on him a lot. He was always there.\nA: It's good to have someone like that in your corner.\nB: Facts. I don't think I could've handled it alone.\nA: He's a real one for sure.\nB: 100%. I'm forever grateful for his support."
  },
  "expression_389": {
    "id": 389,
    "primary": "I'll take a rain check.",
    "meaning": "다음 기회에 할게요.",
    "similar": ["Maybe next time.", "Let's postpone.", "Can we do it later?", "I'll pass for now.", "Let's reschedule."],
    "example": "A: Hey, we're all grabbing drinks after work. You in?\nB: I'd love to, but I'm swamped. I'll take a rain check.\nA: No worries. We'll definitely do it again soon.\nB: For sure. Have a round for me though.\nA: You got it. Don't work too hard!\nB: I'll try not to. Catch you tomorrow."
  },
  "expression_390": {
    "id": 390,
    "primary": "How did your summer project go?",
    "meaning": "여름 프로젝트는 어떻게 됐나요?",
    "similar": ["How was the summer project?", "Did the summer project turn out well?", "How'd the project go over the summer?", "What's the status of your summer project?", "How did that summer thing end up?"],
    "example": "A: Long time no see! How did your summer project go?\nB: It went surprisingly well. We actually finished ahead of schedule.\nA: That's impressive. What was the main focus again?\nB: We were building a community garden in Brooklyn.\nA: Dope. I'd love to come check it out sometime.\nB: Definitely. It's looking really good now."
  },
  "expression_391": {
    "id": 391,
    "primary": "I ended up becoming an English teacher.",
    "meaning": "결국 영어 선생님이 되었어요.",
    "similar": ["I turned out to be an English teacher.", "I eventually became an English teacher.", "Fate led me to teaching English.", "I landed a job as an English teacher.", "I found my path as an English teacher."],
    "example": "A: I didn't know you studied literature in college!\nB: Yeah, and after a few odd jobs, I ended up becoming an English teacher.\nA: That's awesome. Do you enjoy working with the kids?\nB: Most of the time, yeah. It's definitely rewarding.\nA: I bet. You always were good at explaining things.\nB: Thanks. It feels like where I'm supposed to be."
  },
  "expression_392": {
    "id": 392,
    "primary": "I'll take over.",
    "meaning": "내가 인계받을게요.",
    "similar": ["I'll handle it from here.", "I'll take the lead now.", "I'll assume responsibility.", "I'll step in.", "I'll take the reins."],
    "example": "A: I'm really struggling to keep up with these emails.\nB: Don't worry about it. I'll take over for the rest of the day.\nA: Are you sure? You've got your own stuff to do.\nB: I'm caught up on my work, so it's no biggie.\nA: You're a lifesaver. I really need a break.\nB: Take fifteen. I've got this under control."
  },
  "expression_393": {
    "id": 393,
    "primary": "It works for me.",
    "meaning": "저한테는 괜찮아요 (시간/방법 등).",
    "similar": ["That works for me.", "I'm cool with that.", "That fits my schedule.", "That's fine by me.", "Sounds good to me."],
    "example": "A: Can we move our meeting to 3 PM instead of 1?\nB: Yeah, it works for me. I've got a gap then.\nA: Great. I'll update the calendar invite right now.\nB: Perfect. Should we meet in the usual conference room?\nA: Yeah, let's do that. See you then!\nB: Sounds like a plan. Catch you later."
  },
  "expression_394": {
    "id": 394,
    "primary": "I'll take one for the team.",
    "meaning": "팀을 위해 내가 희생할게요.",
    "similar": ["I'll make the sacrifice.", "I'll step up for the group.", "I'll do it for the squad.", "I'll bear the brunt for us.", "I'll take the hit."],
    "example": "A: Someone needs to stay late and finish this report.\nB: Honestly, I'll take one for the team and do it. Everyone else has plans.\nA: You're a legend. We'll definitely make it up to you.\nB: It's whatever. I didn't have much going on tonight anyway.\nA: We'll buy you lunch tomorrow for sure.\nB: Say less. I'm holding you to that!"
  },
  "expression_395": {
    "id": 395,
    "primary": "I'll keep you posted on that.",
    "meaning": "계속 상황을 알려줄게요.",
    "similar": ["I'll keep you updated.", "I'll let you know what happens.", "I'll stay in touch about it.", "I'll give you the lowdown later.", "I'll keep you in the loop."],
    "example": "A: Any news on the job interview yet?\nB: Not yet, but I'll keep you posted on that as soon as I hear back.\nA: Fingers crossed for you! You definitely deserve it.\nB: Thanks, fam. I'm trying not to overthink it.\nA: Just keep doing your thing. The right offer will come.\nB: Facts. I'll hit you up as soon as the phone rings."
  },
  "expression_396": {
    "id": 396,
    "primary": "That's close enough.",
    "meaning": "그 정도면 충분해요 (거의 비슷해요).",
    "similar": ["That'll do.", "It's near enough.", "Good enough.", "Close enough for me.", "It's within the ballpark."],
    "example": "A: I tried to match the paint, but it's a tiny bit darker.\nB: Honestly? That's close enough. No one's gonna notice.\nA: You sure? It's bothering me a little bit.\nB: Trust me, once the furniture is back, it'll blend right in.\nA: Alright, if you say so. I'm done for today then.\nB: Facts. Let's just grab some pizza and call it a win."
  },
  "expression_397": {
    "id": 397,
    "primary": "It's worth doing the right thing.",
    "meaning": "옳은 일을 할 가치가 있어요.",
    "similar": ["Doing the right thing matters.", "Integrity is worth it.", "It's important to be ethical.", "The right path is always the best path.", "Character is everything."],
    "example": "A: I could've just kept the extra change the cashier gave me.\nB: But you gave it back. It's worth doing the right thing, you know?\nA: Yeah, I would've felt guilty if I didn't.\nB: Exactly. Good karma always comes back around.\nA: For sure. I feel much better now.\nB: That's the spirit. Integrity is key."
  },
  "expression_398": {
    "id": 398,
    "primary": "I'll take that as a compliment.",
    "meaning": "칭찬으로 받아들일게요.",
    "similar": ["I'll take that as a win.", "I'll assume you meant that nicely.", "Thanks, I'll take it.", "I appreciate the kind words.", "I'll take that to heart."],
    "example": "A: You're so stubborn when it comes to your art.\nB: Haha, I'll take that as a compliment. I'm just passionate.\nA: I meant it in a good way, actually. Your focus is crazy.\nB: Thanks. I really try to be intentional with everything I create.\nA: It definitely shows in the final product.\nB: I appreciate that. Means a lot coming from you."
  },
  "expression_399": {
    "id": 399,
    "primary": "I'll get right on it.",
    "meaning": "당장 시작할게요.",
    "similar": ["I'll start immediately.", "I'm on it.", "I'll jump on it right now.", "I'll tackle it ASAP.", "I'll handle it straight away."],
    "example": "A: Can you fix that typo on the website before the client sees it?\nB: Oh snap, I'll get right on it. Good catch!\nA: No sweat. I just happened to notice it while browsing.\nB: It should be fixed in like two minutes.\nA: Perfect. Let me know when it's live.\nB: Done. Check it out now."
  },
  "expression_400": {
    "id": 400,
    "primary": "It's as good as new.",
    "meaning": "새것이나 다름없어요.",
    "similar": ["It's in mint condition.", "It's like it never happened.", "It's perfectly restored.", "It's back to its original state.", "It's flawless now."],
    "example": "A: Did you manage to fix that cracked screen?\nB: Yeah, look at it. It's as good as new.\nA: Wow, I can't even see where the crack was.\nB: The repair shop did a solid job. Worth every penny.\nA: No cap. It looks like you just bought it.\nB: For real. I'm definitely going back there if I break it again."
  },
  "expression_401": {
    "id": 401,
    "primary": "They have a lot in common.",
    "meaning": "그들은 공통점이 많아요.",
    "similar": ["They're very similar.", "They share many interests.", "They have a lot of similarities.", "They're on the same wavelength.", "They're two peas in a pod."],
    "example": "A: Have you met my new coworkers? They're hilarious.\nB: Yeah, I noticed they have a lot in common. Both are into retro games.\nA: Facts. They've been talking about old-school Nintendo all day.\nB: It's good they hit it off so quickly.\nA: For sure. Makes the office vibe a lot more chill.\nB: Definitely. Team chemistry is everything."
  },
  "expression_402": {
    "id": 402,
    "primary": "That's typical of you.",
    "meaning": "딱 너답네.",
    "similar": ["That's so you.", "Classic you.", "Spoken like a true [your name].", "No surprise there.", "That's just your style."],
    "example": "A: I decided to volunteer at the animal shelter again this weekend.\nB: Haha, that's typical of you. Always trying to help out.\nA: I just can't say no to those cute faces, you know?\nB: I know. You've always had a big heart.\nA: I guess it's just my thing.\nB: It's a good thing. Don't ever change."
  },
  "expression_403": {
    "id": 403,
    "primary": "You look after yourself.",
    "meaning": "몸조리 잘 하세요.",
    "similar": ["Take care of yourself.", "Don't overwork.", "Prioritize your health.", "Be kind to yourself.", "Stay healthy."],
    "example": "A: I'm heading out for my trip tomorrow morning.\nB: Safe travels! Make sure you look after yourself while you're away.\nA: I will. I've got my vitamins and my itinerary all set.\nB: Good. Don't push yourself too hard, just enjoy the vibe.\nA: Thanks, fam. I'll hit you up when I land.\nB: Sounds good. Peace out!"
  },
  "expression_404": {
    "id": 404,
    "primary": "Go for it!",
    "meaning": "한번 해봐!",
    "similar": ["Just do it!", "Give it a shot!", "Don't hold back!", "Take the leap!", "Shoot your shot!"],
    "example": "A: I'm thinking about starting my own podcast, but I'm nervous.\nB: Honestly? Go for it! You've got so many interesting stories to tell.\nA: You really think people would listen?\nB: 100%. Your perspective is unique, and that's what matters.\nA: Alright, I'm gonna start recording this weekend.\nB: That's what I'm talking about! I'll be your first listener."
  },
  "expression_405": {
    "id": 405,
    "primary": "He's a piece of work.",
    "meaning": "그는 정말 골칫덩이예요.",
    "similar": ["He's a character.", "He's a handful.", "He's quite a personality.", "He's something else.", "He's difficult to deal with."],
    "example": "A: Did you hear what the new manager did this morning?\nB: Ugh, yeah. Honestly, he's a piece of work. Always micromanaging.\nA: It's getting really old, really fast.\nB: Facts. I don't know how much longer I can deal with it.\nA: Hopefully he chills out once he's settled in.\nB: I wouldn't hold my breath. He seems set in his ways."
  },
  "expression_406": {
    "id": 406,
    "primary": "I won't let you down.",
    "meaning": "실망시켜 드리지 않을게요.",
    "similar": ["I won't disappoint you.", "I'll come through for you.", "You can count on me.", "I'll make you proud.", "I'll deliver."],
    "example": "A: I'm trusting you with this big account. Don't mess it up.\nB: I won't let you down, I promise. I've been preparing for this.\nA: I know you have. I believe in your skills.\nB: Thanks for the opportunity. I'm gonna give it 110%.\nA: That's the energy I like to see.\nB: I'll have the first draft ready by tomorrow morning."
  },
  "expression_407": {
    "id": 407,
    "primary": "I've been trying to reach you.",
    "meaning": "계속 연락하려고 했어요.",
    "similar": ["I've been trying to get ahold of you.", "I've been blowing up your phone.", "I was looking for you.", "I've been trying to connect with you.", "I was trying to find you."],
    "example": "A: Yo, I missed like five calls from you! What's up?\nB: Man, I've been trying to reach you all day! Where were you?\nA: My phone was on silent during the movie. My bad.\nB: All good. Anyway, we're all meeting at the pizza spot in ten.\nA: Say less. I'm leaving right now.\nB: Bet. See you there."
  },
  "expression_408": {
    "id": 408,
    "primary": "It was a stroke of luck.",
    "meaning": "뜻밖의 행운이었어요.",
    "similar": ["It was a fluke.", "It was pure luck.", "I got lucky.", "It was a happy accident.", "A fortunate coincidence."],
    "example": "A: How did you find such a great apartment in this market?\nB: Honestly, it was a stroke of luck. I saw the listing five minutes after it went up.\nA: That's insane. Most spots are gone in an hour.\nB: For real. I signed the lease before anyone else even toured it.\nA: You definitely used up all your luck for the year on that one.\nB: Facts. But honestly? Totally worth it."
  },
  "expression_409": {
    "id": 409,
    "primary": "Don't bottle up your feelings.",
    "meaning": "감정을 억누르지 마세요.",
    "similar": ["Don't suppress your emotions.", "Speak your mind.", "Don't hold it all in.", "Let it out.", "Share how you're feeling."],
    "example": "A: You've been really quiet lately. Is everything alright?\nB: I'm just stressed, I guess. It's no big deal.\nA: Look, don't bottle up your feelings. It's better to talk about it.\nB: I just don't wanna bother anyone with my problems.\nA: You're not bothering me. That's what friends are for.\nB: Thanks. Maybe I do need to vent a little."
  },
  "expression_410": {
    "id": 410,
    "primary": "It is hard to come by.",
    "meaning": "구하기 힘든 거예요.",
    "similar": ["It's rare.", "It's difficult to find.", "It's a scarce item.", "It's not easy to find.", "It's one of a kind."],
    "example": "A: Where did you find that vintage leather jacket?\nB: At a small thrift shop upstate. Pieces like this are hard to come by.\nA: The quality is incredible. They really don't make them like this anymore.\nB: For real. I was shocked it was even in my size.\nA: You definitely scored big time.\nB: Facts. I'm never letting this one go."
  },
  "expression_411": {
    "id": 411,
    "primary": "You're growing on me.",
    "meaning": "네가 점점 좋아지네.",
    "similar": ["I'm starting to like you.", "You're becoming a favorite.", "I'm warming up to you.", "You're winning me over.", "I'm starting to appreciate you more."],
    "example": "A: I know I'm a bit much sometimes, but I mean well.\nB: Don't worry about it. Honestly? You're growing on me.\nA: Oh, really? I thought I was annoying you.\nB: You were at first, but now I think you're just hilarious.\nA: I'll take that as a win.\nB: As you should. Let's get some coffee."
  },
  "expression_412": {
    "id": 412,
    "primary": "I burnt the midnight oil.",
    "meaning": "밤늦게까지 열심히 일했어요.",
    "similar": ["I worked late into the night.", "I pulled an all-nighter.", "I stayed up working.", "I put in extra hours at night.", "I was grinding late."],
    "example": "A: You look exhausted. Did you actually get any sleep?\nB: Barely. I burnt the midnight oil to finish that presentation.\nA: Was it worth it? Hope the client liked it.\nB: They loved it. All that effort really paid off.\nA: Good to hear, but you should definitely crash early tonight.\nB: 100%. My brain is officially fried."
  },
  "expression_413": {
    "id": 413,
    "primary": "Cut me some slack.",
    "meaning": "좀 봐주세요.",
    "similar": ["Give me a break.", "Take it easy on me.", "Don't be so hard on me.", "Show me some mercy.", "Lighten up on me."],
    "example": "A: You're ten minutes late again. This is becoming a habit.\nB: Look, cut me some slack. The subway was a complete mess today.\nA: I know, but you gotta plan for that.\nB: I did! There was an unexpected delay. I'm doing my best.\nA: Alright, just try to be more punctual from now on.\nB: I got you. I'll leave even earlier tomorrow."
  },
  "expression_414": {
    "id": 414,
    "primary": "That would be the best case scenario.",
    "meaning": "그게 최상의 시나리오일 거예요.",
    "similar": ["That's the ideal situation.", "That would be perfect.", "If everything goes right, that's what happens.", "That's the ultimate goal.", "That would be the dream."],
    "example": "A: If we launch by Monday, we'll beat all our competitors.\nB: That would be the best case scenario. Everyone's working overtime.\nA: Do you think we can actually make it happen?\nB: It's a tight squeeze, but it's definitely possible.\nA: Fingers crossed. This would be huge for the team.\nB: For real. Let's just keep this momentum going."
  },
  "expression_415": {
    "id": 415,
    "primary": "I couldn't agree more.",
    "meaning": "전적으로 동감이에요.",
    "similar": ["I'm totally with you.", "I 100% agree.", "You can say that again.", "Facts.", "My thoughts exactly."],
    "example": "A: New York is honestly the best city for inspiration.\nB: I couldn't agree more. The energy here is just different.\nA: For real. Everywhere you look, there's someone doing something creative.\nB: It's like you can't help but feel motivated.\nA: Facts. I never want to live anywhere else.\nB: Same. This city is just in my blood."
  },
  "expression_416": {
    "id": 416,
    "primary": "I've got a memory like a sieve.",
    "meaning": "제 기억력이 형편없어요.",
    "similar": ["I'm very forgetful.", "I have a terrible memory.", "Things just slip my mind.", "I can't remember anything.", "My brain is like a blank slate sometimes."],
    "example": "A: Did you remember to pick up the milk on your way home?\nB: Oh snap! I completely forgot. I've got a memory like a sieve.\nA: I literally texted you ten minutes ago!\nB: I know, I know. I saw it and then immediately got distracted.\nA: It's all good, I'll just go grab it now.\nB: My bad, fam. I'll make it up to you."
  },
  "expression_417": {
    "id": 417,
    "primary": "It's on the house.",
    "meaning": "서비스입니다.",
    "similar": ["It's free.", "It's a gift from us.", "No charge for this one.", "We're not charging you.", "This one's included."],
    "example": "A: Wait, I didn't see this appetizer on the bill.\nB: Don't worry about it, it's on the house. Thanks for coming in tonight!\nA: Oh, that's so sweet! Thank you so much.\nB: Of course. You guys are regulars, we gotta show some love.\nA: We really appreciate that. The food was incredible as always.\nB: Glad you enjoyed it! See you next time."
  },
  "expression_418": {
    "id": 418,
    "primary": "I think you should get a second opinion.",
    "meaning": "다른 의견도 들어보는 게 좋겠어요.",
    "similar": ["Consult someone else.", "Get another perspective.", "See what others think.", "Ask for another viewpoint.", "Double check with another expert."],
    "example": "A: The mechanic says my car needs a whole new engine.\nB: That sounds extreme. I think you should get a second opinion.\nA: You're right. I don't really trust that guy anyway.\nB: Take it to my guy in Queens. He's honest and won't overcharge you.\nA: Good looks. I'll give him a call tomorrow.\nB: Definitely. Better safe than sorry."
  },
  "expression_419": {
    "id": 419,
    "primary": "You are second to none.",
    "meaning": "당신은 최고예요.",
    "similar": ["You're the best.", "You're unbeatable.", "You're unmatched.", "You're elite.", "You're at the top of your game."],
    "example": "A: I really appreciate all the help you've given me with this project.\nB: Any time! Honestly, your work ethic is second to none.\nA: Wow, thanks. I really try to put in the effort.\nB: It shows. You're easily the most dedicated person on the team.\nA: That means a lot coming from you.\nB: Facts. Just keep doing what you're doing."
  },
  "expression_420": {
    "id": 420,
    "primary": "Don't pull my leg.",
    "meaning": "농담 마세요 (놀리지 마세요).",
    "similar": ["Don't mess with me.", "Are you kidding?", "Quit playing around.", "Don't joke with me.", "Are you for real?"],
    "example": "A: Guess what? I just won a thousand dollars on a scratch-off!\nB: No way! Don't pull my leg, show me the ticket.\nA: I'm dead serious! Look right here.\nB: Oh my god, you actually did it! That's insane!\nA: I know! I'm still in shock.\nB: Drinks are definitely on you tonight then!"
  },
  "expression_421": {
    "id": 421,
    "primary": "Cat got your tongue?",
    "meaning": "왜 꿀 먹은 벙어리가 됐어?",
    "similar": ["Why are you so quiet?", "Lost for words?", "Nothing to say?", "Why the silence?", "Speak up!"],
    "example": "A: You said you were gonna confront him, so what happened?\nB: I... I don't know. I just couldn't say it.\nA: What, cat got your tongue? You were so brave yesterday.\nB: It's different when you're actually looking at them, okay?\nA: I get it, but you gotta stand up for yourself eventually.\nB: I will. I just need a different approach."
  },
  "expression_422": {
    "id": 422,
    "primary": "You have lost the plot.",
    "meaning": "상황 파악을 못 하네요.",
    "similar": ["You've lost touch with reality.", "You're out of the loop.", "You don't understand the situation.", "You're confusing things.", "You've lost focus."],
    "example": "A: I think we should skip the launch and just start a new project from scratch.\nB: Honestly? You have lost the plot. We're 90% done!\nA: I just feel like the market has changed, you know?\nB: In three months? No way. We need to finish what we started.\nA: Maybe you're right. I'm just feeling a bit overwhelmed.\nB: Take a breather. We're almost at the finish line."
  },
  "expression_423": {
    "id": 423,
    "primary": "Let's just keep it between us.",
    "meaning": "우리끼리만 알고 있자.",
    "similar": ["Keep it a secret.", "Don't tell anyone else.", "Just between the two of us.", "Keep it under wraps.", "Let's keep this private."],
    "example": "A: I'm planning on quitting my job next month.\nB: Oh wow! Have you told anyone else yet?\nA: No, so let's just keep it between us for now.\nB: Of course. Your secret is safe with me.\nA: I appreciate that. I just want everything to be in place first.\nB: Smart move. Let me know if I can help with anything."
  },
  "expression_424": {
    "id": 424,
    "primary": "You know the drill.",
    "meaning": "어떻게 하는지 알지?",
    "similar": ["You know how it goes.", "You know what to do.", "You're familiar with the process.", "Standard procedure.", "You've done this before."],
    "example": "A: Alright, we've got another big shipment coming in tomorrow.\nB: Got it. You know the drill, I'll be here early to organize everything.\nA: Good looks. I'll handle the documentation then.\nB: Sounds like a plan. We'll be done by lunch if we move fast.\nA: For sure. Let's get it.\nB: Catch you in the morning."
  },
  "expression_425": {
    "id": 425,
    "primary": "It's been a roller coaster ride.",
    "meaning": "우여곡절이 많았어요.",
    "similar": ["It's been a wild ride.", "There have been many ups and downs.", "It's been a journey.", "It's been full of surprises.", "It's been quite an experience."],
    "example": "A: How has the first year of your startup been?\nB: Honestly, it's been a roller coaster ride. Some days are great, some are stressful.\nA: I can imagine. Entrepreneurship is no joke.\nB: For real. But I'm learning a lot through all the chaos.\nA: That's the best way to grow though.\nB: Facts. I wouldn't trade it for anything."
  },
  "expression_426": {
    "id": 426,
    "primary": "I look up to you.",
    "meaning": "당신을 존경해요.",
    "similar": ["I admire you.", "You're an inspiration to me.", "I respect you a lot.", "I follow your lead.", "You're my role model."],
    "example": "A: I really look up to you, especially how you handle difficult clients.\nB: Wow, thank you! I appreciate that a lot.\nA: No, seriously. You're always so calm and professional.\nB: It took years of practice, trust me. I used to be so stressed.\nA: Well, you're killing it now.\nB: Thanks, fam. That means more than you know."
  },
  "expression_427": {
    "id": 427,
    "primary": "It's overrated.",
    "meaning": "과대평가됐어요.",
    "similar": ["It's not that great.", "It's hyped up too much.", "It's disappointing.", "It doesn't live up to the hype.", "It's not worth the fuss."],
    "example": "A: Everyone's talking about that new brunch spot in SoHo. Have you been?\nB: Yeah, and honestly? It's overrated. Food was mid at best.\nA: Oh really? The pictures look so good though.\nB: It's all for the aesthetic. The actual taste just isn't there.\nA: Good to know. I'll save my money for somewhere else.\nB: Definitely. There are way better spots for half the price."
  },
  "expression_428": {
    "id": 428,
    "primary": "It was a blessing in disguise.",
    "meaning": "전화위복이었어요.",
    "similar": ["It was a fortunate turn of events.", "It turned out for the better.", "Everything happens for a reason.", "A hidden benefit.", "It was for the best."],
    "example": "A: I was so devastated when I didn't get that first job offer.\nB: But you ended up with a way better one! It was a blessing in disguise.\nA: Accurate. This company has a much better culture and pay.\nB: See? Life has a funny way of working itself out.\nA: For sure. I'm much happier here.\nB: I'm glad to hear it. Onwards and upwards!"
  },
  "expression_429": {
    "id": 429,
    "primary": "I don't hold a grudge.",
    "meaning": "뒤끝 없어요.",
    "similar": ["I don't stay angry.", "I forgive and forget.", "I'm not one to hold onto things.", "I move on quickly.", "No hard feelings."],
    "example": "A: I'm really sorry about what I said during the argument yesterday.\nB: Don't worry about it. I don't hold a grudge. We're good.\nA: Thanks, I was really worried you'd be mad for a while.\nB: Life is too short for all that negativity. Let's just move forward.\nA: I appreciate that. You're a real one.\nB: Facts. Let's grab some lunch and put it behind us."
  }
}
