{
  "expression_480": {
    "id": 480,
    "primary": "Don't hold your breath.",
    "meaning": "너무 기대하지 마세요.",
    "similar": ["Don't count on it.", "It's unlikely to happen.", "Keep your expectations low.", "Don't get your hopes up.", "It might not occur."],
    "example": "A: Do you think the train will actually be on time today?\nB: Honestly? Don't hold your breath. It's Friday afternoon.\nA: True. The MTA is always a mess right before the weekend.\nB: For real. I'm already planning for a thirty-minute delay.\nA: Smart move. I should probably do the same.\nB: Facts. Better to be pleasantly surprised than frustrated."
  },
  "expression_481": {
    "id": 481,
    "primary": "I give you my word.",
    "meaning": "약속할게요.",
    "similar": ["I promise.", "You have my guarantee.", "I'm telling the truth.", "I swear.", "You can trust me on this."],
    "example": "A: Are you sure you'll have the report ready by Monday morning?\nB: 100%. I give you my word, it'll be in your inbox by 9 AM.\nA: Good looks. I really need it for that client meeting.\nB: Don't even worry about it. I'm finishing it up tonight.\nA: I appreciate that focus. You're a lifesaver.\nB: Facts. I never break my word once it's given."
  },
  "expression_482": {
    "id": 482,
    "primary": "It's a long story.",
    "meaning": "사연이 많아요.",
    "similar": ["It's complicated.", "There's a lot to explain.", "I don't have time to get into it.", "It's a whole thing.", "Briefly said, but not really."],
    "example": "A: How did you end up moving from Brooklyn to Queens?\nB: Man, it's a long story. A lot of stuff happened all at once.\nA: Was it because of the rent hike or something else?\nB: That was part of it, but there were some personal factors too.\nA: I feel you. Moving is always a huge headache anyway.\nB: For real. I'll tell you the details over drinks sometime."
  },
  "expression_483": {
    "id": 483,
    "primary": "We've got to break the mold.",
    "meaning": "관습을 깨야 해요.",
    "similar": ["We need to be innovative.", "Time to change things up.", "Let's do something different.", "We've gotta think outside the box.", "Let's challenge the status quo."],
    "example": "A: Everyone else is doing the same basic marketing strategy.\nB: Exactly. We've got to break the mold and try something bold.\nA: What if we did a pop-up event in the middle of Times Square?\nB: Now that's what I'm talking about! That would definitely get attention.\nA: It's risky, but I think it could really pay off.\nB: Facts. Innovation always comes with a bit of risk."
  },
  "expression_484": {
    "id": 484,
    "primary": "That's what I'm talking about!",
    "meaning": "바로 그거예요!",
    "similar": ["I totally agree!", "Exactly!", "That's perfect!", "You nailed it!", "I'm so down for that!"],
    "example": "A: Yo, I just got us front-row seats for the Knicks game!\nB: That's what I'm talking about! Let's go! You're a legend.\nA: It took forever to score them, but honestly? Totally worth it.\nB: For real! I've been wanting to see them live all season.\nA: Me too. We're gonna have the best time.\nB: Best day ever. No cap."
  },
  "expression_485": {
    "id": 485,
    "primary": "The damage is done.",
    "meaning": "이미 엎질러진 물이에요.",
    "similar": ["It's too late now.", "The harm has occurred.", "There's no going back.", "What's done is done.", "The situation is irreversible."],
    "example": "A: I really should've checked that email before I sent it.\nB: Honestly? The damage is done now. The client already saw it.\nA: Do you think they'll be mad about the typo?\nB: It wasn't just a typo, but hopefully they're in a good mood.\nA: I'm just gonna go hide in my office for a bit.\nB: Chill. Just apologize and move on. No use dwelling on it."
  },
  "expression_486": {
    "id": 486,
    "primary": "I can't sit still.",
    "meaning": "가만히 못 있겠어요.",
    "similar": ["I'm feeling restless.", "I have too much energy.", "I'm anxious to move.", "I can't stay in one place.", "I'm fidgety."],
    "example": "A: You've been pacing around the room for ten minutes.\nB: I know, I'm just so nervous about the interview results. I can't sit still.\nA: Try to take some deep breaths and relax a little.\nB: I'm trying, but my heart is racing. I just want to know already.\nA: I feel you. The waiting is always the hardest part.\nB: For real. I'm literally about to lose my mind."
  },
  "expression_487": {
    "id": 487,
    "primary": "It's better than nothing.",
    "meaning": "없는 것보다 낫죠.",
    "similar": ["It's better than zero.", "At least it's something.", "Could be worse.", "It's a start.", "I'll take it."],
    "example": "A: I only got a five percent discount on these shoes.\nB: Hey, it's better than nothing. Rent is expensive anyway.\nA: True, every little bit helps when you live in this city.\nB: For real. I'm always looking for ways to save a few bucks.\nA: Same. I should probably start cooking more at home instead of getting takeout.\nB: Facts. That's a real game changer for the wallet."
  },
  "expression_488": {
    "id": 488,
    "primary": "That's just the way it is.",
    "meaning": "세상일이 다 그렇죠.",
    "similar": ["That's life.", "It is what it is.", "No changing it.", "Standard situation.", "Just our luck sometimes."],
    "example": "A: I can't believe they increased the subway fare again.\nB: Man, that's just the way it is. Inflation hitting everyone hard.\nA: It's getting so expensive just to commute to work!\nB: For real. But what can we do? We still gotta get there.\nA: I guess I'll just have to cut back on the morning lattes.\nB: Facts. Sacrifices must be made."
  },
  "expression_489": {
    "id": 489,
    "primary": "Stay focused.",
    "meaning": "집중하세요.",
    "similar": ["Keep your eyes on the prize.", "Don't get distracted.", "Concentrate.", "Stay on task.", "Maintain your focus."],
    "example": "A: I'm so tempted to check my socials right now.\nB: Look, stay focused! We only have twenty minutes to finish this project.\nA: You're right. I'll just leave my phone in my bag for now.\nB: Smart move. Let's knock this out so we can actually enjoy the night.\nA: Bet. I'm locked in now.\nB: That's what I like to hear. Let's get it."
  },
  "expression_490": {
    "id": 490,
    "primary": "He was quite high maintenance.",
    "meaning": "그는 손이 많이 가는 스타일이에요.",
    "similar": ["He required a lot of attention.", "He's difficult to please.", "He's very demanding.", "He's a lot of work.", "He's needy."],
    "example": "A: How did that date go with the guy you met on the app?\nB: Honestly? He was quite high maintenance. Constant texting and complaining.\nA: Oh no, that's a huge red flag for me.\nB: For real. I just want someone who's chill and can go with the flow.\nA: I feel you. Life is too stressful for all that extra drama.\nB: Facts. I'm definitely not seeing him again."
  },
  "expression_491": {
    "id": 491,
    "primary": "I went cold turkey.",
    "meaning": "단번에 끊었어요.",
    "similar": ["I stopped abruptly.", "I quit immediately.", "I gave it up for good.", "No gradual decrease, just stopped.", "I cut it out completely."],
    "example": "A: Wait, I haven't seen you with a vape in like a month.\nB: Yeah, I finally went cold turkey. Best decision I ever made.\nA: Was it hard? I heard the first few days are the worst.\nB: It was brutal, honestly. But it gets easier after the first week.\nA: Respect. That takes a lot of willpower.\nB: Facts. I'm just glad I'm finally free from it."
  },
  "expression_492": {
    "id": 492,
    "primary": "Don't keep me waiting.",
    "meaning": "기다리게 하지 마세요.",
    "similar": ["Hurry up.", "Don't be late.", "I'm on a schedule.", "Be punctual.", "Don't stall."],
    "example": "A: I'm just finishing up my hair, I'll be out in five minutes.\nB: Look, the reservations are at 7, so don't keep me waiting!\nA: Chill, I'm almost done! I just want to look decent.\nB: You always look good, just hurry up or we're gonna lose our table.\nA: Alright, alright. I'm grabbing my bag right now.\nB: Better be. I'm literally in the car already."
  },
  "expression_493": {
    "id": 493,
    "primary": "Get with the program.",
    "meaning": "상황 파악 좀 하세요.",
    "similar": ["Catch up.", "Understand the situation.", "Realize what's happening.", "Follow the plan.", "Wake up to reality."],
    "example": "A: Wait, why are we all wearing black today? I missed the memo.\nB: Seriously? Get with the program! It's because the boss's pet passed away.\nA: Oh snap... I feel so awkward in this bright yellow shirt now.\nB: Yeah, you definitely stick out like a sore thumb. Go change.\nA: My bad, I'll be back in ten. Is everyone really that upset?\nB: For real. Just keep it low key when you get back."
  },
  "expression_494": {
    "id": 494,
    "primary": "Give me a ballpark figure.",
    "meaning": "대략적인 수치를 알려주세요.",
    "similar": ["Give me a rough estimate.", "Approximate it for me.", "What's the general range?", "Give me a guess.", "Give me a ballpark estimate."],
    "example": "A: How much is it gonna cost to fix this whole kitchen?\nB: Look, I can't give you the exact price yet, but I can give you a ballpark figure.\nA: Alright, that works for now. Just so I can plan my budget.\nB: I'd say you're looking at around five to seven thousand dollars.\nA: That's a lot, but honestly? It could've been worse.\nB: Facts. I'll get you the detailed quote by tomorrow morning."
  },
  "expression_495": {
    "id": 495,
    "primary": "What's your best guess?",
    "meaning": "대충 짐작해보면 어때요?",
    "similar": ["What do you think is likely?", "What's your estimation?", "What's your initial thought?", "Give me your best prediction.", "What's your gut feeling?"],
    "example": "A: Which team do you think is gonna win the championship this year?\nB: Honestly? My best guess is the Celtics. They've been playing crazy good.\nA: I don't know, the Warriors are looking pretty solid too.\nB: True, but the Celtics' defense is just on another level right now.\nA: We'll see. It's gonna be a wild season for sure.\nB: Facts. I'm just looking forward to the playoffs."
  },
  "expression_496": {
    "id": 496,
    "primary": "It's a pain in the neck.",
    "meaning": "정말 성가셔요.",
    "similar": ["It's annoying.", "It's a nuisance.", "It's bothersome.", "I can't stand it.", "It's a real hassle."],
    "example": "A: The elevator in my building is broken again. I have to walk up six floors.\nB: Ugh, that's such a pain in the neck. Especially with groceries!\nA: For real. It's the third time this month. I'm about to call the super.\nB: You should! You pay too much rent for that kind of service.\nA: Facts. It's getting really old, really fast.\nB: Hopefully they fix it for good this time."
  },
  "expression_497": {
    "id": 497,
    "primary": "It keeps me on my toes.",
    "meaning": "긴장을 늦출 수 없게 해요.",
    "similar": ["It keeps me alert.", "It keeps me focused.", "I'm always ready.", "It motivates me to stay sharp.", "It's a constant challenge."],
    "example": "A: How do you handle working three jobs at once?\nB: It's a lot, but honestly, it keeps me on my toes. I'm never bored.\nA: Respect. I think I'd just be exhausted all the time.\nB: It's all about managing your energy, you know? And plenty of coffee.\nA: Facts. Whatever works for you though.\nB: Definitely. Keeps life interesting for sure."
  },
  "expression_498": {
    "id": 498,
    "primary": "It blows me away.",
    "meaning": "정말 놀라워요.",
    "similar": ["I'm amazed.", "It's incredible.", "I'm stunned.", "It's mind-blowing.", "It takes my breath away."],
    "example": "A: Did you see that new art installation at the MoMA?\nB: Yeah, and honestly? It blows me away every time I look at it.\nA: The scale of it is just so impressive, right?\nB: 100%. I can't even imagine how much work went into creating that.\nA: I'm definitely going back to see it again next week.\nB: Same. It's a real masterpiece, no cap."
  },
  "expression_499": {
    "id": 499,
    "primary": "I'm susceptible to it.",
    "meaning": "저는 거기에 약해요.",
    "similar": ["I'm vulnerable to it.", "I'm easily affected by it.", "It's my weakness.", "I'm prone to it.", "I lack resistance to it."],
    "example": "A: Are you okay with spicy food? We're going to that Thai spot tonight.\nB: Honestly? I'm pretty susceptible to it. Even mild stuff makes me cry.\nA: Oh no! We can definitely go somewhere else then.\nB: Nah, don't worry about it! I'll just order something plain.\nA: You sure? I don't want you to be miserable the whole time.\nB: Facts. Maybe let's just do ramen instead. It's safer."
  },
  "expression_500": {
    "id": 500,
    "primary": "I'll level with you.",
    "meaning": "솔직히 털어놓을게요.",
    "similar": ["I'll be honest with you.", "I'm gonna tell it like it is.", "No more secrets.", "Let's be real for a second.", "I'll give you the truth."],
    "example": "A: Do you think I actually have a shot at getting into that program?\nB: Look, I'll level with you. It's incredibly competitive and your GPA is a bit low.\nA: I appreciate the honesty. I just wanted to know what I'm up against.\nB: You still have a chance if you write a crazy good essay though.\nA: I'll definitely put in the work. Thanks for not sugarcoating it.\nB: Any time. Real talk is always better."
  },
  "expression_501": {
    "id": 501,
    "primary": "They had it coming.",
    "meaning": "자업자득이에요.",
    "similar": ["They deserved it.", "It was bound to happen to them.", "Justice was served.", "They brought it on themselves.", "They're finally facing the consequences."],
    "example": "A: Did you hear that Mark got fired for lying on his timesheet?\nB: Honestly? He had it coming. Everyone knew he was faking his hours.\nA: It's still pretty crazy though. He'd been there for years.\nB: For real, but you can't just keep doing that and expect to get away with it forever.\nA: Facts. It was only a matter of time before they caught him.\nB: Exactly. Play stupid games, win stupid prizes."
  },
  "expression_502": {
    "id": 502,
    "primary": "I'll spare you the details.",
    "meaning": "자세한 설명은 생략할게요.",
    "similar": ["I won't bore you with specifics.", "Let's skip the small stuff.", "Long story short.", "I'll keep it brief.", "We can skip the particulars."],
    "example": "A: How did your car end up in the river, anyway?\nB: Man, it's a long story and honestly? I'll spare you the details. It was embarrassing.\nA: I'm just glad you're okay! That looks like it was intense.\nB: It was. I'm just trying to move on and forget about the whole thing.\nA: I feel you. Let me know if you need a ride anywhere.\nB: Thanks, fam. I really appreciate the help."
  },
  "expression_503": {
    "id": 503,
    "primary": "Bad news travels fast.",
    "meaning": "나쁜 소식은 빨리 퍼져요.",
    "similar": ["Gossip spreads quickly.", "Rumors catch fire fast.", "Negativity gets around.", "People are quick to share bad news.", "Ill tidings gain ground quickly."],
    "example": "A: I literally just got dumped an hour ago, how did everyone already know?\nB: You know what they say—bad news travels fast in this small town.\nA: It's honestly so frustrating. I just wanted some peace and quiet.\nB: For real. Everyone's already texting me asking for the 'tea'.\nA: Just tell them I'm not talking about it. I'm going off the grid for a bit.\nB: Facts. I'll handle the nosy neighbors for you."
  },
  "expression_504": {
    "id": 504,
    "primary": "Why the long face?",
    "meaning": "왜 울상이에요?",
    "similar": ["Why so sad?", "What's bothering you?", "Why are you looking down?", "Everything okay?", "You look like you've seen a ghost."],
    "example": "A: Yo, why the long face? You're usually so hype on Fridays.\nB: I just found out my favorite lunch spot is closing down for good.\nA: Oh no! That sucks. They had the best sandwiches in the neighborhood.\nB: For real. I don't know what I'm gonna do now.\nA: Don't worry, we'll find a new spot. There's plenty of options around here.\nB: I guess, but it won't be the same."
  },
  "expression_505": {
    "id": 505,
    "primary": "What's the occasion?",
    "meaning": "무슨 특별한 날인가요?",
    "similar": ["What are we celebrating?", "What's going on?", "Why all the fuss?", "Is there a special event today?", "What's the big deal?"],
    "example": "A: Wow, everyone is so dressed up today! What's the occasion?\nB: It's the company's tenth anniversary! Didn't you see the email?\nA: Oh snap... I completely missed it. I'm just in my regular jeans.\nB: Haha, it's all good. The celebration doesn't start till 3 PM anyway.\nA: I might have to run home and change really quick.\nB: You better! The boss is definitely checking attendance today."
  },
  "expression_506": {
    "id": 506,
    "primary": "What's the matter?",
    "meaning": "무슨 일이에요?",
    "similar": ["What's wrong?", "Is everything okay?", "What happened?", "Tell me what's bothering you.", "Is there a problem?"],
    "example": "A: You've been staring at that wall for ten minutes. What's the matter?\nB: I'm just worrying about my presentation tomorrow. I feel so unprepared.\nA: Come on, you've been working on it all week! You'll be fine.\nB: I hope so. I just hate public speaking so much.\nA: You've got this. Let's go over your slides one more time.\nB: Thanks, fam. That would actually help a lot."
  },
  "expression_507": {
    "id": 507,
    "primary": "He had a blast.",
    "meaning": "아주 즐거운 시간을 보냈어요.",
    "similar": ["He had so much fun.", "He really enjoyed himself.", "He had a great time.", "He was having the time of his life.", "He was thrilled with the experience."],
    "example": "A: How was your nephew's birthday party at the arcade?\nB: It was awesome! Honestly, he had a blast and didn't want to leave.\nA: That's classic. Kids and video games are a perfect match.\nB: For real. He even won one of those giant plushies from the crane machine.\nA: No way! Those things are notoriously impossible to beat.\nB: Facts. He was flexing on everyone all afternoon."
  },
  "expression_508": {
    "id": 508,
    "primary": "Don't fall for it.",
    "meaning": "속지 마세요.",
    "similar": ["Don't be fooled.", "Don't believe their lies.", "Avoid the trap.", "Stay skeptical.", "Don't let them trick you."],
    "example": "A: This website says I can get a free iPhone just by clicking this link.\nB: Yo, don't fall for it! That's definitely a phishing scam.\nA: But it looks so official though! It's got the logo and everything.\nB: That's how they get you. Never enter your info on a random site like that.\nA: Good looks. I almost clicked it without even thinking.\nB: For real. Stay safe out there in the digital wild."
  },
  "expression_509": {
    "id": 509,
    "primary": "Suit yourself.",
    "meaning": "마음대로 하세요.",
    "similar": ["Do whatever you want.", "It's up to you.", "Have it your way.", "Whatever makes you happy.", "Be my guest."],
    "example": "A: I'm just gonna stay in tonight and finish this book.\nB: Alright, suit yourself! We'll be at the concert if you change your mind.\nA: Have fun for me though! Tell everyone I say hi.\nB: You got it. Just don't complain tomorrow when you see the videos.\nA: Haha, I'll take my chances. Peace out for now!\nB: Later!"
  },
  "expression_510": {
    "id": 510,
    "primary": "It was put on ice.",
    "meaning": "보류되었어요.",
    "similar": ["It was delayed.", "It's on hold.", "The project was suspended.", "It's taking a backseat for now.", "It was postponed indefinitely."],
    "example": "A: What's the status of the new app redesign project?\nB: Honestly? It was put on ice because of budget cuts.\nA: Oh snap... after all that work we put into the sketches?\nB: For real. They're focusing on more 'immediate revenue' stuff now.\nA: That's such a bummer. I really thought the new look was dope.\nB: Facts. Hopefully they bring it back next quarter."
  },
  "expression_511": {
    "id": 511,
    "primary": "You've lost me.",
    "meaning": "무슨 말인지 모르겠어요.",
    "similar": ["I don't follow you.", "I'm confused by what you're saying.", "Could you repeat that?", "I'm not on the same page.", "I'm lost in this conversation."],
    "example": "A: So after we optimize the backend, we can parallelize the data fetching layer using asynchronous hooks.\nB: Wait, you've lost me. Can you explain that in plain English for a second?\nA: My bad! Basically, we're making the website load faster by doing two things at once.\nB: Ah, okay. That makes way more sense. Thanks for the clarification.\nA: No sweat. I sometimes get carried away with the technical talk.\nB: For real. I'm more of a visual person anyway."
  },
  "expression_512": {
    "id": 512,
    "primary": "I'm on cloud nine.",
    "meaning": "너무 행복해요.",
    "similar": ["I'm incredibly happy.", "I'm thrilled.", "I'm Over the moon.", "Life is perfect right now.", "I'm feeling amazing."],
    "example": "A: Yo, I just heard you got into your dream grad school! Congrats!\nB: Thanks, fam! I'm honestly on cloud nine right now. I can't believe it.\nA: You worked so hard for this, you definitely deserve it.\nB: For real. All those late nights in the library finally paid off.\nA: We're definitely celebrating this weekend! Drinks are on me.\nB: Say less! I'm so hyped."
  },
  "expression_513": {
    "id": 513,
    "primary": "She was thirsty.",
    "meaning": "관심을 갈구했어요.",
    "similar": ["She was seeking attention.", "She was desperate for validation.", "She was being too much.", "She was craving the spotlight.", "She was acting very needy."],
    "example": "A: Did you see her posting like fifty stories from the party last night?\nB: Yeah, honestly? She was thirsty for any kind of attention she could get.\nA: It was a little much, don't you think? Everyone was just trying to chill.\nB: For real. Not everything needs to be on the 'gram all the time.\nA: Facts. I just put my phone away and actually enjoyed the vibe.\nB: Smart move. Quality over quantity, always."
  },
  "expression_514": {
    "id": 514,
    "primary": "There's nothing to it.",
    "meaning": "아주 쉬워요.",
    "similar": ["It's very simple.", "It's easy as pie.", "No big deal.", "It's a breeze.", "Piece of cake."],
    "example": "A: Do you think you can show me how to assemble this IKEA desk?\nB: For sure! Look, there's nothing to it once you follow the pictures.\nA: I'm just always terrified I'm gonna have extra screws at the end.\nB: Haha, it happens to the best of us. Just take it slow and you'll be fine.\nA: Alright, let's get down to business then.\nB: Bet. Hand me that Allen wrench."
  },
  "expression_515": {
    "id": 515,
    "primary": "But there's a twist.",
    "meaning": "하지만 반전이 있어요.",
    "similar": ["However, something unexpected occurs.", "There's a surprise element.", "It's not as it seems.", "Wait till you hear this part.", "Things take a sudden turn."],
    "example": "A: I found the perfect apartment in the Lower East Side for only $1500!\nB: Wow! That's an insane deal. What's the catch?\nA: But there's a twist... the landlord says I have to share it with three ghosts.\nB: Haha, you're kidding right? Please tell me you're joking.\nA: I wish! I'm actually starting to think it might be haunted for real.\nB: Save your money and keep looking. No ghost-mates for me!"
  },
  "expression_516": {
    "id": 516,
    "primary": "We're out of the woods.",
    "meaning": "이제 위험에서 벗어났어요.",
    "similar": ["We're safe now.", "The danger has passed.", "We've cleared the main hurdles.", "Things are looking better.", "We've survived the worst."],
    "example": "A: Is the server still crashing every five minutes?\nB: No, looks like we're finally out of the woods. The traffic has stabilized.\nA: Thank goodness! I was about to have a mental breakdown.\nB: For real. That was a stressful three hours for everyone involved.\nA: Let's just monitor it for another hour just to be totally safe though.\nB: Smart move. I'll keep an eye on the analytics."
  },
  "expression_517": {
    "id": 517,
    "primary": "Let's play it by ear.",
    "meaning": "상황 보고 정합시다.",
    "similar": ["Let's see how things go.", "We'll decide later.", "Go with the flow.", "No concrete plans yet.", "We'll adjust as we go."],
    "example": "A: What time should we head out for dinner tonight?\nB: Honestly? Let's just play it by ear. It depends on when everyone finishes work.\nA: Alright, just hit me up when you're ready to leave then.\nB: For sure. I'll give you a thirty-minute heads up.\nA: Sounds like a plan. I'm just gonna chill here till then.\nB: Bet. Catch you later."
  },
  "expression_518": {
    "id": 518,
    "primary": "Don't even bring it up.",
    "meaning": "꺼내지도 마세요.",
    "similar": ["Don't mention it.", "Don't talk about it.", "Avoid that subject.", "Let's not go there.", "Please ignore that topic."],
    "example": "A: So, whatever happened with that guy you were seeing last month?\nB: Look, don't even bring it up. It ended very, very badly.\nA: Oh snap... my bad! I didn't know it was that serious.\nB: It's fine, I'm just trying to delete him from my memory entirely.\nA: I feel you. Let's talk about something way more positive instead.\nB: Best idea. Tell me more about that new project you're working on."
  },
  "expression_519": {
    "id": 519,
    "primary": "Your eyes are bigger than your stomach.",
    "meaning": "욕심부리네요.",
    "similar": ["You're overestimating your appetite.", "You ordered too much food.", "You took more than you can handle.", "You're acting greedy.", "Be realistic about what you can finish."],
    "example": "A: I think I'm gonna order two more large pizzas for the party.\nB: Look, your eyes are bigger than your stomach! We still have leftovers from last time.\nA: I just don't want anyone to go hungry, you know?\nB: I get it, but we already have plenty of snacks too. Chill on the pizza.\nA: Alright, maybe you're right. I'll just get one more instead.\nB: Still probably too much, but whatever. Suit yourself."
  },
  "expression_520": {
    "id": 520,
    "primary": "It's not even close.",
    "meaning": "어림도 없어요.",
    "similar": ["It's way off.", "Not even in the ballpark.", "A huge difference.", "Completely different level.", "Doesn't compare at all."],
    "example": "A: Do you think my local pizza spot is as good as Joe's in the Village?\nB: Honestly? It's not even close. Joe's is in a whole other league.\nA: Come on! Mine is pretty solid for a neighborhood joint.\nB: Solid, yeah, but Joe's is legendary. There's just no comparison.\nA: I guess I need to head down there and do a taste test then.\nB: Facts. You'll see exactly what I'm talking about."
  },
  "expression_521": {
    "id": 521,
    "primary": "I don't blame you.",
    "meaning": "당신 탓이 아니에요.",
    "similar": ["I understand your decision.", "It's not your fault.", "I see why you did that.", "No judgment from me.", "I would've done the same."],
    "example": "A: I decided to quit my corporate job and just travel for a year.\nB: Honestly? I don't blame you. That job was killing your soul.\nA: It really was. I'm just so ready for a change of pace.\nB: For real. You've been working so hard for years, you deserve a break.\nA: Thanks for the support. A lot of people think I'm crazy.\nB: They're just jealous of your freedom. Live your life!"
  },
  "expression_522": {
    "id": 522,
    "primary": "Don't let it bother you.",
    "meaning": "신경 쓰지 마세요.",
    "similar": ["Ignore it.", "Don't worry about it.", "Keep your head up.", "Let it slide.", "Don't let it get to you."],
    "example": "A: My boss made a really snarky comment about my presentation today.\nB: Look, don't let it bother you. He's always like that after his morning meeting.\nA: It still hurtful though! I worked so hard on those slides.\nB: I know, but you did a great job and everyone else loved it. Stay positive.\nA: You're right. I'm just gonna focus on the good feedback instead.\nB: Smart move. Negative energy is just not worth your time."
  },
  "expression_523": {
    "id": 523,
    "primary": "I'm at your service.",
    "meaning": "무엇을 도와드릴까요?",
    "similar": ["I'm here to help.", "Let me know what you need.", "I'm ready to assist.", "I'm available for any tasks.", "Count on me for support."],
    "example": "A: I really need some help organizing the event next week.\nB: Any time! I'm at your service. Just tell me what needs doing.\nA: Could you handle the guest list and the catering details?\nB: 100%. I'll get started on it first thing tomorrow morning.\nA: You're a lifesaver! I was honestly about to panic.\nB: Chill, we've got this. Teamwork makes the dream work!"
  },
  "expression_524": {
    "id": 524,
    "primary": "She's cool as a cucumber.",
    "meaning": "아주 침착해요.",
    "similar": ["She's incredibly calm.", "She handles pressure well.", "She's composed.", "Nothing rattles her.", "She's unflappable."],
    "example": "A: How did she stay so calm when the whole system went down?\nB: Honestly? She's cool as a cucumber during crises. It's impressive.\nA: I'd be running around like a headless chicken, for real.\nB: Me too. I don't know how she does it. It must be meditation or something.\nA: Either way, I'm glad she's on our team.\nB: Facts. We really need that kind of steady energy right now."
  },
  "expression_525": {
    "id": 525,
    "primary": "He's down to earth.",
    "meaning": "겸손하고 현실적이에요.",
    "similar": ["He's very practical.", "He's relatable.", "He's humble.", "He's got no ego.", "He's a regular guy."],
    "example": "A: Have you met the new CEO yet? Is he as terrifying as everyone says?\nB: Not at all! Honestly, he's super down to earth and actually listens to ideas.\nA: Oh wow! That's such a relief to hear.\nB: For real. He even ate lunch with us in the breakroom today.\nA: That's dope. It's nice to have a leader who actually feels like a human being.\nB: 100%. Makes the whole office vibe so much better."
  },
  "expression_526": {
    "id": 526,
    "primary": "We have to address the problem.",
    "meaning": " 문제를 해결해야 해요.",
    "similar": ["We need to deal with the issue.", "Let's confront the situation.", "We have to fix this.", "Tackle the problem head-on.", "Find a solution now."],
    "example": "A: We've been ignoring the drop in sales for three months now.\nB: Look, we have to address the problem before it gets any worse.\nA: I agree, but what's our first step? We need more data.\nB: Let's start by surveying our most loyal customers. See what's changed.\nA: Smart move. I'll set that up by the end of the week.\nB: Perfect. Time to be proactive instead of just hoping for the best."
  },
  "expression_527": {
    "id": 527,
    "primary": "How old do you think I am?",
    "meaning": "제 나이가 몇 살 같아요?",
    "similar": ["Guess my age.", "What's your best guess on my age?", "How old do I look?", "Do you think I'm older or younger?", "Give me a number on my age."],
    "example": "A: You seem so mature for someone just starting their career.\nB: Really? Haha, how old do you think I am? Most people get it wrong.\nA: I'd say... maybe twenty-five? You've got that youthful energy.\nB: Actually, I'm thirty-two! I just take really good care of my skin.\nA: No way! You definitely don't look a day over twenty-two.\nB: Haha, I'll take that as a huge win! Thanks for the kind words."
  },
  "expression_528": {
    "id": 528,
    "primary": "It put me on the map.",
    "meaning": "그것 덕분에 유명해졌어요.",
    "similar": ["It made me famous.", "It gave me recognition.", "It established my reputation.", "It brought me into the spotlight.", "It was my big break."],
    "example": "A: How did you get that job at the huge tech firm?\nB: Honestly, that viral app I built last year? It really put me on the map.\nA: Oh word! I remember seeing that one on Product Hunt.\nB: Yeah, it got a lot of buzz very quickly. Companies started reaching out to me after that.\nA: That's the dream, for real. Hard work actually paying off.\nB: Facts. It's all about that one project that catches the right eyes."
  },
  "expression_529": {
    "id": 529,
    "primary": "They are selling like hot cakes.",
    "meaning": "불티나게 팔리고 있어요.",
    "similar": ["They're very popular.", "Demand is through the roof.", "They're flying off the shelves.", "Sales are booming.", "Everyone wants one."],
    "example": "A: Did you manage to get those new sneakers that dropped today?\nB: No way, man! They were selling like hot cakes and sold out in three minutes.\nA: That's wild. I was on the site at 10 AM too and I couldn't even load the page.\nB: For real. Resellers are probably already hiking the price up to five hundred.\nA: I hate that so much. Just ruins the fun for the actual fans.\nB: Facts. I'm just gonna wait for the next restock."
  }
}
