[
  {
    "id": 690,
    "primary": "My face is breaking out.",
    "meaning": "피부가 뒤집어졌어요.",
    "similar": [
      "I'm having a massive breakout.",
      "My skin is going crazy right now.",
      "I've got pimples popping up everywhere.",
      "My complexion is currently a mess.",
      "I'm dealing with some serious acne suddeny."
    ],
    "example": "A: Are you okay? You're wearing a lot of foundation today.\nB: Ugh, my face is breaking out like crazy. I hate it.\nA: Is it the new skincare product you tried?\nB: Probably. Or just the stress from finals week.\nA: Drink more water, it might help clear it up.\nB: I'm trying everything, but nothing seems to work.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 691,
    "primary": "I want some time off.",
    "meaning": "좀 쉬고 싶어요.",
    "similar": [
      "I need a serious break.",
      "I'm dying for a vacation.",
      "I just want to unplug for a bit.",
      "I'm overdue for some 'me time'.",
      "I need to step away from work."
    ],
    "example": "A: You've been working late every night this month.\nB: I know. I'm so burnt out. I want some time off.\nA: Why don't you talk to the boss about a long weekend?\nB: I'm planning to. I just need to finish this project first.\nA: Don't wait too long, your health is more important.\nB: You're right. I'm booking a flight as soon as this is done.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 692,
    "primary": "I'm not good with my hands.",
    "meaning": "나 똥손이야.",
    "similar": [
      "I'm total klutz at DIY stuff.",
      "I can't build anything to save my life.",
      "Handy work isn't my forte.",
      "I'm pretty clumsy with tools.",
      "I'm not exactly a craftsman."
    ],
    "example": "A: Can you help me assemble this IKEA bookshelf?\nB: Honestly? I'm not good with my hands. I'll probably break it.\nA: Come on, it's just a few screws and some wood.\nB: Last time I tried, I ended up with a crooked table.\nA: Okay, maybe you just hold the instructions then.\nB: That, I can definitely do. Let's get started.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 693,
    "primary": "I have a nosebleed.",
    "meaning": "코피가 나요.",
    "similar": [
      "My nose is bleeding.",
      "Get me a tissue, quick!",
      "I've got a bloody nose.",
      "Something's wrong with my nose.",
      "Help, my nose is dripping blood."
    ],
    "example": "A: Hey, are you okay? Your shirt has a stain on it.\nB: Wait, what? Oh no, I have a nosebleed!\nA: Lean forward and pinch your nose. Don't tilt back!\nB: Thanks, I don't know why this happened suddenly.\nA: It's probably just the dry air in this office.\nB: Yeah, I should probably get a humidifier for my desk.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 694,
    "primary": "I'm pooped.",
    "meaning": "완전 지쳤어.",
    "similar": [
      "I'm completely drained.",
      "I'm exhausted beyond belief.",
      "I'm ready to pass out.",
      "I've got zero energy left.",
      "I'm totally wiped out."
    ],
    "example": "A: Want to go for a run this evening?\nB: No way, I'm pooped after that hike today.\nA: It wasn't even that long! Where's your stamina?\nB: My legs are like jelly, dude. I'm staying on this couch.\nA: Fine, I'll just go by myself then.\nB: Enjoy! I'll be right here when you get back.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 695,
    "primary": "I'm tone-deaf.",
    "meaning": "나 음치야.",
    "similar": [
      "I can't carry a tune.",
      "I'm terrible at singing.",
      "My singing voice is a nightmare.",
      "I have no ear for music.",
      "Kareoke is my worst enemy."
    ],
    "example": "A: Let's go to that new karaoke bar tonight!\nB: Oh man, you know I'm tone-deaf, right?\nA: It doesn't matter! That's the whole point of karaoke.\nB: For you, maybe. For me, it's just pure embarrassment.\nA: Just pick a song you know by heart. It'll be fine.\nB: Alright, but don't say I didn't warn you when I start.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 696,
    "primary": "It's been a little hectic.",
    "meaning": "정신없이 바빴어.",
    "similar": [
      "Things have been crazy lately.",
      "I've been juggling a lot.",
      "It's been a whirlwind week.",
      "I haven't had a second to breathe.",
      "Life's been a bit of a mess recently."
    ],
    "example": "A: Long time no see! How have you been lately?\nB: Honestly? It's been a little hectic with the new job.\nA: I bet! Are you settling in okay though?\nB: Yeah, but there's just so much to learn at once.\nA: Take it one day at a time. You'll get there.\nB: Thanks, I'm definitely trying to keep my head up.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 697,
    "primary": "It bugs me.",
    "meaning": "그거 신경 쓰여요.",
    "similar": [
      "That's really annoying.",
      "It's getting under my skin.",
      "It's driving me a bit crazy.",
      "I can't stop thinking about it.",
      "It's bothering me quite a bit."
    ],
    "example": "A: Did you see that typo in the final report?\nB: Yeah, but it's not a big deal. The client won't care.\nA: I know, but it bugs me every time I look at it.\nB: You're such a perfectionist. Just let it go.\nA: I can't. I'm going to fix it and resend it.\nB: Whatever makes you sleep better at night, I guess.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 698,
    "primary": "Not to my knowledge.",
    "meaning": "내가 알기로는 아니야.",
    "similar": [
      "Not as far as I know.",
      "I haven't heard anything like that.",
      "That's news to me if it's true.",
      "I don't think that's the case.",
      "I haven't been informed otherwise."
    ],
    "example": "A: Did they cancel the meeting for tomorrow afternoon?\nB: Not to my knowledge. I still have it on my calendar.\nA: Oh, weird. I heard a rumor in the breakroom.\nB: Let me double-check the email just in case.\nA: Thanks, I don't want to show up to an empty room.\nB: Nope, still scheduled. We're good to go.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 699,
    "primary": "Lost cause.",
    "meaning": "노답이야.",
    "similar": [
      "There's no hope for that.",
      "It's a hopeless situation.",
      "Beyond saving at this point.",
      "Total waste of time trying to fix it.",
      "It's a goner, honestly."
    ],
    "example": "A: Do you think we can still fix this old laptop?\nB: Honestly? It's a lost cause. The motherboard is fried.\nA: But I have all my old photos on there!\nB: We might be able to save the hard drive, but the laptop's done.\nA: Ugh, that's such a bummer. I loved this thing.\nB: Time to upgrade to something that actually works.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  }
]
