[
  {
    "id": 680,
    "primary": "I got LASIK.",
    "meaning": "나 라식 했어.",
    "similar": [
      "I had laser eye surgery.",
      "I got my vision corrected.",
      "I finally ditched the glasses.",
      "I went under the laser.",
      "I got my eyes zapped."
    ],
    "example": "A: Yo, you're not wearing your glasses today. What's up with that?\nB: Oh, I finally did it. I got LASIK over the weekend.\nA: No way! How was it? Was it scary?\nB: Honestly, it was super quick. Just a bit weird seeing the laser.\nA: Can you actually see everything clearly now?\nB: It's like I'm seeing the world in 4K. Best decision ever.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 681,
    "primary": "How long is the wait?",
    "meaning": "얼마나 더 기다려야 돼요?",
    "similar": [
      "What’s the wait time looking like?",
      "How much longer for a table?",
      "Is it gonna be a minute?",
      "How long is the backup?",
      "Are we looking at a long wait?"
    ],
    "example": "A: Excuse me, we have a reservation for two.\nB: Welcome! We're just clearing a spot for you.\nA: No rush, but how long is the wait roughly?\nB: It should be about ten minutes. Would you like a drink while you wait?\nA: That sounds good. We'll just hang out by the bar.\nB: Perfect, I'll come grab you as soon as it's ready.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 682,
    "primary": "Nature calls.",
    "meaning": "화장실이 급해요.",
    "similar": [
      "I gotta hit the head.",
      "Bathroom break, real quick.",
      "I need to use the facilities.",
      "Duty calls.",
      "I'll be right back, gotta go."
    ],
    "example": "A: Hey, we're about to start the movie. You ready?\nB: Hold up, nature calls. I gotta run to the bathroom.\nA: Again? We literally just got here!\nB: I know, I know. Too much iced coffee on the way.\nA: Fine, just hurry up before the trailers end.\nB: I'll be back in a flash. Don't start without me!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 683,
    "primary": "Drop me off there.",
    "meaning": "저기서 내려주세요.",
    "similar": [
      "You can let me out right there.",
      "Just pull over by the corner.",
      "That spot is perfect, thanks.",
      "I'll jump out right here.",
      "Can you leave me at the entrance?"
    ],
    "example": "A: Where exactly do you need to go in this area?\nB: Oh, see that coffee shop? Just drop me off there.\nA: Are you sure? I can bring you closer to the door.\nB: No, this is perfect. I need to grab a latte anyway.\nA: Alright then, stay safe out there.\nB: Thanks for the ride! Catch you later.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 684,
    "primary": "You look better in person.",
    "meaning": "실물이 더 나으시네요.",
    "similar": [
      "Photos don't do you justice.",
      "You're even more stunning IRL.",
      "Wow, you look great off-camera.",
      "I definitely prefer the real you.",
      "You have a much better vibe in person."
    ],
    "example": "A: Finally, we meet! I was starting to think you were a bot.\nB: Haha, nope! Real human here. How do I look?\nA: Honestly? You look better in person than in your profile pics.\nB: Oh, stop it! You're making me blush.\nA: I'm serious. The lighting in those photos was trash.\nB: Well, I'm glad the real version passed the test!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 685,
    "primary": "Could you make that two, please?",
    "meaning": "같은 걸로 하나 더 주세요.",
    "similar": [
      "I'll have what they're having.",
      "Make it a double.",
      "Can I get another one of those?",
      "Same for me, please.",
      "I'll take two of those."
    ],
    "example": "A: I'll have the spicy margarita, please.\nB: That's a great choice. And for you, sir?\nC: Actually, could you make that two, please?\nB: You got it. Two spicy margaritas coming right up.\nA: Good call, these are the best in the city.\nC: I was thinking the same thing after the first sip.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 686,
    "primary": "Keep your voice down.",
    "meaning": "목소리 좀 낮춰.",
    "similar": [
      "Lower your volume a bit.",
      "Shhh, not so loud.",
      "Keep it on the low.",
      "Try to whisper.",
      "Watch your volume."
    ],
    "example": "A: DUDE, YOU WON'T BELIEVE WHAT I JUST HEARD!\nB: Whoa, relax! Keep your voice down, everyone's looking.\nA: Sorry, I'm just so hyped about the news.\nB: I get it, but we're in a library, not a stadium.\nA: Right, my bad. Let me tell you quietly.\nB: Much better. Now, what's the big secret?",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 687,
    "primary": "Walk it off.",
    "meaning": "바람 좀 쐬고 와.",
    "similar": [
      "Go get some fresh air.",
      "Clear your head with a walk.",
      "Take a lap and cool down.",
      "Just shake it off.",
      "Go for a stroll to feel better."
    ],
    "example": "A: I'm so stressed out about this presentation tomorrow.\nB: You've been staring at that screen for hours. Walk it off.\nA: I don't have time! I need to finish this slide.\nB: Trust me, ten minutes of fresh air will do wonders.\nA: Maybe you're right. My head is spinning.\nB: Go on, I'll have a snack ready when you get back.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 688,
    "primary": "I tossed and turned all night.",
    "meaning": "밤새 뒤척였어요.",
    "similar": [
      "I couldn't sleep a wink.",
      "I was restless all night.",
      "Sleep just wouldn't come.",
      "I had a rough night's sleep.",
      "I kept waking up every hour."
    ],
    "example": "A: You look exhausted. Rough night?\nB: Tell me about it. I tossed and turned all night.\nA: Was it the coffee you had late yesterday?\nB: Probably, or maybe just thinking about the move.\nA: That's the worst. Did you try any white noise?\nB: I tried everything, but my brain wouldn't shut off.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 689,
    "primary": "I have two left feet.",
    "meaning": "나 몸치예요.",
    "similar": [
      "I can't dance to save my life.",
      "I'm super clumsy on the floor.",
      "I've got zero rhythm.",
      "Dancing isn't really my thing.",
      "I'm a total klutz when it comes to moves."
    ],
    "example": "A: Hey, come out to the dance floor with us!\nB: No way, I have two left feet. I'll just embarrass myself.\nA: Don't worry about it, nobody's actually watching.\nB: Easy for you to say, you actually have moves!\nA: Just move with the beat. It's not that deep.\nB: Trust me, I'll just end up stepping on someone's toes.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  }
]
