[
  {
    "id": 680,
    "primary": "I got LASIK.",
    "meaning": "나 라식 했어.",
    "similar": [
      "I had laser eye surgery.",
      "I got my vision corrected.",
      "I finally ditched the glasses.",
      "I went under the laser.",
      "I got my eyes zapped."
    ],
    "example": "A: Yo, you're not wearing your glasses today. What's up with that?\nB: Oh, I finally did it. I got LASIK over the weekend.\nA: No way! How was it? Was it scary?\nB: Honestly, it was super quick. Just a bit weird seeing the laser.\nA: Can you actually see everything clearly now?\nB: It's like I'm seeing the world in 4K. Best decision ever.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 681,
    "primary": "How long is the wait?",
    "meaning": "얼마나 더 기다려야 돼요?",
    "similar": [
      "What’s the wait time looking like?",
      "How much longer for a table?",
      "Is it gonna be a minute?",
      "How long is the backup?",
      "Are we looking at a long wait?"
    ],
    "example": "A: Excuse me, we have a reservation for two.\nB: Welcome! We're just clearing a spot for you.\nA: No rush, but how long is the wait roughly?\nB: It should be about ten minutes. Would you like a drink while you wait?\nA: That sounds good. We'll just hang out by the bar.\nB: Perfect, I'll come grab you as soon as it's ready.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 682,
    "primary": "Nature calls.",
    "meaning": "화장실이 급해요.",
    "similar": [
      "I gotta hit the head.",
      "Bathroom break, real quick.",
      "I need to use the facilities.",
      "Duty calls.",
      "I'll be right back, gotta go."
    ],
    "example": "A: Hey, we're about to start the movie. You ready?\nB: Hold up, nature calls. I gotta run to the bathroom.\nA: Again? We literally just got here!\nB: I know, I know. Too much iced coffee on the way.\nA: Fine, just hurry up before the trailers end.\nB: I'll be back in a flash. Don't start without me!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 683,
    "primary": "Drop me off there.",
    "meaning": "저기서 내려주세요.",
    "similar": [
      "You can let me out right there.",
      "Just pull over by the corner.",
      "That spot is perfect, thanks.",
      "I'll jump out right here.",
      "Can you leave me at the entrance?"
    ],
    "example": "A: Where exactly do you need to go in this area?\nB: Oh, see that coffee shop? Just drop me off there.\nA: Are you sure? I can bring you closer to the door.\nB: No, this is perfect. I need to grab a latte anyway.\nA: Alright then, stay safe out there.\nB: Thanks for the ride! Catch you later.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 684,
    "primary": "You look better in person.",
    "meaning": "실물이 더 나으시네요.",
    "similar": [
      "Photos don't do you justice.",
      "You're even more stunning IRL.",
      "Wow, you look great off-camera.",
      "I definitely prefer the real you.",
      "You have a much better vibe in person."
    ],
    "example": "A: Finally, we meet! I was starting to think you were a bot.\nB: Haha, nope! Real human here. How do I look?\nA: Honestly? You look better in person than in your profile pics.\nB: Oh, stop it! You're making me blush.\nA: I'm serious. The lighting in those photos was trash.\nB: Well, I'm glad the real version passed the test!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 685,
    "primary": "Could you make that two, please?",
    "meaning": "같은 걸로 하나 더 주세요.",
    "similar": [
      "I'll have what they're having.",
      "Make it a double.",
      "Can I get another one of those?",
      "Same for me, please.",
      "I'll take two of those."
    ],
    "example": "A: I'll have the spicy margarita, please.\nB: That's a great choice. And for you, sir?\nC: Actually, could you make that two, please?\nB: You got it. Two spicy margaritas coming right up.\nA: Good call, these are the best in the city.\nC: I was thinking the same thing after the first sip.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 686,
    "primary": "Keep your voice down.",
    "meaning": "목소리 좀 낮춰.",
    "similar": [
      "Lower your volume a bit.",
      "Shhh, not so loud.",
      "Keep it on the low.",
      "Try to whisper.",
      "Watch your volume."
    ],
    "example": "A: DUDE, YOU WON'T BELIEVE WHAT I JUST HEARD!\nB: Whoa, relax! Keep your voice down, everyone's looking.\nA: Sorry, I'm just so hyped about the news.\nB: I get it, but we're in a library, not a stadium.\nA: Right, my bad. Let me tell you quietly.\nB: Much better. Now, what's the big secret?",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 687,
    "primary": "Walk it off.",
    "meaning": "바람 좀 쐬고 와.",
    "similar": [
      "Go get some fresh air.",
      "Clear your head with a walk.",
      "Take a lap and cool down.",
      "Just shake it off.",
      "Go for a stroll to feel better."
    ],
    "example": "A: I'm so stressed out about this presentation tomorrow.\nB: You've been staring at that screen for hours. Walk it off.\nA: I don't have time! I need to finish this slide.\nB: Trust me, ten minutes of fresh air will do wonders.\nA: Maybe you're right. My head is spinning.\nB: Go on, I'll have a snack ready when you get back.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 688,
    "primary": "I tossed and turned all night.",
    "meaning": "밤새 뒤척였어요.",
    "similar": [
      "I couldn't sleep a wink.",
      "I was restless all night.",
      "Sleep just wouldn't come.",
      "I had a rough night's sleep.",
      "I kept waking up every hour."
    ],
    "example": "A: You look exhausted. Rough night?\nB: Tell me about it. I tossed and turned all night.\nA: Was it the coffee you had late yesterday?\nB: Probably, or maybe just thinking about the move.\nA: That's the worst. Did you try any white noise?\nB: I tried everything, but my brain wouldn't shut off.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 689,
    "primary": "I have two left feet.",
    "meaning": "나 몸치예요.",
    "similar": [
      "I can't dance to save my life.",
      "I'm super clumsy on the floor.",
      "I've got zero rhythm.",
      "Dancing isn't really my thing.",
      "I'm a total klutz when it comes to moves."
    ],
    "example": "A: Hey, come out to the dance floor with us!\nB: No way, I have two left feet. I'll just embarrass myself.\nA: Don't worry about it, nobody's actually watching.\nB: Easy for you to say, you actually have moves!\nA: Just move with the beat. It's not that deep.\nB: Trust me, I'll just end up stepping on someone's toes.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 690,
    "primary": "My face is breaking out.",
    "meaning": "피부가 뒤집어졌어요.",
    "similar": [
      "I'm having a massive breakout.",
      "My skin is going crazy right now.",
      "I've got pimples popping up everywhere.",
      "My complexion is currently a mess.",
      "I'm dealing with some serious acne suddeny."
    ],
    "example": "A: Are you okay? You're wearing a lot of foundation today.\nB: Ugh, my face is breaking out like crazy. I hate it.\nA: Is it the new skincare product you tried?\nB: Probably. Or just the stress from finals week.\nA: Drink more water, it might help clear it up.\nB: I'm trying everything, but nothing seems to work.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 691,
    "primary": "I want some time off.",
    "meaning": "좀 쉬고 싶어요.",
    "similar": [
      "I need a serious break.",
      "I'm dying for a vacation.",
      "I just want to unplug for a bit.",
      "I'm overdue for some 'me time'.",
      "I need to step away from work."
    ],
    "example": "A: You've been working late every night this month.\nB: I know. I'm so burnt out. I want some time off.\nA: Why don't you talk to the boss about a long weekend?\nB: I'm planning to. I just need to finish this project first.\nA: Don't wait too long, your health is more important.\nB: You're right. I'm booking a flight as soon as this is done.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 692,
    "primary": "I'm not good with my hands.",
    "meaning": "나 똥손이야.",
    "similar": [
      "I'm total klutz at DIY stuff.",
      "I can't build anything to save my life.",
      "Handy work isn't my forte.",
      "I'm pretty clumsy with tools.",
      "I'm not exactly a craftsman."
    ],
    "example": "A: Can you help me assemble this IKEA bookshelf?\nB: Honestly? I'm not good with my hands. I'll probably break it.\nA: Come on, it's just a few screws and some wood.\nB: Last time I tried, I ended up with a crooked table.\nA: Okay, maybe you just hold the instructions then.\nB: That, I can definitely do. Let's get started.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 693,
    "primary": "I have a nosebleed.",
    "meaning": "코피가 나요.",
    "similar": [
      "My nose is bleeding.",
      "Get me a tissue, quick!",
      "I've got a bloody nose.",
      "Something's wrong with my nose.",
      "Help, my nose is dripping blood."
    ],
    "example": "A: Hey, are you okay? Your shirt has a stain on it.\nB: Wait, what? Oh no, I have a nosebleed!\nA: Lean forward and pinch your nose. Don't tilt back!\nB: Thanks, I don't know why this happened suddenly.\nA: It's probably just the dry air in this office.\nB: Yeah, I should probably get a humidifier for my desk.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 694,
    "primary": "I'm pooped.",
    "meaning": "완전 지쳤어.",
    "similar": [
      "I'm completely drained.",
      "I'm exhausted beyond belief.",
      "I'm ready to pass out.",
      "I've got zero energy left.",
      "I'm totally wiped out."
    ],
    "example": "A: Want to go for a run this evening?\nB: No way, I'm pooped after that hike today.\nA: It wasn't even that long! Where's your stamina?\nB: My legs are like jelly, dude. I'm staying on this couch.\nA: Fine, I'll just go by myself then.\nB: Enjoy! I'll be right here when you get back.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 695,
    "primary": "I'm tone-deaf.",
    "meaning": "나 음치야.",
    "similar": [
      "I can't carry a tune.",
      "I'm terrible at singing.",
      "My singing voice is a nightmare.",
      "I have no ear for music.",
      "Kareoke is my worst enemy."
    ],
    "example": "A: Let's go to that new karaoke bar tonight!\nB: Oh man, you know I'm tone-deaf, right?\nA: It doesn't matter! That's the whole point of karaoke.\nB: For you, maybe. For me, it's just pure embarrassment.\nA: Just pick a song you know by heart. It'll be fine.\nB: Alright, but don't say I didn't warn you when I start.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 696,
    "primary": "It's been a little hectic.",
    "meaning": "정신없이 바빴어.",
    "similar": [
      "Things have been crazy lately.",
      "I've been juggling a lot.",
      "It's been a whirlwind week.",
      "I haven't had a second to breathe.",
      "Life's been a bit of a mess recently."
    ],
    "example": "A: Long time no see! How have you been lately?\nB: Honestly? It's been a little hectic with the new job.\nA: I bet! Are you settling in okay though?\nB: Yeah, but there's just so much to learn at once.\nA: Take it one day at a time. You'll get there.\nB: Thanks, I'm definitely trying to keep my head up.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 697,
    "primary": "It bugs me.",
    "meaning": "그거 신경 쓰여요.",
    "similar": [
      "That's really annoying.",
      "It's getting under my skin.",
      "It's driving me a bit crazy.",
      "I can't stop thinking about it.",
      "It's bothering me quite a bit."
    ],
    "example": "A: Did you see that typo in the final report?\nB: Yeah, but it's not a big deal. The client won't care.\nA: I know, but it bugs me every time I look at it.\nB: You're such a perfectionist. Just let it go.\nA: I can't. I'm going to fix it and resend it.\nB: Whatever makes you sleep better at night, I guess.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 698,
    "primary": "Not to my knowledge.",
    "meaning": "내가 알기로는 아니야.",
    "similar": [
      "Not as far as I know.",
      "I haven't heard anything like that.",
      "That's news to me if it's true.",
      "I don't think that's the case.",
      "I haven't been informed otherwise."
    ],
    "example": "A: Did they cancel the meeting for tomorrow afternoon?\nB: Not to my knowledge. I still have it on my calendar.\nA: Oh, weird. I heard a rumor in the breakroom.\nB: Let me double-check the email just in case.\nA: Thanks, I don't want to show up to an empty room.\nB: Nope, still scheduled. We're good to go.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 699,
    "primary": "Lost cause.",
    "meaning": "노답이야.",
    "similar": [
      "There's no hope for that.",
      "It's a hopeless situation.",
      "Beyond saving at this point.",
      "Total waste of time trying to fix it.",
      "It's a goner, honestly."
    ],
    "example": "A: Do you think we can still fix this old laptop?\nB: Honestly? It's a lost cause. The motherboard is fried.\nA: But I have all my old photos on there!\nB: We might be able to save the hard drive, but the laptop's done.\nA: Ugh, that's such a bummer. I loved this thing.\nB: Time to upgrade to something that actually works.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 700,
    "primary": "That's a blast from the past.",
    "meaning": "와, 추억 돋네.",
    "similar": [
      "That brings back memories!",
      "Wow, talk about a throwback.",
      "I haven't seen that in ages!",
      "That's so nostalgic.",
      "A total trip down memory lane."
    ],
    "example": "A: Look what I found in my attic! It's our old high school yearbook.\nB: Whoa, that's a blast from the past! Look at our hairstyles!\nA: Right? I completely forgot I ever looked like that.\nB: We were so young and clueless back then.\nA: Honestly, it's kinda nice to see all these old faces.\nB: Definitely. Let's look through it while we have lunch.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 701,
    "primary": "My lips are sealed.",
    "meaning": "입 무거워.",
    "similar": [
      "I won't say a word.",
      "Your secret is safe with me.",
      "I'm taking it to the grave.",
      "I'm keeping it on the down-low.",
      "Trust me, I'm a vault."
    ],
    "example": "A: You can't tell anyone about the surprise party, okay?\nB: Don't worry, my lips are sealed. I won't breathe a word.\nA: I'm serious, if he finds out, it's ruined.\nB: I get it! I'm the most trustworthy person you know.\nA: Good. I'll text you the details later tonight.\nB: Perfect. Consider it a top-secret mission.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 702,
    "primary": "Hit the books.",
    "meaning": "열공하다.",
    "similar": [
      "Time to study hard.",
      "I've got to cram for this exam.",
      "Gonna be buried in books all night.",
      "Time to get my head in the game.",
      "I need to grind for this test."
    ],
    "example": "A: Want to grab some coffee later this afternoon?\nB: I wish, but I really need to hit the books for my final.\nA: Is it that hard? You usually ace everything.\nB: This one is a nightmare. I need all the time I can get.\nA: Fair enough. Good luck with the studying!\nB: Thanks, I'm gonna need all the luck I can find.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 703,
    "primary": "I spaced out.",
    "meaning": "멍 때렸어.",
    "similar": [
      "I was totally daydreaming.",
      "My mind went blank for a second.",
      "I lost track of what was happening.",
      "I was in my own world.",
      "I went into a trance there."
    ],
    "example": "A: Did you hear anything I just said about the project?\nB: Honestly? I spaced out for a bit. Can you repeat that?\nA: Come on! It's the most important part of the plan.\nB: My bad, I just got distracted by something outside.\nA: Focus, dude. We need to get this done today.\nB: You're right. I'm all ears now. Proceed.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 704,
    "primary": "Do you guys carry Nike?",
    "meaning": "나이키 제품 취급하나요?",
    "similar": [
      "Do you sell Nike shoes here?",
      "Is Nike available in your store?",
      "Do you have any Nike gear in stock?",
      "Can I find Nike products at this location?",
      "Are you an authorized Nike retailer?"
    ],
    "example": "A: Welcome! Is there anything specific you're looking for?\nB: Yeah, quick question: do you guys carry Nike?\nA: We do! They're right over in the athletic section.\nB: Awesome. I'm looking for the new running shoes.\nA: Follow me, I'll show you exactly where they are.\nB: Perfect, thanks for the help.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 705,
    "primary": "Can you tell?",
    "meaning": "티 나?",
    "similar": [
      "Is it obvious?",
      "Can you see it clearly?",
      "Does it stand out much?",
      "Is it noticeable to everyone?",
      "Can you pick up on it?"
    ],
    "example": "A: I tried a new self-tanner last night. Can you tell?\nB: Honestly? It looks totally natural. I wouldn't have known.\nA: Really? I was worried it looked too orange.\nB: Not at all. You just look like you spent a day at the beach.\nA: Phew, such a relief. I was stressing about it all morning.\nB: Don't sweat it, you look great!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 706,
    "primary": "He is full of himself.",
    "meaning": "걔 너무 자아도취야.",
    "similar": [
      "He's got a huge ego.",
      "He's totally stuck on himself.",
      "He thinks he's the center of the universe.",
      "He's incredibly arrogant.",
      "He's always bragging about something."
    ],
    "example": "A: Have you talked to Mark lately? He's gotten so annoying.\nB: Tell me about it. He is so full of himself these days.\nA: All he talks about is his new car and his promotion.\nB: I know, it's like nobody else's life matters to him.\nA: I'm starting to avoid his calls altogether.\nB: Same here. I don't have time for that kind of energy.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 707,
    "primary": "Do you happen to know?",
    "meaning": "혹시 아세요?",
    "similar": [
      "By any chance, do you know?",
      "Do you have any idea about...?",
      "Would you happen to have information on...?",
      "Is it something you're familiar with?",
      "Could you tell me if...?"
    ],
    "example": "A: Excuse me, do you happen to know where the subway is?\nB: Yeah, it's just two blocks down that way on the left.\nA: Awesome, thanks! Is it usually crowded this time of day?\nB: Usually, yeah. It's rush hour right now.\nA: Got it. I'll probably just walk then. Thanks again!\nB: Any time. Have a safe one!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 708,
    "primary": "It's fattening.",
    "meaning": "그거 살쪄.",
    "similar": [
      "That's high in calories.",
      "It's not exactly diet-friendly.",
      "That will definitely go to your hips.",
      "It's pretty indulgent, isn't it?",
      "It's a bit of a calorie bomb."
    ],
    "example": "A: This chocolate cake looks absolutely incredible.\nB: I know, but it's so fattening. We probably shouldn't.\nA: Come on, it's a special occasion! Just one slice?\nB: Fine, but we have to share it. No eating a whole one.\nA: Deal. I'll go grab two forks for us.\nB: You're a bad influence, you know that?",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 709,
    "primary": "Give her my best.",
    "meaning": "그녀에게 안부 전해줘.",
    "similar": [
      "Send her my regards.",
      "Tell her I said hi.",
      "Give her a big hug for me.",
      "Wish her the best from me.",
      "Tell her I'm thinking of her."
    ],
    "example": "A: I'm heading out to visit Sarah in the hospital now.\nB: Tell her I hope she feels better soon. Give her my best.\nA: I will. She'll be glad to hear from you.\nB: I'll try to stop by tomorrow if I can.\nA: That would be great. She needs some company.\nB: Alright, safe travels! Talk to you later.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 710,
    "primary": "Dressed to kill.",
    "meaning": "아주 쫙 빼입었네.",
    "similar": [
      "Looking sharp as a tack.",
      "Totally decked out for the night.",
      "Dressed to impress everyone.",
      "Looking absolutely stunning.",
      "All dolled up for the occasion."
    ],
    "example": "A: Whoa, check you out! You're dressed to kill tonight.\nB: Thanks! I wanted to make a good impression at the event.\nA: Well, you definitely nailed it. That suit is fire.\nB: I actually just got it last week. Glad it fits well.\nA: Ready to head out and turn some heads?\nB: You bet. Let's get this show on the road.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 711,
    "primary": "Because I can.",
    "meaning": "내 마음이야.",
    "similar": [
      "Just because I feel like it.",
      "None of your business why.",
      "I'm my own boss, that's why.",
      "It's just how I roll.",
      "No explanation needed."
    ],
    "example": "A: Why are you wearing sunglasses indoors? It's literally midnight.\nB: Because I can. Plus, it completes the look.\nA: You look ridiculous, you know that, right?\nB: Maybe, but I'm comfortable, and that's all that matters.\nA: I guess there's no arguing with that logic.\nB: Exactly. Now, pass me that drink.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 712,
    "primary": "Just because.",
    "meaning": "그냥.",
    "similar": [
      "No particular reason.",
      "Just for the heck of it.",
      "I just felt like it, okay?",
      "It's just one of those things.",
      "Just because I wanted to."
    ],
    "example": "A: Why did you suddenly decide to dye your hair blue?\nB: I don't know, just because. I needed a change.\nA: It actually looks pretty cool on you.\nB: Thanks! I was worried it might be too much.\nA: Nah, it's a vibe. Very bold move.\nB: I'm glad I did it then. No regrets!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 713,
    "primary": "First come, first served.",
    "meaning": "선착순.",
    "similar": [
      "It's a first-in, first-out deal.",
      "Whoever gets here first gets the spot.",
      "No reservations, it's a free-for-all.",
      "Early birds get the best seats.",
      "Subject to availability on arrival."
    ],
    "example": "A: Can we book a table for ten people tonight?\nB: Sorry, we don't take bookings. It's first come, first served.\nA: What time should we get there to be safe?\nB: I'd suggest around 6 PM before the rush starts.\nA: Alright, we'll try to get the whole group there early.\nB: Sounds good. We'll be ready for you whenever you arrive.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 714,
    "primary": "It was all for nothing.",
    "meaning": "괜히 했어.",
    "similar": [
      "A total waste of effort.",
      "It didn't lead to anything at all.",
      "Complete exercise in futility.",
      "All that hard work for zero results.",
      "Turned out to be a pointless task."
    ],
    "example": "A: Did you finally get the approval for that project?\nB: No, they decided to scrap the whole thing today.\nA: Wait, so all that overtime we did was for nothing?\nB: Pretty much. Months of work just gone like that.\nA: That's incredibly frustrating. I can't believe it.\nB: Tell me about it. I'm taking the rest of the day off.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 715,
    "primary": "I can feel it in my bones.",
    "meaning": "느낌이 딱 와.",
    "similar": [
      "I've got a really strong gut feeling.",
      "I just know it's going to happen.",
      "Everything's pointing to this outcome.",
      "It's an undeniable feeling I have.",
      "I'm certain of it deep down."
    ],
    "example": "A: Do you really think they're going to hire you?\nB: Yes! I can feel it in my bones. The interview was perfect.\nA: I hope you're right, you've been wanting this for ages.\nB: I know, and everything just felt so right today.\nA: When are they supposed to let you know?\nB: By the end of the week. Keeping my fingers crossed!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 716,
    "primary": "Let's order in.",
    "meaning": "그냥 시켜 먹자.",
    "similar": [
      "Let's get some takeout tonight.",
      "I don't feel like cooking, let's use an app.",
      "How about some delivery for dinner?",
      "Let's just stay in and order food.",
      "I'm voting for a cozy night with pizza."
    ],
    "example": "A: What should we do for dinner tonight? Any ideas?\nB: I'm exhausted. Let's just order in and watch a movie.\nA: That sounds perfect. Mexican or Chinese?\nB: Definitely Mexican. I could go for some tacos right now.\nA: Done. I'll fire up the app and get it ordered.\nB: You're a life saver. I'm not moving from this couch.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 717,
    "primary": "Sue me.",
    "meaning": "배 째.",
    "similar": [
      "So what if I did? Deal with it.",
      "Take me to court then, I don't care.",
      "I'm not apologizing, so whatever.",
      "What are you gonna do about it?",
      "Go ahead and complain, see if I care."
    ],
    "example": "A: Did you really just finish the last of the milk?\nB: Yeah, I was thirsty. Sue me. I'll buy more later.\nA: You always do this! Now I can't have my cereal.\nB: It's not that deep, dude. There's a store right there.\nA: It's the principle of the matter! Respect the shared fridge.\nB: Fine, fine. I'm going out right now to replace it.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 718,
    "primary": "He is very low-key.",
    "meaning": "그 사람 아주 얌전해.",
    "similar": [
      "He's a pretty chill guy.",
      "He doesn't really like the spotlight.",
      "He keeps things very understated.",
      "He's fairly quiet and reserved.",
      "He's not one for big flashy displays."
    ],
    "example": "A: I'm nervous about meeting your brother today.\nB: Don't be! He is very low-key. You'll like him.\nA: Is he the type who talks a lot at first?\nB: Not at all. He mostly just listens and cracks jokes.\nA: Okay, that makes me feel much better.\nB: Honestly, he's probably more nervous than you are.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 719,
    "primary": "It's lit.",
    "meaning": "와, 쩐다!",
    "similar": [
      "That is absolutely fire!",
      "This place is incredible right now.",
      "Everything's just perfect tonight.",
      "Wow, talk about a great vibe.",
      "It's totally amazing in here."
    ],
    "example": "A: Check out this light show! It's absolutely lit.\nB: I know, right? This is the best concert ever!\nA: Look at everyone's energy! It's contagious.\nB: I'm so glad we decided to come tonight.\nA: Same here, this is definitely going on my highlights.\nB: For sure. Let's record a bit more before it ends.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 720,
    "primary": "It happens all the time.",
    "meaning": "늘 있는 일이야.",
    "similar": [
      "That's a regular occurrence around here.",
      "It's a daily thing, honestly.",
      "You get used to it after a while.",
      "Nothing unusual about that at all.",
      "It's just part of the routine."
    ],
    "example": "A: The subway broke down again this morning. I'm so late!\nB: Don't sweat it, it happens all the time in this city.\nA: I know, but it's still so frustrating every single time.\nB: You just gotta leave earlier or expect the worst.\nA: I guess so. I'm just sick of being stuck underground.\nB: Welcome to New York, my friend. Welcome to New York.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  }
]