[
  {
    "id": 710,
    "primary": "Dressed to kill.",
    "meaning": "아주 쫙 빼입었네.",
    "similar": [
      "Looking sharp as a tack.",
      "Totally decked out for the night.",
      "Dressed to impress everyone.",
      "Looking absolutely stunning.",
      "All dolled up for the occasion."
    ],
    "example": "A: Whoa, check you out! You're dressed to kill tonight.\nB: Thanks! I wanted to make a good impression at the event.\nA: Well, you definitely nailed it. That suit is fire.\nB: I actually just got it last week. Glad it fits well.\nA: Ready to head out and turn some heads?\nB: You bet. Let's get this show on the road.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 711,
    "primary": "Because I can.",
    "meaning": "내 마음이야.",
    "similar": [
      "Just because I feel like it.",
      "None of your business why.",
      "I'm my own boss, that's why.",
      "It's just how I roll.",
      "No explanation needed."
    ],
    "example": "A: Why are you wearing sunglasses indoors? It's literally midnight.\nB: Because I can. Plus, it completes the look.\nA: You look ridiculous, you know that, right?\nB: Maybe, but I'm comfortable, and that's all that matters.\nA: I guess there's no arguing with that logic.\nB: Exactly. Now, pass me that drink.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 712,
    "primary": "Just because.",
    "meaning": "그냥.",
    "similar": [
      "No particular reason.",
      "Just for the heck of it.",
      "I just felt like it, okay?",
      "It's just one of those things.",
      "Just because I wanted to."
    ],
    "example": "A: Why did you suddenly decide to dye your hair blue?\nB: I don't know, just because. I needed a change.\nA: It actually looks pretty cool on you.\nB: Thanks! I was worried it might be too much.\nA: Nah, it's a vibe. Very bold move.\nB: I'm glad I did it then. No regrets!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 713,
    "primary": "First come, first served.",
    "meaning": "선착순.",
    "similar": [
      "It's a first-in, first-out deal.",
      "Whoever gets here first gets the spot.",
      "No reservations, it's a free-for-all.",
      "Early birds get the best seats.",
      "Subject to availability on arrival."
    ],
    "example": "A: Can we book a table for ten people tonight?\nB: Sorry, we don't take bookings. It's first come, first served.\nA: What time should we get there to be safe?\nB: I'd suggest around 6 PM before the rush starts.\nA: Alright, we'll try to get the whole group there early.\nB: Sounds good. We'll be ready for you whenever you arrive.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 714,
    "primary": "It was all for nothing.",
    "meaning": "괜히 했어.",
    "similar": [
      "A total waste of effort.",
      "It didn't lead to anything at all.",
      "Complete exercise in futility.",
      "All that hard work for zero results.",
      "Turned out to be a pointless task."
    ],
    "example": "A: Did you finally get the approval for that project?\nB: No, they decided to scrap the whole thing today.\nA: Wait, so all that overtime we did was for nothing?\nB: Pretty much. Months of work just gone like that.\nA: That's incredibly frustrating. I can't believe it.\nB: Tell me about it. I'm taking the rest of the day off.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 715,
    "primary": "I can feel it in my bones.",
    "meaning": "느낌이 딱 와.",
    "similar": [
      "I've got a really strong gut feeling.",
      "I just know it's going to happen.",
      "Everything's pointing to this outcome.",
      "It's an undeniable feeling I have.",
      "I'm certain of it deep down."
    ],
    "example": "A: Do you really think they're going to hire you?\nB: Yes! I can feel it in my bones. The interview was perfect.\nA: I hope you're right, you've been wanting this for ages.\nB: I know, and everything just felt so right today.\nA: When are they supposed to let you know?\nB: By the end of the week. Keeping my fingers crossed!",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 716,
    "primary": "Let's order in.",
    "meaning": "그냥 시켜 먹자.",
    "similar": [
      "Let's get some takeout tonight.",
      "I don't feel like cooking, let's use an app.",
      "How about some delivery for dinner?",
      "Let's just stay in and order food.",
      "I'm voting for a cozy night with pizza."
    ],
    "example": "A: What should we do for dinner tonight? Any ideas?\nB: I'm exhausted. Let's just order in and watch a movie.\nA: That sounds perfect. Mexican or Chinese?\nB: Definitely Mexican. I could go for some tacos right now.\nA: Done. I'll fire up the app and get it ordered.\nB: You're a life saver. I'm not moving from this couch.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 717,
    "primary": "Sue me.",
    "meaning": "배 째.",
    "similar": [
      "So what if I did? Deal with it.",
      "Take me to court then, I don't care.",
      "I'm not apologizing, so whatever.",
      "What are you gonna do about it?",
      "Go ahead and complain, see if I care."
    ],
    "example": "A: Did you really just finish the last of the milk?\nB: Yeah, I was thirsty. Sue me. I'll buy more later.\nA: You always do this! Now I can't have my cereal.\nB: It's not that deep, dude. There's a store right there.\nA: It's the principle of the matter! Respect the shared fridge.\nB: Fine, fine. I'm going out right now to replace it.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 718,
    "primary": "He is very low-key.",
    "meaning": "그 사람 아주 얌전해.",
    "similar": [
      "He's a pretty chill guy.",
      "He doesn't really like the spotlight.",
      "He keeps things very understated.",
      "He's fairly quiet and reserved.",
      "He's not one for big flashy displays."
    ],
    "example": "A: I'm nervous about meeting your brother today.\nB: Don't be! He is very low-key. You'll like him.\nA: Is he the type who talks a lot at first?\nB: Not at all. He mostly just listens and cracks jokes.\nA: Okay, that makes me feel much better.\nB: Honestly, he's probably more nervous than you are.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 719,
    "primary": "It's lit.",
    "meaning": "와, 쩐다!",
    "similar": [
      "That is absolutely fire!",
      "This place is incredible right now.",
      "Everything's just perfect tonight.",
      "Wow, talk about a great vibe.",
      "It's totally amazing in here."
    ],
    "example": "A: Check out this light show! It's absolutely lit.\nB: I know, right? This is the best concert ever!\nA: Look at everyone's energy! It's contagious.\nB: I'm so glad we decided to come tonight.\nA: Same here, this is definitely going on my highlights.\nB: For sure. Let's record a bit more before it ends.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  },
  {
    "id": 720,
    "primary": "It happens all the time.",
    "meaning": "늘 있는 일이야.",
    "similar": [
      "That's a regular occurrence around here.",
      "It's a daily thing, honestly.",
      "You get used to it after a while.",
      "Nothing unusual about that at all.",
      "It's just part of the routine."
    ],
    "example": "A: The subway broke down again this morning. I'm so late!\nB: Don't sweat it, it happens all the time in this city.\nA: I know, but it's still so frustrating every single time.\nB: You just gotta leave earlier or expect the worst.\nA: I guess so. I'm just sick of being stuck underground.\nB: Welcome to New York, my friend. Welcome to New York.",
    "updatedAt": "2025-12-28T09:37:00.000Z"
  }
]
