[
  {
    "primary": "midlife crisis",
    "meaning": "40~50대에 오는 인생 권태기나 정체성 혼란",
    "similar": ["Midlife transition", "Second adolescence", "Identity reboot", "Existential funk", "Midlife awakening"],
    "example": "A: I think my dad's having a midlife crisis, he just bought a Tesla.\nB: For real? That's so cliche, but honestly, let him live.\nA: I guess it's better than him just being depressed and stuck in a rut.\nB: Exactly, sometimes you just need to blow some cash to feel alive.\nA: True, but he's also talking about quitting his job to become a DJ.\nB: Okay, that definitely sounds like a midlife crisis in full swing."
  },
  {
    "primary": "life stages and transitions",
    "meaning": "인생의 변곡점이나 성장 단계 (사춘기, 갱년기 등)",
    "similar": ["Life pivot", "New chapter", "Evolutionary phase", "Personal journey", "Major turning point"],
    "example": "A: Moving to NYC feels like such a major life transition for me.\nB: It really is, you're basically hitting the reset button on everything.\nA: I'm nervous, but I feel like I'm finally entering a new chapter.\nB: That's the vibe! Most people just stay stuck in their comfort zone.\nA: I didn't want to look back at 40 and regret not taking the leap.\nB: You're evolving, and that's exactly what life's about, no cap."
  },
  {
    "primary": "I've been meaning to tell you",
    "meaning": "예전부터 말하려고 했는데 (이제서야 말하네)",
    "similar": ["I've been wanting to bring this up", "I meant to mention this", "I've had this on my mind for a bit", "I was gonna tell you earlier", "I've been holding this in"],
    "example": "A: Hey, I’ve been meaning to tell you, your new haircut looks fire.\nB: Oh, thank you! I was honestly so nervous about going this short.\nA: It totally suits your vibe, I should have said something sooner.\nB: No worries, I’m just glad I didn't mess up my entire look.\nA: Nah, you’re killing it. I might actually steal your stylist's info.\nB: Say less, I'll text you her handle right now."
  },
  {
    "primary": "spiritual awakening (monk-like mindset)",
    "meaning": "내면을 깊이 성찰하며 얻는 정신적 깨달음",
    "similar": ["Higher consciousness", "Soul searching", "Ego death", "Inner zen", "Finding enlightenment"],
    "example": "A: I noticed you've been way more low-key lately, what's up?\nB: Honestly, I went on this meditation retreat and had a total spiritual awakening.\nA: Wait, deadass? You’re like a whole different person now.\nB: I just realized I was chasing the wrong things for way too long.\nA: That's deep. So you're basically a monk now, just less robes?\nB: Haha, pretty much. I'm just focused on my inner peace these days."
  },
  {
    "primary": "cured mackerel",
    "meaning": "소금이나 식초로 절여 숙성시킨 고등어 (시메사바 등)",
    "similar": ["Aged mackerel", "Pickled bluefish", "Vinegar-prepped mackerel", "Salt-cured fillet", "Shime-saba style"],
    "example": "A: Have you tried the cured mackerel at that new omakase spot?\nB: Not yet, I usually find mackerel a bit too fishy for me.\nA: This one is different, the curing process makes it so buttery.\nB: Really? If it’s vinegar-heavy, I might actually give it a shot.\nA: It’s the perfect balance of salty and tangy, you'll love it.\nB: Alright, you convinced me. Let's book a table for next week."
  },
  {
    "primary": "She's all grown up",
    "meaning": "우리 애 정밀 많이 컸다 (벌써 숙녀 다 됐네)",
    "similar": ["She's a young lady now", "She's blossomed", "She's not my baby anymore", "She's come into her own", "She's matured so much"],
    "example": "A: I saw your daughter's prom pics, she's all grown up!\nB: I know, it feels like just yesterday I was dropping her at daycare.\nA: Time literally flies, she looks so sophisticated in that dress.\nB: She really does. She's starting to act way more mature lately too.\nA: It's a bit bittersweet though, isn't it? Her leaving for college soon.\nB: Definitely. I'm proud of her, but I'm gonna miss my little girl."
  },
  {
    "primary": "Get a life",
    "meaning": "니 인생이나 똑바로 살아라 (남 참견하지 말고)",
    "similar": ["Do something productive", "Find a hobby", "Go touch some grass", "Stop being so obsessed", "Check yourself"],
    "example": "A: Did you see what he posted on Twitter? He's such a hater.\nB: Honestly, he just needs to get a life and stop stalking everyone.\nA: Right? Like, doesn't he have anything better to do with his time?\nB: Pathetic. People like that just live for the drama online.\nA: I'm just gonna block him, I don't need that energy on my feed.\nB: Good move. Let him yap to himself in his own little bubble."
  },
  {
    "primary": "People never change",
    "meaning": "사람은 절대 안 변한다 (본성은 어디 안 간다)",
    "similar": ["He’s stuck in his ways", "Old habits die hard", "Once a liar, always a liar", "A leopard doesn't change its spots", "Same old story"],
    "example": "A: He promised me he'd stop being late, but here we are again.\nB: I told you, people never change. You gotta stop being so naive.\nA: I just wanted to give him the benefit of the doubt one last time.\nB: It's been three years. At this point, it's just who he is.\nA: You're right. I'm just wasting my breath trying to fix him.\nB: Exactly. Either accept his messiness or just move on already."
  },
  {
    "primary": "best quote",
    "meaning": "가장 합리적인 가격 (최저가 견적)",
    "similar": ["Most competitive rate", "Bottom line", "Rock-bottom price", "Best possible deal", "Top-tier offer"],
    "example": "A: I need a new contractor for the kitchen, can you find me a good one?\nB: Sure, I'll call around and see who can give us the best quote.\nA: Make sure they're legit though, I don't want a cheap but messy job.\nB: Don't worry, I'll compare the most competitive rates in town.\nA: If they can do it under 20k, I'm ready to sign today.\nB: Say less. I'll get those numbers to you by tomorrow afternoon."
  },
  {
    "primary": "kitchenware",
    "meaning": "주방용품 및 조리 도구 전체",
    "similar": ["Kitchen essentials", "Cookware staples", "Culinary gear", "Kitchen gadgets", "Chef's tools"],
    "example": "A: Your kitchen looks like a professional studio, what's all this?\nB: I went a little overboard with the new kitchenware lately.\nA: That cast-iron skillet looks expensive, is it worth the hype?\nB: Deadass, it turns everything into a five-star meal.\nA: I definitely need to upgrade my basic pots and pans then.\nB: Start with a good knife and a solid pan, that's all you really need."
  },
  {
    "primary": "best friend",
    "meaning": "가장 친한 친구 (베프, 죽마고우)",
    "similar": ["Day-one", "Ride-or-die", "My person", "Inseparable companion", "Main squeeze (platonic)"],
    "example": "A: How long have you and Sarah been best friends?\nB: Oh, she's my day-one. We've been tight since preschool.\nA: That's crazy, I can't even remember who I knew back then.\nB: She’s literally like my sister. I trust her with my life.\nA: Everyone needs a ride-or-die like that in this city.\nB: For real, NYC is too intense to navigate without a real squad."
  },
  {
    "primary": "bestie",
    "meaning": "가장 친한 친구 (귀엽고 친근한 표현)",
    "similar": ["Best friend forever (BFF)", "My girl / My guy", "Soul sister", "Main bestie", "Twin"],
    "example": "A: Omg bestie, your outfit is literally everything today.\nB: Stop, you're making me blush! I got it on sale too.\nA: That's even better, we love a good bargain queen energy.\nB: Exactly! I'm trying to look expensive on a budget tonight.\nA: We are definitely gonna be the main characters at this party.\nB: Say less, let's go grab some drinks and start the night."
  },
  {
    "primary": "frustrated my younger sister",
    "meaning": "여동생을 짜증나게 하거나 답답하게 만들었다",
    "similar": ["Got on her nerves", "Drove her crazy", "Annoyed her to no end", "Got under her skin", "Pissed her off"],
    "example": "A: Why is your sister giving you the side-eye all morning?\nB: I might have frustrated her by taking her charger without asking.\nA: You know how she is about her tech, why would you do that?\nB: I was in a rush and my phone was dead, I didn't think it through.\nA: Well, you definitely got under her skin. You better apologize.\nB: I tried, but she told me to 'stop yapping' and locked her door."
  },
  {
    "primary": "tuition",
    "meaning": "학비 (대학교 등록금 등)",
    "similar": ["Tuition fees", "Cost of attendance", "Schooling costs", "Semester dues", "Education expenses"],
    "example": "A: Did you see the new tuition rates for next semester?\nB: Yeah, they're insane. It's like they want us to go broke.\nA: I'm already stressed about my student loans as it is.\nB: Tell me about it. We’re basically paying for the brand name now.\nA: I might have to get a second job just to cover the books.\nB: Same. This education system is truly wild, no cap."
  },
  {
    "primary": "get by",
    "meaning": "그럭저럭 먹고 살다 (현상 유지하다)",
    "similar": ["Make ends meet", "Scrape by", "Manage on a budget", "Stay afloat", "Survive the month"],
    "example": "A: How's the freelance life treating you financially?\nB: I'm just getting by, honestly. It's not as lucrative as I hoped.\nA: NYC is so expensive, 'just getting by' here is a struggle.\nB: For real, I'm basically making ends meet and that's about it.\nA: Hopefully that big contract you mentioned comes through soon.\nB: I'm praying for it. Otherwise, I might have to move back home."
  },
  {
    "primary": "buttery",
    "meaning": "진하고 부드러운 (고소한 맛이나 부드러운 식감)",
    "similar": ["Silky smooth", "Rich and creamy", "Melt-in-your-mouth", "Velvety", "Luscious"],
    "example": "A: This Chardonnay is so buttery and smooth, I love the finish.\nB: It goes perfectly with this pasta, right? The sauce is amazing too.\nA: Everything is just so rich. My taste buds are literally heaven.\nB: I knew you'd like this place. Their steak is also peak buttery.\nA: Stop, I’m already getting full just thinking about it.\nB: Trust me, you gotta try at least one bite. It’s a total game changer."
  },
  {
    "primary": "passed away and was cremated",
    "meaning": "돌아가셔서 화장한 후 안치되었다",
    "similar": ["Laid to rest", "Departed and cremated", "Final rites performed", "Placed in a columbarium", "Gone but not forgotten"],
    "example": "A: I heard about your grandmother, I am so sorry for your loss.\nB: Thank you. She passed away peacefully in her sleep last week.\nA: Were you guys able to have a service for her yet?\nB: Yeah, she was cremated and we placed her in a niche yesterday.\nA: That must have been a tough day for your whole family.\nB: It was, but we’re glad she’s finally at peace now."
  },
  {
    "primary": "Don't jinx it",
    "meaning": "말 꺼내서 부정 타게 하지 마 (설레발 치지 마)",
    "similar": ["Knock on wood", "Don't spoil the vibe", "Stay humble", "Let's not get ahead of ourselves", "Don't count your chickens"],
    "example": "A: We're totally gonna get the job, the interview was perfect.\nB: Shhh, don't jinx it! We haven't gotten the offer yet.\nA: I'm just feeling confident, the manager really liked us.\nB: I know, but let's just knock on wood for good luck.\nA: Okay, okay. I'll stop talking about it until the email lands.\nB: Thank you. I don't want any bad energy ruining this for us."
  },
  {
    "primary": "stop yapping",
    "meaning": "그만 떠들어라 (수다 좀 그만 떨어)",
    "similar": ["Zip it", "Quiet down", "Shut your mouth", "Stop running your mouth", "Curb the talk"],
    "example": "A: And then she said that I was the one who started the whole...\nB: Oh my god, can you please stop yapping about her for five minutes?\nA: I'm just trying to tell you what happened at the party!\nB: I've heard this story three times today, I'm literally exhausted.\nA: Finely, I'll shut up. You're so moody lately.\nB: I'm not moody, I just need some peace and quiet, no cap."
  },
  {
    "primary": "check all the boxes",
    "meaning": "모든 조건이나 요구 사항을 완벽히 충족하다",
    "similar": ["Meet all the criteria", "The full package", "Tick every box", "Perfect fit", "Everything I was looking for"],
    "example": "A: So, how was the second date with that guy from Hinge?\nB: Actually, he checks all the boxes. He's funny, smart, and tall.\nA: No way! Is there a catch? There's always a catch.\nB: Honestly, I haven't found one yet. He's just a solid guy.\nA: Well, if he's the full package, don't let him go too easy.\nB: I'm trying to play it cool, but I'm definitely into him."
  },
  {
    "primary": "put it down before I forget",
    "meaning": "까먹기 전에 적어둬야겠다 (메모해야겠다)",
    "similar": ["Jot this down real quick", "Make a note of this", "Note it before it slips", "Write this down ASAP", "Document this now"],
    "example": "A: We need to buy more batteries and some light bulbs.\nB: Hang on, let me put that down before I forget.\nA: While you're at it, add some almond milk to the list too.\nB: Got it. My memory has been total trash lately.\nA: Same, if I don't write it down immediately, it's gone forever.\nB: For real. Okay, the list is updated. What's next?"
  },
  {
    "primary": "nonchalant",
    "meaning": "태연한, 별일 아닌 듯 평온한 (덤덤한)",
    "similar": ["Cool and collected", "Unfazed", "Chill as hell", "Laid-back", "Indifferent"],
    "example": "A: Did you see his reaction when he got fired? He was so nonchalant.\nB: Right? I would have been literally sobbing on the floor.\nA: He just packed his bag and walked out like nothing happened.\nB: He’s always been unfazed by drama, but that was next level.\nA: I wish I had that much emotional control in stressful situations.\nB: Same, but sometimes I think he just doesn't care at all."
  },
  {
    "primary": "It's been unreal",
    "meaning": "정말 비현실적일 정도로 좋았다 (말도 안 되게 대단했다)",
    "similar": ["Totally surreal", "Mind-blowing", "Insane experience", "Beyond belief", "Absolutely incredible"],
    "example": "A: How was your trip to Tokyo? I saw the photos online.\nB: Honestly, it's been unreal. I'm still processing everything.\nA: The food looked like it was from another planet.\nB: It was! The whole vibe of the city is just totally surreal.\nA: I'm so jealous, I need to book a flight there ASAP.\nB: Deadass, it’s a life-changing place. You have to go."
  },
  {
    "primary": "pulling all-nighters",
    "meaning": "밤샘 작업을 하다 (철야하다)",
    "similar": ["Burning the midnight oil", "Working through the night", "Grinding 24/7", "Staying up till sunrise", "Zero sleep shift"],
    "example": "A: You look like a zombie, did you even sleep last night?\nB: Barely. I've been pulling a lot of all-nighters for this final project.\nA: That's rough. You need to take a break before you crash.\nB: I know, but if I don't finish this today, I'm gonna fail.\nA: Drink some coffee and just power through one last time.\nB: I'm on my fourth cup already. My heart is literally racing."
  },
  {
    "primary": "make someone's heart flutter",
    "meaning": "누군가의 가슴을 설레게 하다 (심쿵하게 만들다)",
    "similar": ["Give someone butterflies", "Make my heart skip a beat", "Make me weak in the knees", "Trigger those feels", "Spark a crush"],
    "example": "A: Whenever he looks at me and smiles, it makes my heart flutter.\nB: Ooh, someone's got a major crush! That's so cute.\nA: I'm trying to act normal, but I'm literally dying inside.\nB: Girl, those butterflies are the best part of a new thing.\nA: Except for the part where I can't even speak properly around him.\nB: Just be yourself, he clearly likes the vibe you're giving off."
  },
  {
    "primary": "Am I delusional?",
    "meaning": "내가 지금 착각하고 있는 건가? (김칫국 마시는 거야?)",
    "similar": ["Am I trippin'?", "Am I imagining things?", "Is this all in my head?", "Am I being unrealistic?", "Tell me I'm crazy"],
    "example": "A: He liked my old photo from three years ago. Am I delusional for thinking he's interested?\nB: Honestly? Yeah, a little bit. That's a classic accidental deep-stalk swipe.\nA: But why would he even be on my profile that late at night?\nB: People get bored on Instagram, don't read too much into it.\nA: You're right. I'm totally trippin' over nothing.\nB: Exactly. Let's focus on someone who actually texts you back."
  },
  {
    "primary": "I can't possibly",
    "meaning": "도저히 그럴 수 없다 (불가능하다, 무리다)",
    "similar": ["There's no way I can", "It’s out of the question", "I simply cannot", "I am unable to", "Not happening"],
    "example": "A: Can you help me move my piano this Saturday morning?\nB: I can't possibly do that, I'm working a double shift both days.\nA: Are you sure? I really need someone strong like you.\nB: Deadass, I’m gonna be exhausted. It’s just not happening.\nA: Fine, I'll see if Greg can help instead.\nB: Good luck with that, Greg’s back is even worse than mine."
  },
  {
    "primary": "Are you investing in shares market?",
    "meaning": "요즘 주식 투자 하고 있어?",
    "similar": ["Are you into stocks?", "Do you play the market?", "Are you in the game?", "You investing lately?", "Are you trading these days?"],
    "example": "A: Hey, are you investing in the shares market lately? Everything is so volatile.\nB: I'm mostly into ETFs. I don't have the stomach for individual stocks.\nA: Smart move. I got burned pretty bad on some tech stocks last month.\nB: That's why I just 'buy the dip' and hold for the long term.\nA: I should have listened to you. I’m down like 20% right now.\nB: Don't panic sell. Just wait it out and it'll probably recover."
  },
  {
    "primary": "stock market (news style)",
    "meaning": "주식 시장 (기관/개인 투자자, 변동성 등 전문 용어)",
    "similar": ["Financial markets", "Equity trading", "The exchange", "Wall Street activity", "Global indexes"],
    "example": "A: The stock market took a massive hit today due to the inflation data.\nB: Yeah, high volatility is scaring off a lot of retail investors.\nA: Institutional investors are probably just waiting for a better entry point.\nB: Exactly. Everyone is keeping a close eye on the Fed's next move.\nA: If rates go up again, we might see a more prolonged bear market.\nB: It's a stressful time to be managing a portfolio, for sure."
  },
  {
    "primary": "pull it off",
    "meaning": "어려운 일을 결국 해내다 (성공시키다)",
    "similar": ["Make it happen", "Nail it", "Succeed against the odds", "Bring it home", "Deliver the goods"],
    "example": "A: I didn't think we'd finish the presentation in time, but we pulled it off.\nB: Honestly, it was a close call. That last-minute edit saved us.\nA: The client loved it though, so all that stress was worth it.\nB: We really nailed the final pitch. Great teamwork, everyone.\nA: Let's celebrate tonight, we definitely earned some drinks.\nB: Say less. I know a great rooftop bar nearby."
  },
  {
    "primary": "no cap",
    "meaning": "진짜로, 거짓말 아니야 (레알)",
    "similar": ["For real", "Deadass", "I'm being serious", "Straight facts", "No lie"],
    "example": "A: This burger is literally the best thing I've ever eaten, no cap.\nB: You say that about every burger place we go to, though.\nA: No, for real this time. The sauce is actually insane.\nB: Okay, let me try a bite... Wow, you weren't lying. That's fire.\nA: See? I told you. Best in the city, deadass.\nB: Alright, I'll give it to you. This is top-tier."
  },
  {
    "primary": "Pull down to refresh",
    "meaning": "아래로 당겨서 새로고침하다 (앱이나 웹에서)",
    "similar": ["Reload the feed", "Swipe down to update", "Refresh the screen", "Sync the page", "Trigger a reload"],
    "example": "A: My feed is still showing posts from yesterday, what's wrong?\nB: Just pull down to refresh, it probably just needs a quick sync.\nA: I already tried that, but it's still stuck on the same photo.\nB: Maybe your wifi is trippin'. Try switching to data.\nA: Oh, that worked. Now I see all the new drama.\nB: Perfect. Now you can get back to being a hater, haha."
  },
  {
    "primary": "Not a word",
    "meaning": "절대 아무한테도 말하지 마 (비밀이야)",
    "similar": ["Keep it on the low", "Don't say a thing", "Keep your lips sealed", "Mum's the word", "This stays between us"],
    "example": "A: I'm quitting my job on Friday, but not a word to anyone yet.\nB: Wait, what? Are you serious? Where are you going?\nA: I got an offer from that startup in Brooklyn, but it's not official.\nB: That's huge! I promise, my lips are sealed. Not a word.\nA: Thank you. I don't want any corporate drama before I leave.\nB: I got you. Your secret is totally safe with me."
  },
  {
    "primary": "Say less",
    "meaning": "알았어, 더 말 안 해도 이해했어 (바로 할게)",
    "similar": ["I got you", "Understood", "Consider it done", "Way ahead of you", "On it"],
    "example": "A: Can you grab some ice on your way to the party tonight?\nB: Say less, I'll pick up two bags and some extra cups too.\nA: You're a lifesaver, everyone always forgets the ice.\nB: I've been to enough NYC house parties to know the drill.\nA: True. See you around 9 then?\nB: I'll be there. I'll text you when I'm pulling up."
  }
]
