[
  {
    "id": 1001,
    "primary": "But there's a twist.",
    "meaning": "하지만 반전이 있어요.",
    "similar": [
      "However, something unexpected occurs.",
      "There's a surprise element.",
      "It's not as it seems.",
      "Wait till you hear this part.",
      "Things take a sudden turn."
    ],
    "example": "A: I found the perfect apartment in the Lower East Side for only $1500!\nB: Wow! That's an insane deal. What's the catch?\nA: But there's a twist... the landlord says I have to share it with three ghosts.\nB: Haha, you're kidding right? Please tell me you're joking.\nA: I wish! I'm actually starting to think it might be haunted for real.\nB: Save your money and keep looking. No ghost-mates for me!",
    "japanese": "でもオチがあるんだ。／でも一筋縄（ひとすじなわ）ではいかないんだ。",
    "chinese": "但有个反转 (Dàn yǒu gè fǎnzhuǎn) / 剧情有变 (Jùqíng yǒu biàn)",
    "spanish": ""
  },
  {
    "id": 1002,
    "primary": "We're out of the woods.",
    "meaning": "이제 위험에서 벗어났어요.",
    "similar": [
      "We're safe now.",
      "The danger has passed.",
      "We've cleared the main hurdles.",
      "Things are looking better.",
      "We've survived the worst."
    ],
    "example": "A: Is the server still crashing every five minutes?\nB: No, looks like we're finally out of the woods. The traffic has stabilized.\nA: Thank goodness! I was about to have a mental breakdown.\nB: For real. That was a stressful three hours for everyone involved.\nA: Let's just monitor it for another hour just to be totally safe though.\nB: Smart move. I'll keep an eye on the analytics.",
    "japanese": "危機（きき）は脱（だっ）したよ。／峠（とうげ）は越（こ）えたよ。",
    "chinese": "脱离险境了 (Tuōlí xiǎnjìng le) / 渡过难关了 (Dùguò nánguān le)",
    "spanish": ""
  },
  {
    "id": 1003,
    "primary": "Let's play it by ear.",
    "meaning": "상황 보고 정합시다.",
    "similar": [
      "Let's see how things go.",
      "We'll decide later.",
      "Go with the flow.",
      "No concrete plans yet.",
      "We'll adjust as we go."
    ],
    "example": "A: What time should we head out for dinner tonight?\nB: Honestly? Let's just play it by ear. It depends on when everyone finishes work.\nA: Alright, just hit me up when you're ready to leave then.\nB: For sure. I'll give you a thirty-minute heads up.\nA: Sounds like a plan. I'm just gonna chill here till then.\nB: Bet. Catch you later.",
    "japanese": "臨機応変（りんきおうへん）にいこう。／出（で）たとこ勝負（しょうぶ）でいこう。",
    "chinese": "见机行事 (Jiànjī xíngshì) / 到时候再说 (Dào shíhou zàishuō)",
    "spanish": ""
  },
  {
    "id": 1004,
    "primary": "Don't even bring it up.",
    "meaning": "꺼내지도 마세요.",
    "similar": [
      "Don't mention it.",
      "Don't talk about it.",
      "Avoid that subject.",
      "Let's not go there.",
      "Please ignore that topic."
    ],
    "example": "A: So, whatever happened with that guy you were seeing last month?\nB: Look, don't even bring it up. It ended very, very badly.\nA: Oh snap... my bad! I didn't know it was that serious.\nB: It's fine, I'm just trying to delete him from my memory entirely.\nA: I feel you. Let's talk about something way more positive instead.\nB: Best idea. Tell me more about that new project you're working on.",
    "japanese": "その話（はなし）はしないで。／触（ふ）れないで。",
    "chinese": "提都别提 (Tí dōu bié tí) / 别再说这事了 (Bié zài shuō zhè shì le)",
    "spanish": ""
  },
  {
    "id": 1005,
    "primary": "Your eyes are bigger than your stomach.",
    "meaning": "욕심부리네요.",
    "similar": [
      "You're overestimating your appetite.",
      "You ordered too much food.",
      "You took more than you can handle.",
      "You're acting greedy.",
      "Be realistic about what you can finish."
    ],
    "example": "A: I think I'm gonna order two more large pizzas for the party.\nB: Look, your eyes are bigger than your stomach! We still have leftovers from last time.\nA: I just don't want anyone to go hungry, you know?\nB: I get it, but we already have plenty of snacks too. Chill on the pizza.\nA: Alright, maybe you're right. I'll just get one more instead.\nB: Still probably too much, but whatever. Suit yourself.",
    "japanese": "欲張（よくば）りすぎだよ。／食（た）べきれないでしょ。",
    "chinese": "贪多嚼不烂 (Tānduō jiáo bù làn) / 别眼大肚子小 (Bié yǎn dà dùzi xiǎo)",
    "spanish": ""
  },
  {
    "id": 1006,
    "primary": "It's not even close.",
    "meaning": "어림도 없어요.",
    "similar": [
      "It's way off.",
      "Not even in the ballpark.",
      "A huge difference.",
      "Completely different level.",
      "Doesn't compare at all."
    ],
    "example": "A: Do you think my local pizza spot is as good as Joe's in the Village?\nB: Honestly? It's not even close. Joe's is in a whole other league.\nA: Come on! Mine is pretty solid for a neighborhood joint.\nB: Solid, yeah, but Joe's is legendary. There's just no comparison.\nA: I guess I need to head down there and do a taste test then.\nB: Facts. You'll see exactly what I'm talking about.",
    "japanese": "足元（あしもと）にも及（およ）ばないよ。／比（くら）べものにならないよ。",
    "chinese": "差远了 (Chà yuǎn le) / 没法比 (Méifǎ bǐ)",
    "spanish": ""
  },
  {
    "id": 1007,
    "primary": "I don't blame you.",
    "meaning": "당신 탓이 아니에요.",
    "similar": [
      "I understand your decision.",
      "It's not your fault.",
      "I see why you did that.",
      "No judgment from me.",
      "I would've done the same."
    ],
    "example": "A: I decided to quit my corporate job and just travel for a year.\nB: Honestly? I don't blame you. That job was killing your soul.\nA: It really was. I'm just so ready for a change of pace.\nB: For real. You've been working so hard for years, you deserve a break.\nA: Thanks for the support. A lot of people think I'm crazy.\nB: They're just jealous of your freedom. Live your life!",
    "japanese": "無理（むり）もないよ。／責（せ）められないよ。",
    "chinese": "我不怪你 (Wǒ bù guài nǐ) / 我理解你 (Wǒ lǐjiě nǐ)",
    "spanish": ""
  },
  {
    "id": 1008,
    "primary": "Don't let it bother you.",
    "meaning": "신경 쓰지 마세요.",
    "similar": [
      "Ignore it.",
      "Don't worry about it.",
      "Keep your head up.",
      "Let it slide.",
      "Don't let it get to you."
    ],
    "example": "A: My boss made a really snarky comment about my presentation today.\nB: Look, don't let it bother you. He's always like that after his morning meeting.\nA: It still hurtful though! I worked so hard on those slides.\nB: I know, but you did a great job and everyone else loved it. Stay positive.\nA: You're right. I'm just gonna focus on the good feedback instead.\nB: Smart move. Negative energy is just not worth your time.",
    "japanese": "気（き）にしないで。／ドンマイ。",
    "chinese": "别往心里去 (Bié wǎng xīnlǐ qù) / 别让它困扰你 (Bié ràng tā kùnrǎo nǐ)",
    "spanish": ""
  },
  {
    "id": 1009,
    "primary": "I'm at your service.",
    "meaning": "무엇을 도와드릴까요?",
    "similar": [
      "I'm here to help.",
      "Let me know what you need.",
      "I'm ready to assist.",
      "I'm available for any tasks.",
      "Count on me for support."
    ],
    "example": "A: I really need some help organizing the event next week.\nB: Any time! I'm at your service. Just tell me what needs doing.\nA: Could you handle the guest list and the catering details?\nB: 100%. I'll get started on it first thing tomorrow morning.\nA: You're a lifesaver! I was honestly about to panic.\nB: Chill, we've got this. Teamwork makes the dream work!",
    "japanese": "何（なん）でも言（い）って。／手伝（てつだ）うよ。",
    "chinese": "随叫随到 (Suíjiàosuídào) / 为你效劳 (Wèi nǐ xiàoláo)",
    "spanish": ""
  },
  {
    "id": 1010,
    "primary": "She's cool as a cucumber.",
    "meaning": "아주 침착해요.",
    "similar": [
      "She's incredibly calm.",
      "She handles pressure well.",
      "She's composed.",
      "Nothing rattles her.",
      "She's unflappable."
    ],
    "example": "A: How did she stay so calm when the whole system went down?\nB: Honestly? She's cool as a cucumber during crises. It's impressive.\nA: I'd be running around like a headless chicken, for real.\nB: Me too. I don't know how she does it. It must be meditation or something.\nA: Either way, I'm glad she's on our team.\nB: Facts. We really need that kind of steady energy right now.",
    "japanese": "彼女（かのじょ）は平気（へいき）な顔（かお）してたよ。／全然（ぜんぜん）動（どう）じてなかった。",
    "chinese": "非常冷静 (Fēicháng lěngjìng) / 处变不惊 (Chǔbiànbùjīng)",
    "spanish": ""
  },
  {
    "id": 1011,
    "primary": "He's down to earth.",
    "meaning": "겸손하고 현실적이에요.",
    "similar": [
      "He's very practical.",
      "He's relatable.",
      "He's humble.",
      "He's got no ego.",
      "He's a regular guy."
    ],
    "example": "A: Have you met the new CEO yet? Is he as terrifying as everyone says?\nB: Not at all! Honestly, he's super down to earth and actually listens to ideas.\nA: Oh wow! That's such a relief to hear.\nB: For real. He even ate lunch with us in the breakroom today.\nA: That's dope. It's nice to have a leader who actually feels like a human being.\nB: 100%. Makes the whole office vibe so much better.",
    "japanese": "彼（かれ）は気取（きと）ってないよ。／堅実（けんじつ）な人（ひと）だよ。",
    "chinese": "很接地气 (Hěn jiēdìqì) / 很朴实 (Hěn pǔshí)",
    "spanish": ""
  },
  {
    "id": 1012,
    "primary": "We have to address the problem.",
    "meaning": " 문제를 해결해야 해요.",
    "similar": [
      "We need to deal with the issue.",
      "Let's confront the situation.",
      "We have to fix this.",
      "Tackle the problem head-on.",
      "Find a solution now."
    ],
    "example": "A: We've been ignoring the drop in sales for three months now.\nB: Look, we have to address the problem before it gets any worse.\nA: I agree, but what's our first step? We need more data.\nB: Let's start by surveying our most loyal customers. See what's changed.\nA: Smart move. I'll set that up by the end of the week.\nB: Perfect. Time to be proactive instead of just hoping for the best.",
    "japanese": "問題（もんだい）に対処（たいしょ）しなきゃ。／何（なん）とかしなきゃ。",
    "chinese": "得解决这个问题 (Děi jiějué zhège wèntí) / 必须正视问题 (Bìxū zhèngshì wèntí)",
    "spanish": ""
  },
  {
    "id": 1013,
    "primary": "How old do you think I am?",
    "meaning": "제 나이가 몇 살 같아요?",
    "similar": [
      "Guess my age.",
      "What's your best guess on my age?",
      "How old do I look?",
      "Do you think I'm older or younger?",
      "Give me a number on my age."
    ],
    "example": "A: You seem so mature for someone just starting their career.\nB: Really? Haha, how old do you think I am? Most people get it wrong.\nA: I'd say... maybe twenty-five? You've got that youthful energy.\nB: Actually, I'm thirty-two! I just take really good care of my skin.\nA: No way! You definitely don't look a day over twenty-two.\nB: Haha, I'll take that as a huge win! Thanks for the kind words.",
    "japanese": "何歳（なんさい）に見（み）える？／いくつだと思（おも）う？",
    "chinese": "你猜我多大? (Nǐ cāi wǒ duō dà?) / 你觉得我几岁? (Nǐ juéde wǒ jǐ suì?)",
    "spanish": ""
  },
  {
    "id": 1014,
    "primary": "It put me on the map.",
    "meaning": "그것 덕분에 유명해졌어요.",
    "similar": [
      "It made me famous.",
      "It gave me recognition.",
      "It established my reputation.",
      "It brought me into the spotlight.",
      "It was my big break."
    ],
    "example": "A: How did you get that job at the huge tech firm?\nB: Honestly, that viral app I built last year? It really put me on the map.\nA: Oh word! I remember seeing that one on Product Hunt.\nB: Yeah, it got a lot of buzz very quickly. Companies started reaching out to me after that.\nA: That's the dream, for real. Hard work actually paying off.\nB: Facts. It's all about that one project that catches the right eyes.",
    "japanese": "それで名（な）が知（し）れ渡（わた）ったんだ。／世（よ）に出（で）るきっかけになった。",
    "chinese": "让我一举成名 (Ràng wǒ yījǔchéngmíng) / 让我在这一行有了地位 (Ràng wǒ zài zhè yī háng yǒu le dìwèi)",
    "spanish": ""
  },
  {
    "id": 1015,
    "primary": "They are selling like hot cakes.",
    "meaning": "불티나게 팔리고 있어요.",
    "similar": [
      "They're very popular.",
      "Demand is through the roof.",
      "They're flying off the shelves.",
      "Sales are booming.",
      "Everyone wants one."
    ],
    "example": "A: Did you manage to get those new sneakers that dropped today?\nB: No way, man! They were selling like hot cakes and sold out in three minutes.\nA: That's wild. I was on the site at 10 AM too and I couldn't even load the page.\nB: For real. Resellers are probably already hiking the price up to five hundred.\nA: I hate that so much. Just ruins the fun for the actual fans.\nB: Facts. I'm just gonna wait for the next restock.",
    "japanese": "飛（と）ぶように売（う）れてるよ。／バカ売（う）れしてるよ。",
    "chinese": "非常抢手 (Fēicháng qiǎngshǒu) / 像刚出锅的小吃一样卖得快 (Xiàng gāng chūguō de xiǎochī yīyàng mài de kuài)",
    "spanish": ""
  },
  {
    "id": 1016,
    "primary": "This is at the heart of the matter.",
    "meaning": "이것이 핵심이에요.",
    "similar": [
      "This is the core issue.",
      "This is the main point.",
      "This is fundamental.",
      "This is what everything centers around.",
      "This is the crux of the situation."
    ],
    "example": "A: Why are we even talking about the office layout again?\nB: Look, efficiency is at the heart of the matter. We need to work better.\nA: I thought it was just about making the place look nicer.\nB: That's a side effect. The real goal is maximizing our output.\nA: I see. So the layout actually affects how we collaborate then.\nB: Facts. It's the foundation of everything we do here.",
    "japanese": "これが核心（かくしん）だよ。／一番大事（いちばんだいじ）なところだよ。",
    "chinese": "这是问题的核心 (Zhè shì wèntí de héxīn) / 关键就在这儿 (Guānjiàn jiù zài zhèr)",
    "spanish": ""
  },
  {
    "id": 1017,
    "primary": "Who do you think I am?",
    "meaning": "나를 누구로 보는 거예요?",
    "similar": [
      "Don't underestimate me.",
      "You clearly don't know who you're dealing with.",
      "Do you really think I'd do that?",
      "Show some respect.",
      "You have no idea who I am."
    ],
    "example": "A: Are you really gonna try to sneak into the club without an ID?\nB: Yo, who do you think I am? I've been doing this since I was eighteen.\nA: I'm just saying, the bouncer looks pretty intense tonight.\nB: Chill. I've got my ways. Just watch and learn.\nA: Alright, if you get kicked out, I'm not waiting for you.\nB: Don't even worry. I'll be at the bar before you're even through the line.",
    "japanese": "私（わたし）を誰（だれ）だと思（おも）ってるの？／なめないでよ。",
    "chinese": "你把我当什么人了? (Nǐ bǎ wǒ dāng shénme rén le?) / 你以为我是谁? (Nǐ yǐwéi wǒ shì shuí?)",
    "spanish": ""
  },
  {
    "id": 1018,
    "primary": "It spiraled out of control.",
    "meaning": "걷잡을 수 없이 악화됐어요.",
    "similar": [
      "It got out of hand.",
      "It escalated quickly.",
      "It became unmanageable.",
      "Things went downhill fast.",
      "It was total chaos."
    ],
    "example": "A: It started as a small argument over who left the milk out.\nB: And then? How did the whole kitchen end up covered in flour?\nA: Honestly? It just spiraled out of control. Things were thrown, people were yelling...\nB: That sounds like a scene from a movie, for real.\nA: It was a nightmare. We're still cleaning up the mess.\nB: Facts. I think you guys need a serious roommate meeting soon.",
    "japanese": "収拾（しゅうしゅう）がつかなくなった。／泥沼（どろぬま）化（か）した。",
    "chinese": "失控了 (Shīkòng le) / 局面一发不可收拾 (Júmiàn yīfābùkěshōushi)",
    "spanish": ""
  },
  {
    "id": 1019,
    "primary": "It quickly went viral.",
    "meaning": "순식간에 입소문이 났어요.",
    "similar": [
      "It gained popularity fast.",
      "It was all over the internet.",
      "Everyone was sharing it.",
      "It blew up overnight.",
      "It became an instant trend."
    ],
    "example": "A: Did you see that video of the cat playing the piano?\nB: Yeah! It quickly went viral this morning. My whole feed is full of it.\nA: It's so wholesome though. I've watched it like ten times already.\nB: For real. It's the kind of content we all need right now.\nA: Facts. I heard the owner is already getting talk show invites.\nB: That's wild. The internet is a crazy place for sure.",
    "japanese": "あっという間（ま）に広（ひろ）まったね。／バズったね。",
    "chinese": "迅速走红 (Xùnsù zǒuhóng) / 很快就传开了 (Hěn kuài jiù chuánkāi le)",
    "spanish": ""
  },
  {
    "id": 1020,
    "primary": "At the end of the day.",
    "meaning": "결국에는요.",
    "similar": [
      "Ultimately.",
      "The bottom line is.",
      "When all is said and done.",
      "In the final analysis.",
      "Basically."
    ],
    "example": "A: We've been debating which color to paint the walls for three hours.\nB: Look, at the end of the day, it's just a wall. We just need to pick one.\nA: But the 'vibe' needs to be perfect for the brand!\nB: I get it, but we have bigger problems to solve right now.\nA: You're right. Let's just go with the light grey and move on.\nB: Facts. Decision made. Let's get some lunch.",
    "japanese": "結局（けっきょく）のところ／要（よう）するに",
    "chinese": "说到底 (Shuō dào dǐ) / 归根结底 (Guīgēnjiédǐ)",
    "spanish": ""
  },
  {
    "id": 1021,
    "primary": "He was full of beans.",
    "meaning": "에너지가 넘쳤어요.",
    "similar": [
      "He had so much energy.",
      "He was very lively.",
      "He was spirited.",
      "He couldn't sit still.",
      "He was buzzing with excitement."
    ],
    "example": "A: How was the puppy's first day at the park?\nB: Oh man, he was full of beans! He ran around for three hours straight.\nA: I bet he's fast asleep now though.\nB: 100%. He's been snoring for the last two hours. It's adorable.\nA: That's the best part about high-energy dogs, they crash hard.\nB: Facts. I'm just glad he had a good time.",
    "japanese": "彼（かれ）は元気（げんき）いっぱいだったよ。／ハッスルしてた。",
    "chinese": "精力充沛 (Jīnglì chōngpèi) / 活力十足 (Huólì shízú)",
    "spanish": ""
  },
  {
    "id": 1022,
    "primary": "That is a tough nut to crack.",
    "meaning": "해결하기 어려운 문제예요.",
    "similar": [
      "That's a difficult problem.",
      "It's a challenge to solve.",
      "It's a complex situation.",
      "That's no easy task.",
      "It's a hard nut to crack."
    ],
    "example": "A: We're still trying to figure out how to reduce our churn rate.\nB: Yeah, that is a tough nut to crack. Customers seem so fickle these days.\nA: We've tried discounts, better support, everything...\nB: Maybe it's not the service, but the actual product itself?\nA: That's a scary thought, but you might be right.\nB: Facts. It's time for some deep analysis.",
    "japanese": "難（むずか）しい問題（もんだい）だね。／厄介（やっかい）な案件（あんけん）だね。",
    "chinese": "这是块硬骨头 (Zhè shì kuài yìnggǔtou) / 挺难办的 (Tǐng nán bàn de)",
    "spanish": ""
  },
  {
    "id": 1023,
    "primary": "We will chew the fat.",
    "meaning": "수다를 떨 거예요.",
    "similar": [
      "We'll have a long talk.",
      "We'll catch up properly.",
      "We'll chat for a while.",
      "Let's vent and talk.",
      "We'll gossip and share stories."
    ],
    "example": "A: Are you coming over tonight for dinner?\nB: For sure! I haven't seen you in weeks, we really need to chew the fat.\nA: I've got so much to tell you about the new job.\nB: I bet! I've got some tea to share too. It's gonna be a long night.\nA: Perfect. I'll have the wine ready.\nB: Say less. I'm on my way.",
    "japanese": "積（つ）もる話（はなし）をしよう。／ゆっくりしゃべろう。",
    "chinese": "漫无目的地闲聊 (Mànwúmùdìde xiánliáo) / 叙叙旧 (Xùxùjiù)",
    "spanish": ""
  },
  {
    "id": 1024,
    "primary": "Don't let your guard down.",
    "meaning": "방심하지 마세요.",
    "similar": [
      "Stay alert.",
      "Be vigilant.",
      "Don't get complacent.",
      "Keep your eyes open.",
      "Watch your step."
    ],
    "example": "A: We're finally ahead in the fourth quarter!\nB: That's great, but don't let your guard down. They could still come back.\nA: True, their star player just got back on the court.\nB: Exactly. Keep the pressure on till the final buzzer sounds.\nA: Roger that. We're staying locked in.\nB: Facts. No room for mistakes now.",
    "japanese": "油断（ゆだん）しないで。／気（き）を抜（ぬ）かないで。",
    "chinese": "别掉以轻心 (Bié diàoyǐqīngxīn) / 保持警惕 (Bǎochí jǐngtì)",
    "spanish": ""
  },
  {
    "id": 1025,
    "primary": "They promised the moon.",
    "meaning": "지키지 못할 약속을 했어요.",
    "similar": [
      "They made unrealistic promises.",
      "They claimed they could do everything.",
      "They overpromised.",
      "They offered the world with no way to deliver.",
      "They gave false hope."
    ],
    "example": "A: The new agency says they can triple our traffic in one month.\nB: Look, they're promising the moon. No one can actually guarantee that.\nA: I know it sounds too good to be true, but what if they're legit?\nB: Trust me, I've heard this before. They just want the contract.\nA: I should probably ask for some case studies then.\nB: Smart move. Don't believe the hype without some proof.",
    "japanese": "無理（むり）な約束（やくそく）をしたね。／大風呂敷（おおぶろしき）を広（ひろ）げたね。",
    "chinese": "他们漫天许诺 (Tāmen màntiān xǔnuò) / 乱开空头支票 (Luàn kāi kōngtóuzhīpiào)",
    "spanish": ""
  },
  {
    "id": 1026,
    "primary": "He's on track.",
    "meaning": "잘하고 있어요.",
    "similar": [
      "He's making progress as expected.",
      "He's staying following the plan.",
      "He's doing well.",
      "He's on schedule.",
      "He's making good headway."
    ],
    "example": "A: How is the new intern doing with his first project?\nB: Honestly? He's on track. He should be done by Friday.\nA: That's good to hear. I was worried the learning curve would be too much.\nB: He's a quick learner, for real. Very proactive too.\nA: Dope. I'll check in with him tomorrow morning.\nB: Sounds good. He's doing a solid job.",
    "japanese": "彼（かれ）は順調（じゅんちょう）だよ。／予定通（よていどお）りだよ。",
    "chinese": "进展顺利 (Jìnzhǎn shùnlì) / 在计划内 (Zài jìhuà nèi)",
    "spanish": ""
  },
  {
    "id": 1027,
    "primary": "It's not as bad as it seems.",
    "meaning": "보기보다 나쁘지 않아요.",
    "similar": [
      "It's better than you think.",
      "It's manageable.",
      "Don't overreact, it's okay.",
      "The situation is salvageable.",
      "It's not a total disaster."
    ],
    "example": "A: I accidentally formatted the wrong drive and lost all my notes!\nB: Chill, it's not as bad as it seems. We have most of that backed up to the cloud.\nA: Wait, really? Even the stuff from this morning?\nB: Yeah, the auto-sync actually saved your life. Check your account.\nA: Oh my god, you're right! Thank you! I was about to cry.\nB: See? Technology actually works sometimes.",
    "japanese": "見（み）た目（め）ほど悪（わる）くないよ。／案外（あんがい）なんとかなるよ。",
    "chinese": "没那么糟糕 (Méi nàme zāogāo) / 情况还好 (Qíngkuàng hái hǎo)",
    "spanish": ""
  },
  {
    "id": 1028,
    "primary": "Calm your nerves.",
    "meaning": "진정하세요.",
    "similar": [
      "Relax.",
      "Take a deep breath.",
      "Stay calm.",
      "Don't be so anxious.",
      "Chill out for a second."
    ],
    "example": "A: I'm literally shaking right now. What if I mess up my line?\nB: Look, just calm your nerves. You've practiced this a hundred times.\nA: But the audience is so huge! And my parents are in the front row!\nB: Just focus on your breathing. You're gonna be amazing, trust me.\nA: Alright, I'm taking a big breath now. Okay, I can do this.\nB: That's the spirit. You're a pro.",
    "japanese": "落（お）ち着（つ）いて。／リラックスして。",
    "chinese": "稳住情绪 (Wěnzhù qíngxù) / 别紧张 (Bié jǐnzhāng)",
    "spanish": ""
  },
  {
    "id": 1029,
    "primary": "It was a shot in the arm.",
    "meaning": "큰 활력소가 되었어요.",
    "similar": [
      "It was a much-needed boost.",
      "It provided significant encouragement.",
      "It was a stimulant for the situation.",
      "It gave us extra energy.",
      "It was a positive catalyst."
    ],
    "example": "A: The team was really feeling down after that last loss.\nB: Yeah, but that new sponsorship was exactly the shot in the arm we needed.\nA: For real. Everyone is so motivated now.\nB: It's crazy how much of a difference some good news can make.\nA: Facts. We're ready to take on the next challenge with full energy.\nB: Let's get it.",
    "japanese": "カンフル剤（ざい）になったよ。／元気（げんき）が出（で）たよ。",
    "chinese": "打了一剂强心针 (Dǎ le yī jì qiángxīnzhēn) / 很大的鼓舞 (Hěn dà de gǔwǔ)",
    "spanish": ""
  },
  {
    "id": 1030,
    "primary": "That's the way the ball bounces.",
    "meaning": "세상일이 다 그렇죠.",
    "similar": [
      "That's life.",
      "It is what it is.",
      "Sometimes things just don't go your way.",
      "No use complaining.",
      "That's the situation now."
    ],
    "example": "A: I was so sure I was gonna win that raffle, but I didn't even place.\nB: Well, that's just the way the ball bounces sometimes. Better luck next time.\nA: I guess I'll just have to keep trying my luck with other stuff.\nB: For real. You can't win them all, right?\nA: Facts. It was just a fun little thing anyway.\nB: Exactly. Keep that positive attitude going.",
    "japanese": "世（よ）の中（なか）そんなもんだよ。／運（うん）が悪（わる）かったね。",
    "chinese": "这就是命 (Zhè jiù shì mìng) / 事实就是这样 (Shìshí jiùshì zhèyàng)",
    "spanish": ""
  },
  {
    "id": 1031,
    "primary": "That's music to my ears",
    "meaning": "완전 반가운 소식이야.",
    "similar": [
      "great news",
      "love to hear it",
      "best thing I heard all day",
      "sweet relief",
      "awesome update"
    ],
    "example": "A: Meeting is cancelled.\nB: That's music to my ears.\nA: Let's grab lunch early.\nB: Way ahead of you.\nA: Taco truck?\nB: You read my mind.",
    "japanese": "それは朗報（ろうほう）だね！／聞（き）けて嬉（うれ）しいよ！",
    "chinese": "这可太好了 (Zhè kě tài hǎo le) / 正合我意 (Zhènghé wǒ yì)",
    "spanish": ""
  },
  {
    "id": 1032,
    "primary": "He was not pulling his weight.",
    "meaning": "제 몫을 다하지 않았어요.",
    "similar": [
      "He was being lazy.",
      "He wasn't contributing enough.",
      "He was slacking off.",
      "He was a burden on the team.",
      "He wasn't doing his fair share."
    ],
    "example": "A: Why did you decide to let the lead designer go?\nB: Honestly? He was not pulling his weight and the rest of the team was frustrated.\nA: I noticed some of the projects were falling behind lately.\nB: Exactly. Everyone else was working overtime while he was just chilling.\nA: That's not fair to anyone. It's better to have a smaller, more dedicated team.\nB: Facts. We're already seeing better results without the dead weight.",
    "japanese": "彼（かれ）は足（あし）を引（ひ）っ張（ぱ）ってたよ。／役（やく）に立（た）ってなかった。",
    "chinese": "他不尽职 (Tā bù jìnzhí) / 他出工不出力 (Tā chū gōng bù chū lì)",
    "spanish": ""
  },
  {
    "id": 1033,
    "primary": "I don't buy it.",
    "meaning": "안 믿어요.",
    "similar": [
      "I don't believe you.",
      "I'm skeptical.",
      "That sounds fake to me.",
      "I'm not convinced.",
      "I'm calling cap on that."
    ],
    "example": "A: He says he missed the meeting because his alarm clock literally exploded.\nB: Honestly? I don't buy it. That sounds like a complete lie.\nA: It's a pretty creative excuse though, you gotta admit.\nB: Creative, yeah, but definitely not true. He just overslept again.\nA: I should probably just give him a formal warning then.\nB: Facts. Consistency matters in this office.",
    "japanese": "信（しん）じないよ。／騙（だま）されないよ。",
    "chinese": "我不信 (Wǒ bù xìn) / 少来这套 (Shǎo lái zhè tào)",
    "spanish": ""
  },
  {
    "id": 1034,
    "primary": "I got all dolled up.",
    "meaning": "한껏 멋을 부렸어요.",
    "similar": [
      "I dressed up nicely.",
      "I'm looking glamorous.",
      "I put in effort for my outfit.",
      "I'm all decked out.",
      "I'm ready for the red carpet."
    ],
    "example": "A: Wow! You look amazing today! Where are you going?\nB: Thanks! I got all dolled up for that awards ceremony tonight.\nA: You're definitely gonna be the star of the show.\nB: Haha, I appreciate that! I even did my hair and makeup myself.\nA: Teach me your ways! Seriously, you look like a whole different person.\nB: It's all about the confidence and some secret lipstick tricks.",
    "japanese": "おめかししたんだ。／気合（きあ）い入（い）れて着飾（きかざ）った。",
    "chinese": "打扮得很漂亮 (Dǎban de hěn piàoliang) / 花枝招展的 (Huāzhīzhāozhǎn de)",
    "spanish": ""
  },
  {
    "id": 1035,
    "primary": "You're on a roll",
    "meaning": "요즘 완전 잘 나가네.",
    "similar": [
      "killing it",
      "crushing it",
      "on fire",
      "unstoppable",
      "winning streak"
    ],
    "example": "A: I closed three deals today.\nB: Wow, you're on a roll.\nA: Just lucky I guess.\nB: Nah, you're talented.\nA: Drinks on me tonight?\nB: I'm not saying no to that.",
    "japanese": "絶好調（ぜっこうちょう）だね！／ノッてるね！",
    "chinese": "你最近运气真好 (Nǐ zuìjìn yùnqi zhēn hǎo) / 你正在兴头上 (Nǐ zhèngzài xìingtóu shàng)",
    "spanish": ""
  },
  {
    "id": 1036,
    "primary": "The deal fell through",
    "meaning": "거래가 무산됐어.",
    "similar": [
      "didn't happen",
      "collapsed",
      "fell apart",
      "deal is dead",
      "no go"
    ],
    "example": "A: Did you get the apartment?\nB: No, the deal fell through.\nA: What happened?\nB: Landlord wanted more deposit.\nA: That sucks.\nB: Back to Craigslist searching.",
    "japanese": "話（はなし）が流（なが）れたよ。／ダメになった。",
    "chinese": "成交不了了 (Chéngjiāo bù liǎo le) / 黄了 (Huáng le)",
    "spanish": ""
  },
  {
    "id": 1037,
    "primary": "I had a falling out with him.",
    "meaning": "그와 다퉜어요.",
    "similar": [
      "We had a disagreement.",
      "We're no longer friends.",
      "We had a big argument.",
      "We've stopped speaking to each other.",
      "Our relationship turned sour."
    ],
    "example": "A: How is your best friend doing? I haven't seen him around lately.\nB: Honestly? I had a falling out with him last month. We haven't talked since.\nA: Oh no! I'm so sorry to hear that. I thought you guys were inseparable.\nB: Yeah, me too, but some things just can't be easily fixed.\nA: I feel you. If you ever wanna talk about it, I'm here.\nB: Thanks. I appreciate the support, for real.",
    "japanese": "彼（かれ）と仲違（なかたが）いしたんだ。／喧嘩（けんか）別（わか）れした。",
    "chinese": "我和他闹翻了 (Wǒ hé tā nàofān le) / 我们产生隔阂了 (Wǒmen chǎnshēng géhé le)",
    "spanish": ""
  },
  {
    "id": 1038,
    "primary": "It's not rocket science.",
    "meaning": "그렇게 어려운 일이 아니에요.",
    "similar": [
      "It's simple.",
      "It's not complicated at all.",
      "Anyone can do it.",
      "It's quite straightforward.",
      "Don't overthink it, it's easy."
    ],
    "example": "A: I'm struggling to set up this new coffee machine. There are so many buttons!\nB: Chill out. It's not rocket science. Just press the 'brew' button after adding water.\nA: But what about all these other settings? 'Aroma', 'Strength'...\nB: Just ignore those for now. Start with the basics and you'll be fine.\nA: Alright, alright. I'm overthinking it as usual.\nB: Facts. Just focus on your morning cup of joe.",
    "japanese": "難（むずか）しいことじゃないよ。／誰（だれ）にでもできるよ。",
    "chinese": "并不难 (Bìng bù nán) / 没什么深奥的 (Méishénme shēn'ào de)",
    "spanish": ""
  },
  {
    "id": 1039,
    "primary": "We all have to pick up the slack.",
    "meaning": "부족한 부분을 보충해야 해요.",
    "similar": [
      "We need to compensate for the missing effort.",
      "Everyone needs to help out more.",
      "Contribute extra when others can't.",
      "Compensate for someone else's deficiency.",
      "Tackle the overflow work."
    ],
    "example": "A: Since two developers left unexpectedly, things have been crazy.\nB: I know. We all have to pick up the slack until new hires are on board.\nA: I'm already taking on three extra projects myself.\nB: For real. It's not ideal, but it's what's needed right now.\nA: Hopefully they find some good replacements soon.\nB: Facts. We can't keep this pace up forever.",
    "japanese": "みんなでカバーしなきゃ。／遅（おく）れを取（と）り戻（もど）さなきゃ。",
    "chinese": "咱们得补上空缺 (Zánmen děi bǔ shàng kòngquē) / 得把剩下的活儿干了 (Děi bǎ shèngxià de huór gàn le)",
    "spanish": ""
  },
  {
    "id": 1040,
    "primary": "I threw caution to the wind.",
    "meaning": "위험을 무릅쓰고 감행했어요.",
    "similar": [
      "I took a big risk.",
      "I acted impulsively.",
      "I was reckless.",
      "I ignored all warnings.",
      "I just went for it without worrying about the consequences."
    ],
    "example": "A: You actually booked a flight to Bali without checking your bank account?\nB: Yeah! I just threw caution to the wind and went for it. YOLO!\nA: That's either incredibly brave or very bold of you.\nB: A bit of both, I guess. I just really needed a break from reality.\nA: I feel you. Sometimes you just gotta take the leap, right?\nB: Facts. I'll figure out the money situation later. For now, it's island time.",
    "japanese": "思（おも）い切（き）ってやったよ。／後先（あとさき）考（かんが）えずにやった。",
    "chinese": "豁出去了 (Huō chūqù le) / 不顾一切 (Bùgùyīqiè)",
    "spanish": ""
  },
  {
    "id": 1041,
    "primary": "Beauty is only skin deep.",
    "meaning": "외모는 겉모습일 뿐이에요.",
    "similar": [
      "Personality matters more than looks.",
      "Outer appearance can be deceiving.",
      "True value is internal.",
      "Character is what truly counts.",
      "Don't judge a book by its cover."
    ],
    "example": "A: He's so attractive! But honestly, he's kind of rude to everyone.\nB: See? Beauty is only skin deep. You gotta find someone with a good heart.\nA: I know, I know. I just wish he was nicer.\nB: For real. Aesthetic only takes you so far in a real relationship.\nA: Facts. I'm definitely looking for something more substantial now.\nB: Exactly. Personality is the real winner.",
    "japanese": "人は見（み）かけによらないよ。／大事（だいじ）なのは中身（なかみ）だよ。",
    "chinese": "美貌只是表面的 (Měimào zhǐshì biǎomiàn de) / 心灵美才是真的美 (Xīnlíng měi cáishì zhēnde měi)",
    "spanish": ""
  },
  {
    "id": 1042,
    "primary": "I'm not good with words.",
    "meaning": "말주변이 없어요.",
    "similar": [
      "I struggle to express myself.",
      "I'm not a smooth talker.",
      "I find it hard to say what I mean.",
      "I'm a bit shy in conversations.",
      "Communication isn't my strongest skill."
    ],
    "example": "A: You should tell her how you really feel. Be romantic!\nB: Honestly? I'm not good with words. I always get tongues-tied around her.\nA: Try writing her a letter instead. It's more thoughtful and less pressure.\nB: That's a good idea. I can take my time and say exactly what I mean.\nA: Exactly. Just be sincere and she'll love it.\nB: Thanks for the advice. I'll get started on that tonight.",
    "japanese": "口下手（くちべた）なんです。／言葉（ことば）にするのが苦手（にがて）で。",
    "chinese": "我不善辞令 (Wǒ bùshàn cílìng) / 我挺笨嘴拙舌的 (Wǒ tǐng bènzuǐzhuōshé de)",
    "spanish": ""
  },
  {
    "id": 1043,
    "primary": "I'm running on fumes.",
    "meaning": "기운이 하나도 없어요.",
    "similar": [
      "I'm at the end of my energy.",
      "I'm incredibly tired.",
      "I'm barely hanging on.",
      "I'm exhausted.",
      "I have no more stamina."
    ],
    "example": "A: Do you wanna grab a late-night snack after this shift?\nB: Honestly? I'm running on fumes. I just want to go home and sleep.\nA: I feel you. It's been a long day for both of us.\nB: For real. I've been awake for like eighteen hours. My brain is fried.\nA: Get some rest then! We'll catch up tomorrow when you're human again.\nB: Facts. See you later.",
    "japanese": "もうヘトヘトだよ。／ガス欠（けつ）寸前（すんぜん）だよ。",
    "chinese": "精疲力竭 (Jīngpílìjié) / 累得快虚脱了 (Lèi de kuài xūtuō le)",
    "spanish": ""
  },
  {
    "id": 1044,
    "primary": "I call the shots.",
    "meaning": "내가 결정권을 갖고 있어요.",
    "similar": [
      "I'm in charge here.",
      "I make the final decision.",
      "I'm the boss.",
      "Everything goes through me.",
      "I have the last word."
    ],
    "example": "A: Should we ask the team which direction we should go for the project?\nB: Look, I call the shots around here. We're going with my plan.\nA: I just thought some extra input would be helpful.\nB: I appreciate that, but I have the most experience and I'm leading this.\nA: Alright, if that's how it's gonna be. I'll just follow the lead.\nB: Smart move. Let's stay focused and execute.",
    "japanese": "私（わたし）が仕切（しき）るよ。／決定権（けっていけん）は私（わたし）にある。",
    "chinese": "我说了算 (Wǒ shuō le suàn) / 我做主 (Wǒ zuòzhǔ)",
    "spanish": ""
  },
  {
    "id": 1045,
    "primary": "I have butterflies in my stomach.",
    "meaning": "너무 긴장돼요.",
    "similar": [
      "I'm very nervous.",
      "I'm feeling anxious.",
      "I have that nervous fluttering feeling.",
      "I'm slightly terrified but excited.",
      "I'm feeling jumpy."
    ],
    "example": "A: You're about to go out on stage in front of five thousand people!\nB: I know! I have serious butterflies in my stomach right now.\nA: Just take a deep breath and remember why you're here.\nB: I'm trying! But my hands are literally shaking. This is insane.\nA: You've got this. Once you get out there, the nerves will fade away.\nB: Thanks. I'm going for it. See you on the other side!",
    "japanese": "ドキドキしてる。／緊張（きんちょう）で胃（い）が痛（いた）い。",
    "chinese": "我心里忐忑不安 (Wǒ xīnlǐ tǎntè bù'ān) / 我挺紧张的 (Wǒ tǐng jǐnzhāng de)",
    "spanish": ""
  },
  {
    "id": 1046,
    "primary": "You've been left on read.",
    "meaning": "읽씹 당했네요.",
    "similar": [
      "They saw your message and didn't reply.",
      "Ghosted via text.",
      "Ignored after reading.",
      "Message read but no response.",
      "Stuck on seen."
    ],
    "example": "A: It's been six hours and he still hasn't replied to my text.\nB: Ouch. Looks like you've been left on read, my friend.\nA: But he was just active on Instagram two minutes ago!\nB: That's a classic sign. Honestly? Just let it go for now.\nA: I hate that feeling so much. It's so awkward.\nB: Facts. Don't double text. Just wait and see if he eventually reaches out.",
    "japanese": "既読（きどく）スルーされたね。／無視（むし）されてるね。",
    "chinese": "被无视了 (Bèi wúshì le) / 已读不回 (Yǐ dú bù huí)",
    "spanish": ""
  },
  {
    "id": 1047,
    "primary": "She doted on me.",
    "meaning": "나를 애지중지했어요.",
    "similar": [
      "She spoiled me with affection.",
      "She adored me.",
      "She showered me with love.",
      "She was overly fond of me.",
      "She really took great care of me."
    ],
    "example": "A: It's so nice to see how much your grandma loves you.\nB: Yeah, she always doted on me when I was growing up. I was her favorite.\nA: I can tell! She always has your favorite cookies ready when we visit.\nB: For real. She's the best. I try to visit her as often as I can.\nA: That's sweet. Family connections like that are precious.\nB: Facts. I really appreciate everything she's done for me.",
    "japanese": "彼女（かのじょ）は私（わたし）を猫（ねこ）っ可愛（かわ）がりした。／甘（あま）やかされた。",
    "chinese": "她很疼我 (Tā hěn téng wǒ) / 她把我当个宝 (Tā bǎ wǒ dāng gè bǎo)",
    "spanish": ""
  },
  {
    "id": 1048,
    "primary": "I made it from scratch.",
    "meaning": "맨 처음부터 직접 만들었어요.",
    "similar": [
      "I created it entirely by myself.",
      "It's handmade/home-made.",
      "I didn't use any shortcuts.",
      "I built it from zero.",
      "It's an original creation."
    ],
    "example": "A: This pasta sauce is incredible! Where did you get the recipe?\nB: Honestly? I made it from scratch using tomatoes from my own garden.\nA: No way! This tastes like it's from a high-end restaurant.\nB: Thanks! It takes a while to simmer everything down, but it's totally worth it.\nA: You should definitely start selling this. People would love it.\nB: Maybe one day! For now, it's just for friends.",
    "japanese": "一（いち）から手作（てづく）りしたんだ。／全（ずべ）て自分（じぶん）で作（つく）った。",
    "chinese": "从头开始做的 (Cóngtóu kāishǐ zuò de) / 纯手工制作 (Chún shǒugōng zhìzuò)",
    "spanish": ""
  },
  {
    "id": 1049,
    "primary": "Don't steal my thunder.",
    "meaning": "내 공을 가로채지 마세요.",
    "similar": [
      "Don't take credit for my work.",
      "Don't overshadow me.",
      "Stop taking the spotlight for yourself.",
      "Let me have my moment.",
      "Don't ruin my big reveal."
    ],
    "example": "A: I was just about to tell everyone about the new partnership...\nB: But I already posted it on the company Slack channel this morning!\nA: Yo! Don't steal my thunder like that! I wanted to announce it officially.\nB: My bad! I thought you wanted it out as soon as possible.\nA: I did, but I also wanted to share the credit with the team during the meeting.\nB: I see. I'm sorry. I'll let you handle the rest of the updates then.",
    "japanese": "手柄（てがら）を横取（よこど）りしないで。／いいとこ取（と）りしないで。",
    "chinese": "别抢我的风头 (Bié qiǎng wǒ de fēngtóu) / 别抢我的功劳 (Bié qiǎng wǒ de gōngláo)",
    "spanish": ""
  },
  {
    "id": 1050,
    "primary": "He clammed up.",
    "meaning": "입을 꾹 다물었어요.",
    "similar": [
      "He stopped talking entirely.",
      "He became silent.",
      "He refused to speak.",
      "He shut down in conversation.",
      "He was speechless."
    ],
    "example": "A: Did you ask him about the missing files yet?\nB: Yeah, but as soon as I mentioned the budget, he just clammed up.\nA: That's suspicious. He's usually so talkative about everything else.\nB: For real. It's like he's hiding something he doesn't want me to find.\nA: I should probably have a more formal chat with him tomorrow.\nB: Good luck with that. He's acting very strange lately.",
    "japanese": "彼（かれ）は黙（だま）り込（こ）んじゃった。／貝（かい）になっちゃった。",
    "chinese": "他守口如瓶 (Tā shǒukǒurúpíng) / 他一言不发 (Tā yīyánbùfā)",
    "spanish": ""
  },
  {
    "id": 1051,
    "primary": "I would go on a spending spree.",
    "meaning": "돈을 펑펑 쓰고 싶어요.",
    "similar": [
      "I'd shop until I drop.",
      "I'd spend all my money at once.",
      "I'd indulge in excessive shopping.",
      "I'd buy everything I want.",
      "I'd blow all my cash on fun things."
    ],
    "example": "A: If I won the lottery today, the first thing I'd do is hire a financial advisor.\nB: Not me! I would go on a huge spending spree at all the luxury stores in SoHo.\nA: Aren't you worried about running out of money eventually?\nB: Not with a hundred million dollars! I'd have plenty to spare.\nA: Facts, but I'd still be nervous about losing it all overnight.\nB: Live a bit! Life is too short for all that worry.",
    "japanese": "豪遊（ごうゆう）したいな。／パーッと使（つか）いたい。",
    "chinese": "我要疯狂购物 (Wǒ yào fēngkuáng gòuwù) / 我要买买买 (Wǒ yào mǎi mǎi mǎi)",
    "spanish": ""
  },
  {
    "id": 1052,
    "primary": "I don't want to open up a can of worms.",
    "meaning": "문제를 복잡하게 만들고 싶지 않아요.",
    "similar": [
      "I don't want to cause more problems.",
      "Let's not get into a complicated situation.",
      "Avoiding unnecessary drama.",
      "I'd rather not start something complex.",
      "Keep the peace by not mentioning it."
    ],
    "example": "A: Should we mention the unresolved issue from last month during the meeting?\nB: Honestly? I don't want to open up a can of worms right now. Let's focus on today's tasks.\nA: I agree, it might derail the whole conversation for hours.\nB: Exactly. We have enough on our plate without more drama.\nA: We'll bring it up in a separate session then.\nB: Facts. Better to handle it when we have more time to properly deal with it.",
    "japanese": "寝（ね）た子（こ）を起（お）こしたくない。／ややこしくしたくない。",
    "chinese": "我不想惹麻烦 (Wǒ bùxiǎng rě máfan) / 我不想捅娄子 (Wǒ bùxiǎng tǒng lóuzi)",
    "spanish": ""
  },
  {
    "id": 1053,
    "primary": "It's my treat.",
    "meaning": "제가 낼게요.",
    "similar": [
      "I'm paying.",
      "The bill is on me.",
      "I'll handle the check.",
      "No, let me pay for this.",
      "It's my shout."
    ],
    "example": "A: This dinner was incredible! Let's split it fifty-fifty.\nB: No way, don't worry about it. It's my treat today since you helped me with my project.\nA: Are you sure? That was a really expensive meal though.\nB: 100%. I really appreciate all your support lately. It means a lot.\nA: Thank you so much! I'll get the next round for sure then.\nB: Say less. It was my pleasure!",
    "japanese": "私（わたし）のおごりです。／ここは持（も）ちます。",
    "chinese": "我请客 (Wǒ qǐngkè) / 这顿算我的 (Zhè dùn suàn wǒ de)",
    "spanish": ""
  },
  {
    "id": 1054,
    "primary": "Snap out of it!",
    "meaning": "정신 차려!",
    "similar": [
      "Wake up!",
      "Get focused again!",
      "Come back to reality!",
      "Stop spacing out!",
      "Get your head in the game!"
    ],
    "example": "A: I was just imagining what it would be like to live on Mars for a year...\nB: Yo! Snap out of it! We have a deadline in thirty minutes and you haven't even started.\nA: My bad! I got lost in my own thoughts for a second.\nB: Clearly! Let's focus on the actual work before the boss gets mad.\nA: On it. I'm locked in now, I promise.\nB: That's what I like to hear. Let's get it done.",
    "japanese": "しっかりして！／目（め）を覚（さ）まして！",
    "chinese": "振作点！ (Zhènzuò diǎn!) / 醒醒吧！ (Xǐngxǐng ba!)",
    "spanish": ""
  },
  {
    "id": 1055,
    "primary": "You got us into this mess.",
    "meaning": "당신 때문에 이 지경이 됐어요.",
    "similar": [
      "It's your fault we're in this situation.",
      "You caused this problem.",
      "This is all because of you.",
      "You led us into this trouble.",
      "We're here because of your decision."
    ],
    "example": "A: Why are we stuck in the middle of a traffic jam in Brooklyn at midnight?\nB: Look, you're the one who thought this shortcut was a 'game changer'! \nA: I didn't know there was literally going to be construction on every single block!\nB: Well, you got us into this mess, so now we're just gonna have to wait it out.\nA: I'm sorry, okay? I was just trying to save us some time.\nB: Next time, let's just use the regular GPS and stay on the main road.",
    "japanese": "お前（まえ）のせいだよ。／君（きみ）が巻（ま）いた種（たね）だよ。",
    "chinese": "是你把我们害惨了 (Shì nǐ bǎ wǒmen hài cǎn le) / 都是你惹的祸 (Dōushì nǐ rě de huò)",
    "spanish": ""
  },
  {
    "id": 1056,
    "primary": "It's not what it looks like.",
    "meaning": "오해하지 마세요.",
    "similar": [
      "You're misinterpreting the situation.",
      "Let me explain the truth.",
      "It's not as it appears.",
      "There's a logical explanation for this.",
      "Don't jump to conclusions."
    ],
    "example": "A: Why were you at the office at 3 AM with all the lights off?\nB: Honestly? It's not what it looks like. I just forgot my keys and didn't want to bother anyone.\nA: That sounds incredibly suspicious, don't you think?\nB: I know! I was literally crawling through the window when security saw me.\nA: Wow, that's intense. I'm just glad you didn't get arrested.\nB: Facts. I'm definitely not doing that again.",
    "japanese": "誤解（ごかい）だよ！／見（み）た目（め）とは違（ちが）うんだ！",
    "chinese": "不是你想的那样 (Búshì nǐ xiǎng de nàyàng) / 你误会了 (Nǐ wùhuì le)",
    "spanish": ""
  },
  {
    "id": 1057,
    "primary": "What's your guilty pleasure?",
    "meaning": "너만의 죄책감 드는 즐거움은 뭐야?",
    "similar": [
      "secret obsession",
      "bad habit",
      "indulgence",
      "cheat treat",
      "hidden joy"
    ],
    "example": "A: What's your guilty pleasure?\nB: Watching reality trash TV.\nA: Like 'Love Island'?\nB: Exactly. It's so bad it's good.\nA: I won't judge.\nB: You watch it too, don't you?",
    "japanese": "やめられない楽（たの）しみは何（なに）？／ギルティ・プレジャーってある？",
    "chinese": "你有什么坏习惯？ (Nǐ yǒu shénme huài xíguàn?) / 你的罪恶快感是什么？ (Nǐ de zuìè kuàigǎn shì shénme?)",
    "spanish": ""
  },
  {
    "id": 1058,
    "primary": "I got the short straw.",
    "meaning": "재수 없게 제가 걸렸어요.",
    "similar": [
      "I was chosen for the worst task.",
      "I got unlucky.",
      "I ended up with the responsibility no one wanted.",
      "Fate wasn't on my side this time.",
      "I'm stuck with the undesirable duty."
    ],
    "example": "A: Why are you cleaning the coffee machine on a Friday afternoon?\nB: Ugh, I got the short straw during the team meeting today. Everyone else escaped.\nA: That's rough! It always seems to be you, doesn't it?\nB: For real. I think they're secretly out to get me at this point.\nA: I'll help you finish it so you can leave earlier too.\nB: You're a legend! I really appreciate that, for real.",
    "japanese": "貧乏（びんぼう）くじ引（ひ）いちゃった。／ハズレ引（ひ）いた。",
    "chinese": "我倒霉了 (Wǒ dǎoméi le) / 我抽到了下下签 (Wǒ chōudàole xiàxiàqiān)",
    "spanish": ""
  },
  {
    "id": 1059,
    "primary": "She truly is the GOAT.",
    "meaning": "그녀는 정말 최고예요.",
    "similar": [
      "She's the greatest of all time.",
      "She's unmatched in her field.",
      "She's an absolute legend.",
      "She's at the top of her game.",
      "She's a total icon."
    ],
    "example": "A: Did you see Beyonce's performance last night? It was insane!\nB: 100%. She truly is the GOAT. No one else even comes close.\nA: The production, the vocals, the energy... it was just a whole different level.\nB: Facts. She's been consistent for decades now. It's pure dedication.\nA: I want to be like her when I grow up. Not even joking.\nB: We all do. She's a true inspiration to everyone.",
    "japanese": "彼女（かのじょ）はマジで神（かみ）だよ。／史上最高（しじょうさいこう）だよ。",
    "chinese": "她真是永远的神 (Tā zhēnshì yǒngyuǎn de shén) / 她是绝对的传奇 (Tā shì juéduì de chuánqí)",
    "spanish": ""
  },
  {
    "id": 1060,
    "primary": "I've got a lot of mixed emotions.",
    "meaning": "만감이 교차하네요.",
    "similar": [
      "I'm feeling many things at once.",
      "I have conflicting feelings.",
      "I'm not exactly sure how to feel.",
      "It's a complicated emotional situation.",
      "I'm feeling bittersweet."
    ],
    "example": "A: How do you feel about moving to a whole new city for the first time?\nB: Honestly? I've got a lot of mixed emotions. Excitement, but also a lot of fear.\nA: That's totally normal! It's a huge life change for you.\nB: For real. I'm gonna miss all my friends here, but the new opportunity is dope.\nA: Just take it one step at a time. You'll settle in before you know it.\nB: Thanks. I'm trying to stay positive and focused on the future.",
    "japanese": "複雑（ふくざつ）な心境（しんきょう）だよ。／何（なん）とも言（い）えない気持（きも）ち。",
    "chinese": "我百感交集 (Wǒ bǎigǎn jiāojí) / 我心情很复杂 (Wǒ xīnqíng hěn fùzá)",
    "spanish": ""
  },
  {
    "id": 1061,
    "primary": "I've seen worse.",
    "meaning": "이것보다 더 심한 것도 봤어요.",
    "similar": [
      "This isn't as bad as it could be.",
      "I've encountered worse situations before.",
      "It's manageable compared to my past experiences.",
      "It's not the end of the world.",
      "I've dealt with more difficult things."
    ],
    "example": "A: Look at the state of this office after the party! It's a disaster!\nB: Chill out. I've seen worse. At least there's no permanent damage.\nA: You call this manageable? There's literally glitter on every single surface!\nB: It'll take a few hours to clean up, but it's not the worst thing I've ever seen.\nA: You should've seen my college dorm after finals week then.\nB: Facts. This is basically a nursery school compared to that chaos.",
    "japanese": "もっと酷（ひど）いの見（み）たことあるよ。／まだマシな方（ほう）だよ。",
    "chinese": "我见过更糟的 (Wǒ jiànguò gèng zāo de) / 这还不算最坏的 (Zhè hái búsuàn zuìhuài de)",
    "spanish": ""
  },
  {
    "id": 1062,
    "primary": "The tea tastes funny.",
    "meaning": "차 맛이 이상해요.",
    "similar": [
      "The tea tastes unusual.",
      "Something is off about this tea.",
      "This tea has a strange flavor.",
      "I'm not liking the taste of this tea.",
      "Is this tea expired or something?"
    ],
    "example": "A: You didn't finish your matcha latte. Is everything okay with it?\nB: Honestly? The tea tastes funny. It's almost... metallic?\nA: Oh no! Maybe the milk was off or the water wasn't filtered correctly.\nB: For real. It's definitely not the usual quality I expect from this place.\nA: I'll go ask them to remake it for you. You shouldn't have to drink that.\nB: Thanks, I appreciate it. I was just gonna leave it but it's so expensive!",
    "japanese": "お茶（ちゃ）の味（あじ）が変（へん）だ。／なんかおかしな味（あじ）がする。",
    "chinese": "这茶味道怪怪的 (Zhè chá wèidào guàiguài de) / 茶有点不对劲 (Chá yǒudiǎn búduìjìn)",
    "spanish": ""
  },
  {
    "id": 1063,
    "primary": "That's a steal.",
    "meaning": "거저나 다름없네요.",
    "similar": [
      "That's an incredible deal.",
      "It's very cheap for the value.",
      "What an amazing price!",
      "I'm essentially getting it for free.",
      "That's a total bargain."
    ],
    "example": "A: Look at these vintage boots I found for only twenty bucks!\nB: No way! They look like they're worth at least two hundred. That's a steal.\nA: I know! I saw them in the back of the store and couldn't believe the price tag.\nB: You definitely scored big time today. Those are gonna look dope with your outfit.\nA: Facts. Thrifting is honestly my favorite thing to do on weekends.\nB: Same. Nothing beats that feeling of finding a diamond in the rough.",
    "japanese": "超（ちょう）お買（か）い得（どく）だよ。／タダ同然（どうぜん）だよ。",
    "chinese": "真便宜 (Zhēn piányi) / 简直是白菜价 (Jiǎnzhí shì báicàijià)",
    "spanish": ""
  },
  {
    "id": 1064,
    "primary": "Now is the time to decide.",
    "meaning": "지금이 결정할 때예요.",
    "similar": [
      "Decision time is now.",
      "We can't wait any longer to choose.",
      "Finalize your choice immediately.",
      "The deadline for deciding has arrived.",
      "Make up your mind now."
    ],
    "example": "A: I'm still not sure which summer internship I should take.\nB: Look, now is the time to decide. Both offers expire by the end of today.\nA: I know, both are so good but for different reasons!\nB: Just go with your gut feeling. Which one makes you feel more excited about the work?\nA: Honestly? The creative agency one. I'm just worried about the pay.\nB: Facts, but the experience might lead to something way bigger later. Just do it!",
    "japanese": "今（いま）が決（き）め時（どき）だよ。／今（いま）決断（けつだん）しなきゃ。",
    "chinese": "现在是做决定的时候了 (Xiànzài shì zuò juédìng de shíhou le) / 该拍板了 (Gāi pāibǎn le)",
    "spanish": ""
  },
  {
    "id": 1065,
    "primary": "I just winged it.",
    "meaning": "그냥 즉흥적으로 했어요.",
    "similar": [
      "I improvised without a plan.",
      "I didn't prepare at all.",
      "I just went for it spontaneously.",
      "I made it up as I went along.",
      "No planning involved, I just did it."
    ],
    "example": "A: Your presentation today was so smooth! How long did you spend practicing?\nB: Honestly? I didn't prepare at all. I just winged it based on what I remembered from the meeting.\nA: Wow! You're a natural at public speaking then. I would've been a mess.\nB: Thanks! I just try to stay calm and speak from the heart, you know?\nA: I wish I had that kind of confidence. I literally have to write everything down.\nB: Facts. Whatever works for you though, everyone has their own style.",
    "japanese": "ぶっつけ本番（ほんばん）でやったよ。／適当（てきとう）に合（あ）わせたよ。",
    "chinese": "我是临时发挥的 (Wǒ shì línshí fāhuī de) / 我没准备，硬上的 (Wǒ méi zhǔnbèi, yìngshàng de)",
    "spanish": ""
  },
  {
    "id": 1066,
    "primary": "It's my cheat day",
    "meaning": "오늘은 치트데이야.",
    "similar": [
      "eating whatever",
      "diet break",
      "cheat meal",
      "calorie overload",
      "day off diet"
    ],
    "example": "A: You ordered a whole pizza?\nB: It's my cheat day.\nA: I thought you were keto.\nB: Not today. Today I feast.\nA: Can I have a slice?\nB: Get your own, this is mine.",
    "japanese": "今日（きょう）はチートデイなんだ。／好（す）きなもの食（た）べる日（ひ）なんだ。",
    "chinese": "今天是我的放纵日 (Jīntiān shì wǒ de fàngzòngrì) / 今天不管嘴了 (Jīntiān bùguǎn zuǐ le)",
    "spanish": ""
  },
  {
    "id": 1067,
    "primary": "I'm at a loss for words.",
    "meaning": "할 말을 잃었어요.",
    "similar": [
      "I'm speechless.",
      "I don't know what to say.",
      "That left me stunned.",
      "I'm genuinely surprised.",
      "Words fail me right now."
    ],
    "example": "A: Surprise! We all pitched in to get you that guitar you've been eyeing!\nB: Oh my god... I'm at a loss for words right now. You guys are the best.\nA: We know how much you've been wanting to start playing again.\nB: This is incredible. I'm literally shaking.\nA: Just start practicing! We expect a concert by next month.\nB: Facts. I'm gonna get on that right away. Thank you so much!",
    "japanese": "言葉（ことば）が出（で）ないよ。／あきれてものが言（い）えない（良（い）い意味（いみ）でも悪（わる）い意味（いみ）でも）。",
    "chinese": "我无语了 (Wǒ wúyǔ le) / 我说不出话来 (Wǒ shuōbùchū huà lái)",
    "spanish": ""
  },
  {
    "id": 1068,
    "primary": "We went the extra mile.",
    "meaning": "기대 이상으로 노력했어요.",
    "similar": [
      "We put in extra effort.",
      "We exceeded expectations.",
      "We went above and beyond.",
      "We did more than what was required.",
      "We gave it 110 percent."
    ],
    "example": "A: The client was absolutely blown away by the final presentation.\nB: That's great! We really went the extra mile with those custom animations.\nA: For real. It took us all weekend, but it was totally worth it.\nB: Facts. Now we're definitely gonna get that contract extension.\nA: I'm just glad everyone's hard work paid off.\nB: Let's celebrate with a team dinner tonight.",
    "japanese": "特別（とくべつ）な努力（どりょく）をしたよ。／一歩（いっぽ）踏（ふ）み込（こ）んでやった。",
    "chinese": "我们加倍努力了 (Wǒmen jiābèi nǔlì le) / 我们做得超出了预期 (Wǒmen zuò de chāochūle yùqī)",
    "spanish": ""
  },
  {
    "id": 1069,
    "primary": "I canceled them.",
    "meaning": "손절했어요.",
    "similar": [
      "I've stopped interacting with them.",
      "I cut them out of my life.",
      "I'm done with them.",
      "I ghosted them for good.",
      "They are no longer in my circle."
    ],
    "example": "A: Haven't seen you hanging out with that group lately. What happened?\nB: Honestly? I canceled them after that drama last weekend. I don't need that energy.\nA: Wow, that's a bold move. They were your main friends for a while.\nB: I know, but life is too short for toxic people. No cap.\nA: I feel you. Sometimes you just gotta protect your peace.\nB: Facts. I'm much happier already.",
    "japanese": "彼（かれ）とは縁（えん）を切（き）ったよ。／ブロックした。",
    "chinese": "我跟他们绝交了 (Wǒ gēn tāmen juéjiāo le) / 我拉黑他们了 (Wǒ lāhēi tāmen le)",
    "spanish": ""
  },
  {
    "id": 1070,
    "primary": "I was swamped with work.",
    "meaning": "일에 파묻혀 지냈어요.",
    "similar": [
      "I was overwhelmed with tasks.",
      "I had so much to do.",
      "I was buried in work.",
      "I was incredibly busy.",
      "My schedule was completely full."
    ],
    "example": "A: Sorry I didn't get back to your text yesterday.\nB: No worries! I figured you were swamped with work for the big launch.\nA: For real. I didn't even have time to eat lunch until 4 PM.\nB: That sounds intense. Hope things are calming down today.\nA: A little bit, but I still have a mountain of emails to get through.\nB: Facts. The grind never stops, huh?",
    "japanese": "仕事（しごと）に追（お）われてたんだ。／めちゃくちゃ忙（いそが）しかった。",
    "chinese": "我忙得不可开交 (Wǒ máng dé bùkěkāijiāo) / 我忙死了 (Wǒ máng sǐ le)",
    "spanish": ""
  },
  {
    "id": 1071,
    "primary": "That's as cheap as chips.",
    "meaning": "정말 싸요.",
    "similar": [
      "That's a total bargain.",
      "It's incredibly inexpensive.",
      "It's dirt cheap.",
      "That's peanuts.",
      "You're getting it for next to nothing."
    ],
    "example": "A: I found this high-end blender at a garage sale for five dollars!\nB: No way! That's as cheap as chips. Those usually go for over a hundred.\nA: I know! I checked the price online as soon as I got home.\nB: You really scored big time today. Does it even work?\nA: Perfectly. I already made a smoothie this morning.\nB: Facts. What a lucky find!",
    "japanese": "激安（げきやす）だよ。／捨て値（すてね）だよ。",
    "chinese": "太便宜了 (Tài piányi le) / 便宜得要命 (Piányi dé yàomìng)",
    "spanish": ""
  },
  {
    "id": 1072,
    "primary": "Make yourself at home.",
    "meaning": "편히 계세요.",
    "similar": [
      "Feel comfortable here.",
      "Treat this place like your own.",
      "Mi casa es su casa.",
      "Don't be shy, settle in.",
      "Relax and enjoy yourself."
    ],
    "example": "A: Thanks for letting me stay here while I look for an apartment.\nB: Of course! Make yourself at home. There's plenty of space in the fridge.\nA: You're a lifesaver. I'll try not to get in the way too much.\nB: Chill. We've been friends for years. Just do your thing.\nA: I really appreciate it, for real.\nB: Say less. Let's grab some takeout tonight.",
    "japanese": "くつろいでね。／自分（じぶん）の家（いえ）だと思（おも）って。",
    "chinese": "别客气 (Bié kèqi) / 当自己家一样 (Dāng zìjǐ jiā yíyàng)",
    "spanish": ""
  },
  {
    "id": 1073,
    "primary": "Take it or leave it.",
    "meaning": "싫으면 마세요.",
    "similar": [
      "This is my final offer.",
      "Accept it or not.",
      "No further negotiations.",
      "Take the deal as it is.",
      "That's it, take it or walk away."
    ],
    "example": "A: I'll give you fifty bucks for that vintage jacket.\nB: No way, it's worth at least eighty. Sixty-five, take it or leave it.\nA: Sixty is the most I can do right now, honestly.\nB: Alright, fine. Take it or leave it, sixty is the final price.\nA: Okay, deal. I've been looking for this specific style for weeks.\nB: Facts. It's a classic piece.",
    "japanese": "嫌（いや）ならいいよ。／これで手（て）を打（う）って。",
    "chinese": "要就要，不要拉倒 (Yào jiù yào, búyào lādǎo) / 一口价 (Yìkǒujià)",
    "spanish": ""
  },
  {
    "id": 1074,
    "primary": "I don't want to have egg on my face.",
    "meaning": "창피당하고 싶지 않아요.",
    "similar": [
      "I want to avoid embarrassment.",
      "I don't want to look foolish.",
      "I want to save face.",
      "I don't want to be humiliated.",
      "I'm trying to avoid a public fail."
    ],
    "example": "A: Are you sure about these statistics for the meeting?\nB: Definitely. I don't want to have egg on my face in front of the board.\nA: Good thinking. They can be pretty brutal with their questions.\nB: For real. I've double-checked everything three times already.\nA: Better safe than sorry when it comes to the executives.\nB: Facts. I'm ready for whatever they throw at me.",
    "japanese": "恥（はじ）をかきたくないんだ。／顔（かお）に泥（どろ）を塗（ぬ）りたくない。",
    "chinese": "我不想丢脸 (Wǒ bùxiǎng diūliǎn) / 我不想出洋相 (Wǒ bùxiǎng chūyángxiàng)",
    "spanish": ""
  },
  {
    "id": 1075,
    "primary": "I'm at a crossroads.",
    "meaning": "갈림길에 서 있어요.",
    "similar": [
      "I'm at a turning point.",
      "I have a big decision to make.",
      "I'm faced with a difficult choice.",
      "My life is about to change direction.",
      "I'm uncertain about which path to take."
    ],
    "example": "A: I'm not sure if I should stay at this job or go back to grad school.\nB: It sounds like you're at a crossroads. What does your gut tell you?\nA: Honestly, it change every day. One minute I'm ready to quit, the next I'm fine.\nB: Maybe take a week off and clear your head?\nA: That's a good idea. I need to figure out what I really want long-term.\nB: Facts. Don't rush into anything you'll regret later.",
    "japanese": "岐路（きろ）に立（た）たされている。／決断（けつだん）の時（とき）だ。",
    "chinese": "我面临抉择 (Wǒ miànlín juézé) / 我在十字路口 (Wǒ zài shízìlùkǒu)",
    "spanish": ""
  },
  {
    "id": 1076,
    "primary": "I'm an open book.",
    "meaning": "숨기는 게 없어요.",
    "similar": [
      "I'm very transparent.",
      "I don't keep secrets.",
      "I'm easy to read.",
      "I'm honest about everything.",
      "You can ask me anything."
    ],
    "example": "A: You always seem so honest about everything in your life.\nB: Yeah, I'm an open book. I don't see the point in hiding things.\nA: I wish I could be more like that. I'm always worried about what people think.\nB: Life is much easier when you're just yourself. No cap.\nA: I guess it takes a lot of confidence to be that vulnerable.\nB: Facts. But it's totally worth it for the real connections you make.",
    "japanese": "隠（かく）し事（ごと）はないよ。／何（なん）でもオープンだよ。",
    "chinese": "我这人没秘密 (Wǒ zhè rén méi mìmì) / 我很坦率 (Wǒ hěn tǎnshuài)",
    "spanish": ""
  },
  {
    "id": 1077,
    "primary": "There was a little bit of a kerfuffle.",
    "meaning": "약간의 소동이 있었어요.",
    "similar": [
      "There was a minor disturbance.",
      "There was a bit of a fuss.",
      "A small commotion occurred.",
      "Things got a little messy for a second.",
      "It was a slight disagreement."
    ],
    "example": "A: What was all that noise in the lobby earlier?\nB: Oh, there was a little bit of a kerfuffle over a missing delivery.\nA: Did they figure it out? Everyone sounded pretty heated.\nB: Yeah, turns out it was just at the wrong door. All good now.\nA: People really lose their cool over the smallest things sometimes.\nB: Facts. Delivery day brings out the crazy in everyone.",
    "japanese": "ちょっとした騒動（そうどう）があったんだ。／揉（も）め事（ごと）があった。",
    "chinese": "出了点小乱子 (Chūle diǎn xiǎo luànzi) / 有点小骚动 (Yǒudiǎn xiǎo sāodòng)",
    "spanish": ""
  },
  {
    "id": 1078,
    "primary": "The boys didn't cut the mustard.",
    "meaning": "기대에 미치지 못했어요.",
    "similar": [
      "They weren't good enough.",
      "They failed to meet the standard.",
      "They didn't perform as expected.",
      "They were inadequate for the task.",
      "They fell short of the goal."
    ],
    "example": "A: How did the new interns do on their first assignment?\nB: Honestly? The boys didn't cut the mustard. I've had to redo most of it.\nA: That's disappointing. I thought they were supposed to be top-tier.\nB: They have the degrees, but no real-world experience. It shows.\nA: Maybe they just need a bit more time to adjust?\nB: Possibly, but right now, it's more work for me. Facts.",
    "japanese": "期待（きたい）外（はず）れだったな。／使（つか）い物（もの）にならなかった。",
    "chinese": "那些小伙子不行 (Nàxiē xiǎohuǒzi bùxíng) / 没达到要求 (Méi dádào yāoqiú)",
    "spanish": ""
  },
  {
    "id": 1079,
    "primary": "How thoughtful of you to say that.",
    "meaning": "그렇게 말해주니 고맙네요.",
    "similar": [
      "Thank you for being so kind.",
      "That's very nice of you to mention.",
      "I appreciate your kind words.",
      "You're so considerate.",
      "That means a lot coming from you."
    ],
    "example": "A: I really think your new project is going to change the industry.\nB: Wow, how thoughtful of you to say that. I've been working so hard on it.\nA: It really shows. Your dedication is inspiring, for real.\nB: I appreciate the support. It's been a long journey.\nA: You deserve all the success that's coming your way.\nB: Facts. Thank you so much for the encouragement.",
    "japanese": "そう言（い）ってくれてありがとう。／気（き）が利（き）くね。",
    "chinese": "你真体贴 (Nǐ zhēn tǐtiē) / 谢谢你这么说 (Xièxie nǐ zhème shuō)",
    "spanish": ""
  },
  {
    "id": 1080,
    "primary": "There is a fat chance of you winning.",
    "meaning": "이길 가능성이 거의 없어요.",
    "similar": [
      "You have very little chance of winning.",
      "It's highly unlikely you'll succeed.",
      "Success is a long shot.",
      "Don't count on winning.",
      "Zero chance of you taking the W."
    ],
    "example": "A: I'm thinking about entering the city marathon next month.\nB: Honestly? There is a fat chance of you winning against those pros.\nA: Hey! I've been training for three months already!\nB: I know, but these guys train for years. Just being realistic.\nA: I'm still gonna do it for the experience though.\nB: Facts. That's a better mindset anyway. Just finish the race!",
    "japanese": "勝（か）ち目（め）はないよ。／可能性（かのうせい）はゼロに等（ひと）しいね。",
    "chinese": "你没什么希望赢 (Nǐ méi shénme xīwàng yíng) / 你赢的机会渺茫 (Nǐ yíng de jīhuì miǎománg)",
    "spanish": ""
  },
  {
    "id": 1081,
    "primary": "He finally got the message.",
    "meaning": "드디어 알아들었네요.",
    "similar": [
      "He finally understood.",
      "He eventually caught on.",
      "He got the hint at last.",
      "He's finally on the same page.",
      "He finally realized what was going on."
    ],
    "example": "A: After three warnings, he finally stopped showing up late.\nB: Good. It took him long enough, but he finally got the message.\nA: I was about to let him go, honestly.\nB: I think the threat of losing the job really motivated him.\nA: Facts. Some people just need a wake-up call to change.\nB: Glad things are finally running smoothly in the office.",
    "japanese": "やっとわかってくれたか。／遅（おそ）いよ気づくのが。",
    "chinese": "他终于明白了 (Tā zhōngyú míngbai le) / 他终于想通了 (Tā zhōngyú xiǎngtōng le)",
    "spanish": ""
  },
  {
    "id": 1082,
    "primary": "He's lying through his teeth.",
    "meaning": "새빨간 거짓말을 하고 있어요.",
    "similar": [
      "He's telling a total lie.",
      "He's being completely dishonest.",
      "He's lying boldly.",
      "He's full of it.",
      "He's absolutely capping right now."
    ],
    "example": "A: He told the boss he finished the entire report over the weekend.\nB: No way! I saw him at the beach on Saturday. He's lying through his teeth.\nA: I knew it! His version of the story didn't make any sense.\nB: For real. He thinks he can just fake his way through everything.\nA: I should probably mention what I saw to the manager then.\nB: Facts. Don't let him get away with that. It's not fair to the team.",
    "japanese": "彼（かれ）は平気（へいき）で嘘（うそ）をついてる。／見（み）え透（す）いた嘘（うそ）だ。",
    "chinese": "他在睁眼说瞎话 (Tā zài zhēngyǎn shuō xiāhuà) / 满嘴跑火车 (Mǎnzuǐ pǎo huǒchē)",
    "spanish": ""
  },
  {
    "id": 1083,
    "primary": "For lack of a better word",
    "meaning": "딱 맞는 말이 없어서.",
    "similar": [
      "so to speak",
      "essentially",
      "basically",
      "how do I put this",
      "in other words"
    ],
    "example": "A: It was just... weird.\nB: Weird how?\nA: For lack of a better word, 'cringe'.\nB: Ah, got it.\nA: Just uncomfortable vibes.\nB: Say no more.",
    "japanese": "適切（てきせつ）な言葉（ことば）が見（み）つからないけど／なんて言（い）えばいいか...",
    "chinese": "找不到更好的词 (Zhǎobúdào gèng hǎo de cí) / 姑且这么说吧 (Gūqiě zhème shuō ba)",
    "spanish": ""
  },
  {
    "id": 1084,
    "primary": "It's time to get moving.",
    "meaning": "이제 움직일 시간이에요.",
    "similar": [
      "Let's get started.",
      "We should head out now.",
      "Time to make a move.",
      "Let's push forward.",
      "Stop waiting and start doing."
    ],
    "example": "A: We've been sitting here for two hours talking about the plan.\nB: You're right. It's time to get moving and actually execute.\nA: Ready when you are. Let's head to the site.\nB: Grab your gear and let's go. We have a lot of work ahead.\nA: No more talking, just doing from now on.\nB: Facts. Let's show them what we're capable of.",
    "japanese": "そろそろ行（い）こうか。／動（うご）き出（だ）そう。",
    "chinese": "该行动了 (Gāi xíngdòng le) / 该走了 (Gāi zǒu le)",
    "spanish": ""
  },
  {
    "id": 1085,
    "primary": "That's the spirit!",
    "meaning": "바로 그 기세야!",
    "similar": [
      "That's a great attitude!",
      "Keep that positive energy going!",
      "Nice job staying motivated!",
      "I love the enthusiasm!",
      "Exactly, that's what I want to hear!"
    ],
    "example": "A: I'm not gonna let that setback stop me. I'm gonna try again tomorrow!\nB: That's the spirit! I knew you wouldn't give up that easily.\nA: For real. One failure doesn't define the whole project.\nB: Facts. Consistency is the key to winning anyway.\nA: I'm feeling more motivated than ever now.\nB: Let's get it! I'm right behind you.",
    "japanese": "その意気（いき）だよ！／いい心掛（こころが）けだ！",
    "chinese": "这就对了！ (Zhè jiù duì le!) / 这种精神就对了！ (Zhèzhǒng jīngshén jiù duì le!)",
    "spanish": ""
  },
  {
    "id": 1086,
    "primary": "I'm on the mend.",
    "meaning": "회복 중이에요.",
    "similar": [
      "I'm getting better.",
      "I'm recovering.",
      "I'm on the road to recovery.",
      "My health is improving.",
      "I'm feeling much better lately."
    ],
    "example": "A: How are you feeling after that flu you had last week?\nB: Much better, thanks. I'm on the mend and should be back in the office by Monday.\nA: That's great news! We've really missed having you around.\nB: I missed being there too. Staying in bed all day is so boring.\nA: Rest up for a few more days just to be safe though.\nB: Facts. I don't want to overdo it and get sick again.",
    "japanese": "良（よ）くなってきているよ。／回復（かいふく）に向（む）かってる。",
    "chinese": "我在康复中 (Wǒ zài kāngfù zhōng) / 我快好了 (Wǒ kuài hǎo le)",
    "spanish": ""
  },
  {
    "id": 1087,
    "primary": "You sold me.",
    "meaning": "설득당했어요.",
    "similar": [
      "I'm convinced.",
      "You've persuaded me.",
      "I'm on board with your idea.",
      "I agree with you now.",
      "You've won me over."
    ],
    "example": "A: Think about it: we'd have a pool, a private chef, and zero noise.\nB: Honestly? You sold me with the 'private chef' part. Let's book the villa.\nA: I knew that would be the game changer for you!\nB: For real. I'm tired of cooking every single day while on vacation.\nA: It's gonna be the most relaxing trip ever, I promise.\nB: Facts. I'm already counting down the days.",
    "japanese": "その気（き）になったよ。／君（きみ）に説得（せっとく）されたよ。",
    "chinese": "你说服我了 (Nǐ shuōfú wǒ le) / 我买账了 (Wǒ mǎizhàng le)",
    "spanish": ""
  },
  {
    "id": 1088,
    "primary": "I can't wrap my head around that.",
    "meaning": "도저히 이해가 안 가요.",
    "similar": [
      "I don't understand it at all.",
      "It's incomprehensible to me.",
      "I'm struggling to grasp the concept.",
      "It makes no sense to me.",
      "It's totally beyond my understanding."
    ],
    "example": "A: They're saying the universe is constantly expanding into... what, exactly?\nB: Honestly, I can't wrap my head around that either. It's too abstract.\nA: My brain literally starts hurting when I think about it for too long.\nB: Same. Physics is just on a whole different level, no cap.\nA: Maybe we should just stick to talking about movies instead.\nB: Facts. That's much easier for my human brain to handle.",
    "japanese": "全（まった）く理解（りかい）できない。／想像（そうぞう）もつかない。",
    "chinese": "我搞不懂 (Wǒ gǎobùdǒng) / 我无法理解 (Wǒ wúfǎ lǐjiě)",
    "spanish": ""
  },
  {
    "id": 1089,
    "primary": "That's so sweet of you.",
    "meaning": "정말 친절하시네요.",
    "similar": [
      "That's very kind of you.",
      "You're so thoughtful.",
      "I appreciate your kindness.",
      "That's lovely of you to do.",
      "You're such a sweetheart."
    ],
    "example": "A: I brought you some homemade soup since I heard you were feeling under the weather.\nB: Aw, that's so sweet of you! I really needed this right now.\nA: It's my grandma's recipe, so it's guaranteed to make you feel better.\nB: You're a lifesaver, for real. I'm gonna eat it right away.\nA: Let me know if you need anything else from the store later.\nB: Facts. You're the best friend a person could ask for.",
    "japanese": "優（やさ）しいね。／気遣（きづか）いが嬉（うれ）しいよ。",
    "chinese": "你真好 (Nǐ zhēn hǎo) / 你太甜了 (Nǐ tài tián le)",
    "spanish": ""
  },
  {
    "id": 1090,
    "primary": "I'll figure it out.",
    "meaning": "해결책을 찾을게요.",
    "similar": [
      "I'll find a solution.",
      "I'll sort it out.",
      "I'll manage it.",
      "I'll handle the problem.",
      "Leave it to me, I'll solve it."
    ],
    "example": "A: We lost the keys to the storage unit and we need that gear by tomorrow morning!\nB: Chill. I'll figure it out. I think I know where they might be hidden.\nA: I've looked everywhere! I'm starting to panic, honestly.\nB: Just take a deep breath. I've got this under control.\nA: I hope so. We really can't afford any more delays.\nB: Facts. I'll hit you up as soon as I find them.",
    "japanese": "何（なん）とかするよ。／自分（じぶん）で考（かんが）えるよ。",
    "chinese": "我会搞定的 (Wǒ huì gǎodìng de) / 我会想办法的 (Wǒ huì xiǎng bànfǎ de)",
    "spanish": ""
  },
  {
    "id": 1091,
    "primary": "Mobile technology is taking center stage.",
    "meaning": "모바일 기술이 중심이 되고 있어요.",
    "similar": [
      "Mobile is becoming the priority.",
      "Everything is revolving around smartphones now.",
      "Mobile tech is dominant.",
      "Mobile is at the forefront.",
      "Mobile technology is the main focus."
    ],
    "example": "A: Why are we prioritizing the mobile app over the web version this year?\nB: Look at the data. Mobile technology is taking center stage for our users.\nA: True, over eighty percent of our traffic comes from phones now.\nB: Exactly. We need to go where our audience is already spending their time.\nA: It's a big shift, but it definitely makes sense for the brand.\nB: Facts. It's all about staying relevant in this market.",
    "japanese": "モバイル技術（ぎじゅつ）が主役（しゅやく）になってるね。／中心（ちゅうしん）になってきてる。",
    "chinese": "移动技术成主流了 (Yídòng jìshù chéng zhǔliú le) / 手机是老大了 (Shǒujī shì lǎodà le)",
    "spanish": ""
  },
  {
    "id": 1092,
    "primary": "He will lay bare the ugly truth.",
    "meaning": "추악한 진실을 밝힐 거예요.",
    "similar": [
      "He will reveal the harsh reality.",
      "He'll expose everything that's wrong.",
      "He's going to tell the unfiltered truth.",
      "He'll uncover the hidden problems.",
      "He won't sugarcoat the situation."
    ],
    "example": "A: I heard the CEO is giving a state-of-the-company speech tomorrow.\nB: Yeah, and everyone's nervous because he said he will lay bare the ugly truth about our finances.\nA: No more corporate fluff then? That's actually kind of refreshing.\nB: In a way, yeah, but it might mean some serious layoffs are coming.\nA: That's the scary part. We've known things were bad for a while though.\nB: Facts. It's better to know the truth than to live in denial.",
    "japanese": "彼（かれ）は不都合（ふつごう）な真実（しんじつ）を暴（あば）くだろう。／全部（ぜんぶ）ぶちまけるだろう。",
    "chinese": "他会揭露丑陋的真相 (Tā huì jiēlù chǒulòu de zhēnxiàng) / 他会把老底都揭出来 (Tā huì bǎ lǎodǐ dōu jiē chūlái)",
    "spanish": ""
  },
  {
    "id": 1093,
    "primary": "I will leave no stone unturned.",
    "meaning": "온갖 수단을 다 쓸 거예요.",
    "similar": [
      "I'll search everywhere.",
      "I'll try every possible option.",
      "I'll be thorough in my search.",
      "I won't stop until I find it.",
      "I'm going to look into every detail."
    ],
    "example": "A: We still haven't found the source of the leak in the database.\nB: Don't worry. I will leave no stone unturned until we identify the problem.\nA: We've checked the logs, the server, everything... it's like a ghost.\nB: I'm going to do a deep dive into the actual code structure tonight.\nA: I appreciate the dedication. This is a critical issue for us.\nB: Facts. I won't sleep until this is resolved.",
    "japanese": "徹底的（てっていてき）にやるよ。／草（くさ）の根（ね）分（わ）けても捜（さが）すよ。",
    "chinese": "我会不遗余力 (Wǒ huì bùyíyúlì) / 我会想尽一切办法 (Wǒ huì xiǎngjìn yíqiè bànfǎ)",
    "spanish": ""
  },
  {
    "id": 1094,
    "primary": "I'm off to the gym.",
    "meaning": "나 헬스장 가요.",
    "similar": [
      "I'm heading to work out.",
      "I'm going to hit the gym.",
      "Time for my workout.",
      "I'm off for some exercise.",
      "Heading to the fitness center now."
    ],
    "example": "A: Hey, you wanna grab some pizza after work?\nB: I wish! But I'm off to the gym. I've been slacking lately.\nA: Respect. I should probably go too, but I'm just too lazy today.\nB: Come with me! You'll feel so much better after a good session.\nA: Maybe tomorrow. For now, it's just me and my sofa.\nB: Facts. Enjoy your rest then, I'll see you later!",
    "japanese": "ジムに行（い）ってくる。／筋（きん）トレしてくる。",
    "chinese": "我去健身了 (Wǒ qù jiànshēn le) / 我去锻炼了 (Wǒ qù duànliàn le)",
    "spanish": ""
  },
  {
    "id": 1095,
    "primary": "Here's the thing.",
    "meaning": "실은 이래요.",
    "similar": [
      "This is the situation.",
      "Actually, the point is this.",
      "Here's the main idea.",
      "Let me explain it plainly.",
      "Basically, this is what's happening."
    ],
    "example": "A: Why are you being so quiet today? Is everything okay?\nB: Look, here's the thing: I'm just really stressed about this move next week.\nA: Oh! I thought I did something to annoy you!\nB: No, not at all. It's just a lot to handle all by myself.\nA: I'm so sorry! I should have realized you needed some help.\nB: Facts. If you have any free time this weekend, let me know.",
    "japanese": "実（じつ）はこういうことなんだ。／要点（ようてん）はね...",
    "chinese": "事情是这样的 (Shìqing shì zhèyàng de) / 问题在于 (Wèntí zàiyú)",
    "spanish": ""
  },
  {
    "id": 1096,
    "primary": "The day can't come soon enough.",
    "meaning": "그날이 빨리 왔으면 좋겠어요.",
    "similar": [
      "I'm so looking forward to it.",
      "I can't wait for that day.",
      "I'm counting down the days.",
      "I wish it were that day already.",
      "I'm incredibly excited about it."
    ],
    "example": "A: Only three more days until we leave for Europe!\nB: For real. The day can't come soon enough. I'm so ready to disconnect.\nA: Have you finished all your packing yet?\nB: Almost. I just need to grab a few travel-size toiletries today.\nA: I'm so jealous! Take lots of pictures for me.\nB: Facts. I'll be posting them all over my feed, don't worry.",
    "japanese": "待（ま）ち遠（どお）しいよ。／早（はや）く来（こ）ないかな。",
    "chinese": "那一天快点来吧 (Nà yìtiān kuàidiǎn lái ba) / 等不及那一天了 (Děngbují nà yìtiān le)",
    "spanish": ""
  },
  {
    "id": 1097,
    "primary": "He has clout.",
    "meaning": "그는 영향력이 있어요.",
    "similar": [
      "He's influential.",
      "He has a lot of power.",
      "He's a big deal in the industry.",
      "He has social capital.",
      "People listen to what he says."
    ],
    "example": "A: How did he manage to get a meeting with the investors so quickly?\nB: Honestly? He has serious clout in the tech world. One phone call and he's in.\nA: I wish I had that kind of influence. It would make things so much easier.\nB: It takes years to build that kind of reputation, for real.\nA: Facts. I guess I'll just have to keep grinding until I get there.\nB: That's the only way to do it. Keep pushing.",
    "japanese": "彼（かれ）は顔（かお）が利（き）く。／影響力（えいきょうりょく）がある。",
    "chinese": "他很有影响力 (Tā hěn yǒu yǐngxiǎnglì) / 他是大佬 (Tā shì dàlǎo)",
    "spanish": ""
  },
  {
    "id": 1098,
    "primary": "He vanished into thin air.",
    "meaning": "감쪽같이 사라졌어요.",
    "similar": [
      "He disappeared completely.",
      "He went missing without a trace.",
      "He's nowhere to be found.",
      "He just evaporated.",
      "It's like he never existed."
    ],
    "example": "A: Where did that guy go who was talking to us earlier?\nB: Man, I have no idea. He literally vanished into thin air as soon as I turned my back.\nA: That's so creepy! He didn't even say goodbye or anything.\nB: For real. It's like he just phased out of reality. This place is weird.\nA: Maybe he was just an NPC in our simulation?\nB: Facts. Let's get out of here before something else happens.",
    "japanese": "煙（けむり）のように消（き）えた。／跡形（あとかた）もなく消（き）えた。",
    "chinese": "他凭空消失了 (Tā píngkōng xiāoshī le) / 人间蒸发了 (Rénjiān zhēngfā le)",
    "spanish": ""
  },
  {
    "id": 1099,
    "primary": "Don't change the subject.",
    "meaning": "말 돌리지 마세요.",
    "similar": [
      "Stay on topic.",
      "Don't try to distract me.",
      "Answer my question properly.",
      "Stop avoiding the issue.",
      "I'm still waiting for an answer on the original point."
    ],
    "example": "A: So, about the money you owe me from last month...\nB: Oh! Did you see that the new season of that show just dropped?\nA: Yo, don't change the subject. We were talking about the fifty bucks.\nB: Alright, alright. I'll Venmo you right now, chill out.\nA: Thank you. I've been asking you for weeks, man.\nB: Facts. My bad. It slipped my mind, I promise.",
    "japanese": "話（はなし）をそらさないで。／話題（わだい）を変（か）えないで。",
    "chinese": "别转移话题 (Bié zhuǎnyí huàtí) / 别打岔 (Bié dǎchà)",
    "spanish": ""
  },
  {
    "id": 1100,
    "primary": "I'm a glass half full person.",
    "meaning": "낙천적인 사람이에요.",
    "similar": [
      "I'm an optimist.",
      "I try to look on the bright side.",
      "I have a positive outlook.",
      "I'm naturally hopeful.",
      "I focus on the good things."
    ],
    "example": "A: Everything is going wrong today! This project is a absolute disaster.\nB: Look, I'm a glass half full person. At least we found the problem early.\nA: How can you be so positive right now? We're literally three days behind schedule!\nB: Panicking won't help. Let's just focus on what we can fix today.\nA: I guess you're right. Your attitude is actually kind of helpful, for real.\nB: Facts. Let's just take it one step at a time and we'll get through it.",
    "japanese": "楽観的（らっかんてき）なんだ。／物事（ものごと）を良（よ）い方（ほう）に捉（とら）えるタイプなんだ。",
    "chinese": "我比较乐观 (Wǒ bǐjiào lèguān) / 我凡事往好处想 (Wǒ fánshì wǎng hǎochù xiǎng)",
    "spanish": ""
  }
]